imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // UART registers (UART2)
  //
  //*****************************************************************************
  #define UART2_DR_R              (*((volatile unsigned long *)0x4000E000))
  #define UART2_RSR_R             (*((volatile unsigned long *)0x4000E004))
  #define UART2_ECR_R             (*((volatile unsigned long *)0x4000E004))
  #define UART2_FR_R              (*((volatile unsigned long *)0x4000E018))
  #define UART2_ILPR_R            (*((volatile unsigned long *)0x4000E020))
  #define UART2_IBRD_R            (*((volatile unsigned long *)0x4000E024))
  #define UART2_FBRD_R            (*((volatile unsigned long *)0x4000E028))
  #define UART2_LCRH_R            (*((volatile unsigned long *)0x4000E02C))
  #define UART2_CTL_R             (*((volatile unsigned long *)0x4000E030))
  #define UART2_IFLS_R            (*((volatile unsigned long *)0x4000E034))
  #define UART2_IM_R              (*((volatile unsigned long *)0x4000E038))
  #define UART2_RIS_R             (*((volatile unsigned long *)0x4000E03C))
  #define UART2_MIS_R             (*((volatile unsigned long *)0x4000E040))
  #define UART2_ICR_R             (*((volatile unsigned long *)0x4000E044))
  #define UART2_DMACTL_R          (*((volatile unsigned long *)0x4000E048))
  #define UART2_9BITADDR_R        (*((volatile unsigned long *)0x4000E0A4))
  #define UART2_9BITAMASK_R       (*((volatile unsigned long *)0x4000E0A8))
  #define UART2_PP_R              (*((volatile unsigned long *)0x4000EFC0))
  #define UART2_CC_R              (*((volatile unsigned long *)0x4000EFC8))

  //*****************************************************************************
  //
  // UART registers (UART3)
  //
  //*****************************************************************************
  #define UART3_DR_R              (*((volatile unsigned long *)0x4000F000))
  #define UART3_RSR_R             (*((volatile unsigned long *)0x4000F004))
  #define UART3_ECR_R             (*((volatile unsigned long *)0x4000F004))
  #define UART3_FR_R              (*((volatile unsigned long *)0x4000F018))
  #define UART3_ILPR_R            (*((volatile unsigned long *)0x4000F020))
  #define UART3_IBRD_R            (*((volatile unsigned long *)0x4000F024))
  #define UART3_FBRD_R            (*((volatile unsigned long *)0x4000F028))
  #define UART3_LCRH_R            (*((volatile unsigned long *)0x4000F02C))
  #define UART3_CTL_R             (*((volatile unsigned long *)0x4000F030))
  #define UART3_IFLS_R            (*((volatile unsigned long *)0x4000F034))
  #define UART3_IM_R              (*((volatile unsigned long *)0x4000F038))
  #define UART3_RIS_R             (*((volatile unsigned long *)0x4000F03C))
  #define UART3_MIS_R             (*((volatile unsigned long *)0x4000F040))
  #define UART3_ICR_R             (*((volatile unsigned long *)0x4000F044))
  #define UART3_DMACTL_R          (*((volatile unsigned long *)0x4000F048))
  #define UART3_9BITADDR_R        (*((volatile unsigned long *)0x4000F0A4))
  #define UART3_9BITAMASK_R       (*((volatile unsigned long *)0x4000F0A8))
  #define UART3_PP_R              (*((volatile unsigned long *)0x4000FFC0))
  #define UART3_CC_R              (*((volatile unsigned long *)0x4000FFC8))

  //*****************************************************************************
  //
  // UART registers (UART4)
  //
  //*****************************************************************************
  #define UART4_DR_R              (*((volatile unsigned long *)0x40010000))
  #define UART4_RSR_R             (*((volatile unsigned long *)0x40010004))
  #define UART4_ECR_R             (*((volatile unsigned long *)0x40010004))
  #define UART4_FR_R              (*((volatile unsigned long *)0x40010018))
  #define UART4_ILPR_R            (*((volatile unsigned long *)0x40010020))
  #define UART4_IBRD_R            (*((volatile unsigned long *)0x40010024))
  #define UART4_FBRD_R            (*((volatile unsigned long *)0x40010028))
  #define UART4_LCRH_R            (*((volatile unsigned long *)0x4001002C))
  #define UART4_CTL_R             (*((volatile unsigned long *)0x40010030))
  #define UART4_IFLS_R            (*((volatile unsigned long *)0x40010034))
  #define UART4_IM_R              (*((volatile unsigned long *)0x40010038))
  #define UART4_RIS_R             (*((volatile unsigned long *)0x4001003C))
  #define UART4_MIS_R             (*((volatile unsigned long *)0x40010040))
  #define UART4_ICR_R             (*((volatile unsigned long *)0x40010044))
  #define UART4_DMACTL_R          (*((volatile unsigned long *)0x40010048))
  #define UART4_9BITADDR_R        (*((volatile unsigned long *)0x400100A4))
  #define UART4_9BITAMASK_R       (*((volatile unsigned long *)0x400100A8))
  #define UART4_PP_R              (*((volatile unsigned long *)0x40010FC0))
  #define UART4_CC_R              (*((volatile unsigned long *)0x40010FC8))

  //*****************************************************************************
  //
  // UART registers (UART5)
  //
  //*****************************************************************************
  #define UART5_DR_R              (*((volatile unsigned long *)0x40011000))
  #define UART5_RSR_R             (*((volatile unsigned long *)0x40011004))
  #define UART5_ECR_R             (*((volatile unsigned long *)0x40011004))
  #define UART5_FR_R              (*((volatile unsigned long *)0x40011018))
  #define UART5_ILPR_R            (*((volatile unsigned long *)0x40011020))
  #define UART5_IBRD_R            (*((volatile unsigned long *)0x40011024))
  #define UART5_FBRD_R            (*((volatile unsigned long *)0x40011028))
  #define UART5_LCRH_R            (*((volatile unsigned long *)0x4001102C))
  #define UART5_CTL_R             (*((volatile unsigned long *)0x40011030))
  #define UART5_IFLS_R            (*((volatile unsigned long *)0x40011034))
  #define UART5_IM_R              (*((volatile unsigned long *)0x40011038))
  #define UART5_RIS_R             (*((volatile unsigned long *)0x4001103C))
  #define UART5_MIS_R             (*((volatile unsigned long *)0x40011040))
  #define UART5_ICR_R             (*((volatile unsigned long *)0x40011044))
  #define UART5_DMACTL_R          (*((volatile unsigned long *)0x40011048))
  #define UART5_9BITADDR_R        (*((volatile unsigned long *)0x400110A4))
  #define UART5_9BITAMASK_R       (*((volatile unsigned long *)0x400110A8))
  #define UART5_PP_R              (*((volatile unsigned long *)0x40011FC0))
  #define UART5_CC_R              (*((volatile unsigned long *)0x40011FC8))

  //*****************************************************************************
  //
  // UART registers (UART6)
  //
  //*****************************************************************************
  #define UART6_DR_R              (*((volatile unsigned long *)0x40012000))
  #define UART6_RSR_R             (*((volatile unsigned long *)0x40012004))
  #define UART6_ECR_R             (*((volatile unsigned long *)0x40012004))
  #define UART6_FR_R              (*((volatile unsigned long *)0x40012018))
  #define UART6_ILPR_R            (*((volatile unsigned long *)0x40012020))
  #define UART6_IBRD_R            (*((volatile unsigned long *)0x40012024))
  #define UART6_FBRD_R            (*((volatile unsigned long *)0x40012028))
  #define UART6_LCRH_R            (*((volatile unsigned long *)0x4001202C))
  #define UART6_CTL_R             (*((volatile unsigned long *)0x40012030))
  #define UART6_IFLS_R            (*((volatile unsigned long *)0x40012034))
  #define UART6_IM_R              (*((volatile unsigned long *)0x40012038))
  #define UART6_RIS_R             (*((volatile unsigned long *)0x4001203C))
  #define UART6_MIS_R             (*((volatile unsigned long *)0x40012040))
  #define UART6_ICR_R             (*((volatile unsigned long *)0x40012044))
  #define UART6_DMACTL_R          (*((volatile unsigned long *)0x40012048))
  #define UART6_9BITADDR_R        (*((volatile unsigned long *)0x400120A4))
  #define UART6_9BITAMASK_R       (*((volatile unsigned long *)0x400120A8))
  #define UART6_PP_R              (*((volatile unsigned long *)0x40012FC0))
  #define UART6_CC_R              (*((volatile unsigned long *)0x40012FC8))

  //*****************************************************************************
  //
  // UART registers (UART7)
  //
  //*****************************************************************************
  #define UART7_DR_R              (*((volatile unsigned long *)0x40013000))
  #define UART7_RSR_R             (*((volatile unsigned long *)0x40013004))
  #define UART7_ECR_R             (*((volatile unsigned long *)0x40013004))
  #define UART7_FR_R              (*((volatile unsigned long *)0x40013018))
  #define UART7_ILPR_R            (*((volatile unsigned long *)0x40013020))
  #define UART7_IBRD_R            (*((volatile unsigned long *)0x40013024))
  #define UART7_FBRD_R            (*((volatile unsigned long *)0x40013028))
  #define UART7_LCRH_R            (*((volatile unsigned long *)0x4001302C))
  #define UART7_CTL_R             (*((volatile unsigned long *)0x40013030))
  #define UART7_IFLS_R            (*((volatile unsigned long *)0x40013034))
  #define UART7_IM_R              (*((volatile unsigned long *)0x40013038))
  #define UART7_RIS_R             (*((volatile unsigned long *)0x4001303C))
  #define UART7_MIS_R             (*((volatile unsigned long *)0x40013040))
  #define UART7_ICR_R             (*((volatile unsigned long *)0x40013044))
  #define UART7_DMACTL_R          (*((volatile unsigned long *)0x40013048))
  #define UART7_9BITADDR_R        (*((volatile unsigned long *)0x400130A4))
  #define UART7_9BITAMASK_R       (*((volatile unsigned long *)0x400130A8))
  #define UART7_PP_R              (*((volatile unsigned long *)0x40013FC0))
  #define UART7_CC_R              (*((volatile unsigned long *)0x40013FC8))

  //*****************************************************************************
  //
  // I2C registers (I2C0)
  //
  //*****************************************************************************
  #define I2C0_MSA_R              (*((volatile unsigned long *)0x40020000))
  #define I2C0_MCS_R              (*((volatile unsigned long *)0x40020004))
  #define I2C0_MDR_R              (*((volatile unsigned long *)0x40020008))
  #define I2C0_MTPR_R             (*((volatile unsigned long *)0x4002000C))
  #define I2C0_MIMR_R             (*((volatile unsigned long *)0x40020010))
  #define I2C0_MRIS_R             (*((volatile unsigned long *)0x40020014))
  #define I2C0_MMIS_R             (*((volatile unsigned long *)0x40020018))
  #define I2C0_MICR_R             (*((volatile unsigned long *)0x4002001C))
  #define I2C0_MCR_R              (*((volatile unsigned long *)0x40020020))
  #define I2C0_MCLKOCNT_R         (*((volatile unsigned long *)0x40020024))
  #define I2C0_MBMON_R            (*((volatile unsigned long *)0x4002002C))
  #define I2C0_MCR2_R             (*((volatile unsigned long *)0x40020038))
  #define I2C0_SOAR_R             (*((volatile unsigned long *)0x40020800))
  #define I2C0_SCSR_R             (*((volatile unsigned long *)0x40020804))
  #define I2C0_SDR_R              (*((volatile unsigned long *)0x40020808))
  #define I2C0_SIMR_R             (*((volatile unsigned long *)0x4002080C))
  #define I2C0_SRIS_R             (*((volatile unsigned long *)0x40020810))
  #define I2C0_SMIS_R             (*((volatile unsigned long *)0x40020814))
  #define I2C0_SICR_R             (*((volatile unsigned long *)0x40020818))
  #define I2C0_SOAR2_R            (*((volatile unsigned long *)0x4002081C))
  #define I2C0_SACKCTL_R          (*((volatile unsigned long *)0x40020820))
  #define I2C0_PP_R               (*((volatile unsigned long *)0x40020FC0))
  #define I2C0_PC_R               (*((volatile unsigned long *)0x40020FC4))

  //*****************************************************************************
  //
  // I2C registers (I2C1)
  //
  //*****************************************************************************
  #define I2C1_MSA_R              (*((volatile unsigned long *)0x40021000))
  #define I2C1_MCS_R              (*((volatile unsigned long *)0x40021004))
  #define I2C1_MDR_R              (*((volatile unsigned long *)0x40021008))
  #define I2C1_MTPR_R             (*((volatile unsigned long *)0x4002100C))
  #define I2C1_MIMR_R             (*((volatile unsigned long *)0x40021010))
  #define I2C1_MRIS_R             (*((volatile unsigned long *)0x40021014))
  #define I2C1_MMIS_R             (*((volatile unsigned long *)0x40021018))
  #define I2C1_MICR_R             (*((volatile unsigned long *)0x4002101C))
  #define I2C1_MCR_R              (*((volatile unsigned long *)0x40021020))
  #define I2C1_MCLKOCNT_R         (*((volatile unsigned long *)0x40021024))
  #define I2C1_MBMON_R            (*((volatile unsigned long *)0x4002102C))
  #define I2C1_MCR2_R             (*((volatile unsigned long *)0x40021038))
  #define I2C1_SOAR_R             (*((volatile unsigned long *)0x40021800))
  #define I2C1_SCSR_R             (*((volatile unsigned long *)0x40021804))
  #define I2C1_SDR_R              (*((volatile unsigned long *)0x40021808))
  #define I2C1_SIMR_R             (*((volatile unsigned long *)0x4002180C))
  #define I2C1_SRIS_R             (*((volatile unsigned long *)0x40021810))
  #define I2C1_SMIS_R             (*((volatile unsigned long *)0x40021814))
  #define I2C1_SICR_R             (*((volatile unsigned long *)0x40021818))
  #define I2C1_SOAR2_R            (*((volatile unsigned long *)0x4002181C))
  #define I2C1_SACKCTL_R          (*((volatile unsigned long *)0x40021820))
  #define I2C1_PP_R               (*((volatile unsigned long *)0x40021FC0))
  #define I2C1_PC_R               (*((volatile unsigned long *)0x40021FC4))

  //*****************************************************************************
  //
  // I2C registers (I2C2)
  //
  //*****************************************************************************
  #define I2C2_MSA_R              (*((volatile unsigned long *)0x40022000))
  #define I2C2_MCS_R              (*((volatile unsigned long *)0x40022004))
  #define I2C2_MDR_R              (*((volatile unsigned long *)0x40022008))
  #define I2C2_MTPR_R             (*((volatile unsigned long *)0x4002200C))
  #define I2C2_MIMR_R             (*((volatile unsigned long *)0x40022010))
  #define I2C2_MRIS_R             (*((volatile unsigned long *)0x40022014))
  #define I2C2_MMIS_R             (*((volatile unsigned long *)0x40022018))
  #define I2C2_MICR_R             (*((volatile unsigned long *)0x4002201C))
  #define I2C2_MCR_R              (*((volatile unsigned long *)0x40022020))
  #define I2C2_MCLKOCNT_R         (*((volatile unsigned long *)0x40022024))
  #define I2C2_MBMON_R            (*((volatile unsigned long *)0x4002202C))
  #define I2C2_MCR2_R             (*((volatile unsigned long *)0x40022038))
  #define I2C2_SOAR_R             (*((volatile unsigned long *)0x40022800))
  #define I2C2_SCSR_R             (*((volatile unsigned long *)0x40022804))
  #define I2C2_SDR_R              (*((volatile unsigned long *)0x40022808))
  #define I2C2_SIMR_R             (*((volatile unsigned long *)0x4002280C))
  #define I2C2_SRIS_R             (*((volatile unsigned long *)0x40022810))
  #define I2C2_SMIS_R             (*((volatile unsigned long *)0x40022814))
  #define I2C2_SICR_R             (*((volatile unsigned long *)0x40022818))
  #define I2C2_SOAR2_R            (*((volatile unsigned long *)0x4002281C))
  #define I2C2_SACKCTL_R          (*((volatile unsigned long *)0x40022820))
  #define I2C2_PP_R               (*((volatile unsigned long *)0x40022FC0))
  #define I2C2_PC_R               (*((volatile unsigned long *)0x40022FC4))

  //*****************************************************************************
  //
  // I2C registers (I2C3)
  //
  //*****************************************************************************
  #define I2C3_MSA_R              (*((volatile unsigned long *)0x40023000))
  #define I2C3_MCS_R              (*((volatile unsigned long *)0x40023004))
  #define I2C3_MDR_R              (*((volatile unsigned long *)0x40023008))
  #define I2C3_MTPR_R             (*((volatile unsigned long *)0x4002300C))
  #define I2C3_MIMR_R             (*((volatile unsigned long *)0x40023010))
  #define I2C3_MRIS_R             (*((volatile unsigned long *)0x40023014))
  #define I2C3_MMIS_R             (*((volatile unsigned long *)0x40023018))
  #define I2C3_MICR_R             (*((volatile unsigned long *)0x4002301C))
  #define I2C3_MCR_R              (*((volatile unsigned long *)0x40023020))
  #define I2C3_MCLKOCNT_R         (*((volatile unsigned long *)0x40023024))
  #define I2C3_MBMON_R            (*((volatile unsigned long *)0x4002302C))
  #define I2C3_MCR2_R             (*((volatile unsigned long *)0x40023038))
  #define I2C3_SOAR_R             (*((volatile unsigned long *)0x40023800))
  #define I2C3_SCSR_R             (*((volatile unsigned long *)0x40023804))
  #define I2C3_SDR_R              (*((volatile unsigned long *)0x40023808))
  #define I2C3_SIMR_R             (*((volatile unsigned long *)0x4002380C))
  #define I2C3_SRIS_R             (*((volatile unsigned long *)0x40023810))
  #define I2C3_SMIS_R             (*((volatile unsigned long *)0x40023814))
  #define I2C3_SICR_R             (*((volatile unsigned long *)0x40023818))
  #define I2C3_SOAR2_R            (*((volatile unsigned long *)0x4002381C))
  #define I2C3_SACKCTL_R          (*((volatile unsigned long *)0x40023820))
  #define I2C3_PP_R               (*((volatile unsigned long *)0x40023FC0))
  #define I2C3_PC_R               (*((volatile unsigned long *)0x40023FC4))

  //*****************************************************************************
  //
  // GPIO registers (PORTE)
  //
  //*****************************************************************************
  #define GPIO_PORTE_DATA_BITS_R  ((volatile unsigned long *)0x40024000)
  #define GPIO_PORTE_DATA_R       (*((volatile unsigned long *)0x400243FC))
  #define GPIO_PORTE_DIR_R        (*((volatile unsigned long *)0x40024400))
  #define GPIO_PORTE_IS_R         (*((volatile unsigned long *)0x40024404))
  #define GPIO_PORTE_IBE_R        (*((volatile unsigned long *)0x40024408))
  #define GPIO_PORTE_IEV_R        (*((volatile unsigned long *)0x4002440C))
  #define GPIO_PORTE_IM_R         (*((volatile unsigned long *)0x40024410))
  #define GPIO_PORTE_RIS_R        (*((volatile unsigned long *)0x40024414))
  #define GPIO_PORTE_MIS_R        (*((volatile unsigned long *)0x40024418))
  #define GPIO_PORTE_ICR_R        (*((volatile unsigned long *)0x4002441C))
  #define GPIO_PORTE_AFSEL_R      (*((volatile unsigned long *)0x40024420))
  #define GPIO_PORTE_DR2R_R       (*((volatile unsigned long *)0x40024500))
  #define GPIO_PORTE_DR4R_R       (*((volatile unsigned long *)0x40024504))
  #define GPIO_PORTE_DR8R_R       (*((volatile unsigned long *)0x40024508))
  #define GPIO_PORTE_ODR_R        (*((volatile unsigned long *)0x4002450C))
  #define GPIO_PORTE_PUR_R        (*((volatile unsigned long *)0x40024510))
  #define GPIO_PORTE_PDR_R        (*((volatile unsigned long *)0x40024514))
  #define GPIO_PORTE_SLR_R        (*((volatile unsigned long *)0x40024518))
  #define GPIO_PORTE_DEN_R        (*((volatile unsigned long *)0x4002451C))
  #define GPIO_PORTE_LOCK_R       (*((volatile unsigned long *)0x40024520))
  #define GPIO_PORTE_CR_R         (*((volatile unsigned long *)0x40024524))
  #define GPIO_PORTE_AMSEL_R      (*((volatile unsigned long *)0x40024528))
  #define GPIO_PORTE_PCTL_R       (*((volatile unsigned long *)0x4002452C))
  #define GPIO_PORTE_ADCCTL_R     (*((volatile unsigned long *)0x40024530))
  #define GPIO_PORTE_DMACTL_R     (*((volatile unsigned long *)0x40024534))

  //*****************************************************************************
  //
  // GPIO registers (PORTF)
  //
  //*****************************************************************************
  #define GPIO_PORTF_DATA_BITS_R  ((volatile unsigned long *)0x40025000)
  #define GPIO_PORTF_DATA_R       (*((volatile unsigned long *)0x400253FC))
  #define GPIO_PORTF_DIR_R        (*((volatile unsigned long *)0x40025400))
  #define GPIO_PORTF_IS_R         (*((volatile unsigned long *)0x40025404))
  #define GPIO_PORTF_IBE_R        (*((volatile unsigned long *)0x40025408))
  #define GPIO_PORTF_IEV_R        (*((volatile unsigned long *)0x4002540C))
  #define GPIO_PORTF_IM_R         (*((volatile unsigned long *)0x40025410))
  #define GPIO_PORTF_RIS_R        (*((volatile unsigned long *)0x40025414))
  #define GPIO_PORTF_MIS_R        (*((volatile unsigned long *)0x40025418))
  #define GPIO_PORTF_ICR_R        (*((volatile unsigned long *)0x4002541C))
  #define GPIO_PORTF_AFSEL_R      (*((volatile unsigned long *)0x40025420))
  #define GPIO_PORTF_DR2R_R       (*((volatile unsigned long *)0x40025500))
  #define GPIO_PORTF_DR4R_R       (*((volatile unsigned long *)0x40025504))
  #define GPIO_PORTF_DR8R_R       (*((volatile unsigned long *)0x40025508))
  #define GPIO_PORTF_ODR_R        (*((volatile unsigned long *)0x4002550C))
  #define GPIO_PORTF_PUR_R        (*((volatile unsigned long *)0x40025510))
  #define GPIO_PORTF_PDR_R        (*((volatile unsigned long *)0x40025514))
  #define GPIO_PORTF_SLR_R        (*((volatile unsigned long *)0x40025518))
  #define GPIO_PORTF_DEN_R        (*((volatile unsigned long *)0x4002551C))
  #define GPIO_PORTF_LOCK_R       (*((volatile unsigned long *)0x40025520))
  #define GPIO_PORTF_CR_R         (*((volatile unsigned long *)0x40025524))
  #define GPIO_PORTF_AMSEL_R      (*((volatile unsigned long *)0x40025528))
  #define GPIO_PORTF_PCTL_R       (*((volatile unsigned long *)0x4002552C))
  #define GPIO_PORTF_ADCCTL_R     (*((volatile unsigned long *)0x40025530))
  #define GPIO_PORTF_DMACTL_R     (*((volatile unsigned long *)0x40025534))

