imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // PWM registers (PWM0)
  //
  //*****************************************************************************
  #define PWM0_CTL_R              (*((volatile unsigned long *)0x40028000))
  #define PWM0_SYNC_R             (*((volatile unsigned long *)0x40028004))
  #define PWM0_ENABLE_R           (*((volatile unsigned long *)0x40028008))
  #define PWM0_INVERT_R           (*((volatile unsigned long *)0x4002800C))
  #define PWM0_FAULT_R            (*((volatile unsigned long *)0x40028010))
  #define PWM0_INTEN_R            (*((volatile unsigned long *)0x40028014))
  #define PWM0_RIS_R              (*((volatile unsigned long *)0x40028018))
  #define PWM0_ISC_R              (*((volatile unsigned long *)0x4002801C))
  #define PWM0_STATUS_R           (*((volatile unsigned long *)0x40028020))
  #define PWM0_FAULTVAL_R         (*((volatile unsigned long *)0x40028024))
  #define PWM0_ENUPD_R            (*((volatile unsigned long *)0x40028028))
  #define PWM0_0_CTL_R            (*((volatile unsigned long *)0x40028040))
  #define PWM0_0_INTEN_R          (*((volatile unsigned long *)0x40028044))
  #define PWM0_0_RIS_R            (*((volatile unsigned long *)0x40028048))
  #define PWM0_0_ISC_R            (*((volatile unsigned long *)0x4002804C))
  #define PWM0_0_LOAD_R           (*((volatile unsigned long *)0x40028050))
  #define PWM0_0_COUNT_R          (*((volatile unsigned long *)0x40028054))
  #define PWM0_0_CMPA_R           (*((volatile unsigned long *)0x40028058))
  #define PWM0_0_CMPB_R           (*((volatile unsigned long *)0x4002805C))
  #define PWM0_0_GENA_R           (*((volatile unsigned long *)0x40028060))
  #define PWM0_0_GENB_R           (*((volatile unsigned long *)0x40028064))
  #define PWM0_0_DBCTL_R          (*((volatile unsigned long *)0x40028068))
  #define PWM0_0_DBRISE_R         (*((volatile unsigned long *)0x4002806C))
  #define PWM0_0_DBFALL_R         (*((volatile unsigned long *)0x40028070))
  #define PWM0_0_FLTSRC0_R        (*((volatile unsigned long *)0x40028074))
  #define PWM0_0_FLTSRC1_R        (*((volatile unsigned long *)0x40028078))
  #define PWM0_0_MINFLTPER_R      (*((volatile unsigned long *)0x4002807C))
  #define PWM0_1_CTL_R            (*((volatile unsigned long *)0x40028080))
  #define PWM0_1_INTEN_R          (*((volatile unsigned long *)0x40028084))
  #define PWM0_1_RIS_R            (*((volatile unsigned long *)0x40028088))
  #define PWM0_1_ISC_R            (*((volatile unsigned long *)0x4002808C))
  #define PWM0_1_LOAD_R           (*((volatile unsigned long *)0x40028090))
  #define PWM0_1_COUNT_R          (*((volatile unsigned long *)0x40028094))
  #define PWM0_1_CMPA_R           (*((volatile unsigned long *)0x40028098))
  #define PWM0_1_CMPB_R           (*((volatile unsigned long *)0x4002809C))
  #define PWM0_1_GENA_R           (*((volatile unsigned long *)0x400280A0))
  #define PWM0_1_GENB_R           (*((volatile unsigned long *)0x400280A4))
  #define PWM0_1_DBCTL_R          (*((volatile unsigned long *)0x400280A8))
  #define PWM0_1_DBRISE_R         (*((volatile unsigned long *)0x400280AC))
  #define PWM0_1_DBFALL_R         (*((volatile unsigned long *)0x400280B0))
  #define PWM0_1_FLTSRC0_R        (*((volatile unsigned long *)0x400280B4))
  #define PWM0_1_FLTSRC1_R        (*((volatile unsigned long *)0x400280B8))
  #define PWM0_1_MINFLTPER_R      (*((volatile unsigned long *)0x400280BC))
  #define PWM0_2_CTL_R            (*((volatile unsigned long *)0x400280C0))
  #define PWM0_2_INTEN_R          (*((volatile unsigned long *)0x400280C4))
  #define PWM0_2_RIS_R            (*((volatile unsigned long *)0x400280C8))
  #define PWM0_2_ISC_R            (*((volatile unsigned long *)0x400280CC))
  #define PWM0_2_LOAD_R           (*((volatile unsigned long *)0x400280D0))
  #define PWM0_2_COUNT_R          (*((volatile unsigned long *)0x400280D4))
  #define PWM0_2_CMPA_R           (*((volatile unsigned long *)0x400280D8))
  #define PWM0_2_CMPB_R           (*((volatile unsigned long *)0x400280DC))
  #define PWM0_2_GENA_R           (*((volatile unsigned long *)0x400280E0))
  #define PWM0_2_GENB_R           (*((volatile unsigned long *)0x400280E4))
  #define PWM0_2_DBCTL_R          (*((volatile unsigned long *)0x400280E8))
  #define PWM0_2_DBRISE_R         (*((volatile unsigned long *)0x400280EC))
  #define PWM0_2_DBFALL_R         (*((volatile unsigned long *)0x400280F0))
  #define PWM0_2_FLTSRC0_R        (*((volatile unsigned long *)0x400280F4))
  #define PWM0_2_FLTSRC1_R        (*((volatile unsigned long *)0x400280F8))
  #define PWM0_2_MINFLTPER_R      (*((volatile unsigned long *)0x400280FC))
  #define PWM0_3_CTL_R            (*((volatile unsigned long *)0x40028100))
  #define PWM0_3_INTEN_R          (*((volatile unsigned long *)0x40028104))
  #define PWM0_3_RIS_R            (*((volatile unsigned long *)0x40028108))
  #define PWM0_3_ISC_R            (*((volatile unsigned long *)0x4002810C))
  #define PWM0_3_LOAD_R           (*((volatile unsigned long *)0x40028110))
  #define PWM0_3_COUNT_R          (*((volatile unsigned long *)0x40028114))
  #define PWM0_3_CMPA_R           (*((volatile unsigned long *)0x40028118))
  #define PWM0_3_CMPB_R           (*((volatile unsigned long *)0x4002811C))
  #define PWM0_3_GENA_R           (*((volatile unsigned long *)0x40028120))
  #define PWM0_3_GENB_R           (*((volatile unsigned long *)0x40028124))
  #define PWM0_3_DBCTL_R          (*((volatile unsigned long *)0x40028128))
  #define PWM0_3_DBRISE_R         (*((volatile unsigned long *)0x4002812C))
  #define PWM0_3_DBFALL_R         (*((volatile unsigned long *)0x40028130))
  #define PWM0_3_FLTSRC0_R        (*((volatile unsigned long *)0x40028134))
  #define PWM0_3_FLTSRC1_R        (*((volatile unsigned long *)0x40028138))
  #define PWM0_3_MINFLTPER_R      (*((volatile unsigned long *)0x4002813C))
  #define PWM0_0_FLTSEN_R         (*((volatile unsigned long *)0x40028800))
  #define PWM0_0_FLTSTAT0_R       (*((volatile unsigned long *)0x40028804))
  #define PWM0_0_FLTSTAT1_R       (*((volatile unsigned long *)0x40028808))
  #define PWM0_1_FLTSEN_R         (*((volatile unsigned long *)0x40028880))
  #define PWM0_1_FLTSTAT0_R       (*((volatile unsigned long *)0x40028884))
  #define PWM0_1_FLTSTAT1_R       (*((volatile unsigned long *)0x40028888))
  #define PWM0_2_FLTSTAT0_R       (*((volatile unsigned long *)0x40028904))
  #define PWM0_2_FLTSTAT1_R       (*((volatile unsigned long *)0x40028908))
  #define PWM0_3_FLTSTAT0_R       (*((volatile unsigned long *)0x40028984))
  #define PWM0_3_FLTSTAT1_R       (*((volatile unsigned long *)0x40028988))
  #define PWM0_PP_R               (*((volatile unsigned long *)0x40028FC0))

  //*****************************************************************************
  //
  // PWM registers (PWM1)
  //
  //*****************************************************************************
  #define PWM1_CTL_R              (*((volatile unsigned long *)0x40029000))
  #define PWM1_SYNC_R             (*((volatile unsigned long *)0x40029004))
  #define PWM1_ENABLE_R           (*((volatile unsigned long *)0x40029008))
  #define PWM1_INVERT_R           (*((volatile unsigned long *)0x4002900C))
  #define PWM1_FAULT_R            (*((volatile unsigned long *)0x40029010))
  #define PWM1_INTEN_R            (*((volatile unsigned long *)0x40029014))
  #define PWM1_RIS_R              (*((volatile unsigned long *)0x40029018))
  #define PWM1_ISC_R              (*((volatile unsigned long *)0x4002901C))
  #define PWM1_STATUS_R           (*((volatile unsigned long *)0x40029020))
  #define PWM1_FAULTVAL_R         (*((volatile unsigned long *)0x40029024))
  #define PWM1_ENUPD_R            (*((volatile unsigned long *)0x40029028))
  #define PWM1_0_CTL_R            (*((volatile unsigned long *)0x40029040))
  #define PWM1_0_INTEN_R          (*((volatile unsigned long *)0x40029044))
  #define PWM1_0_RIS_R            (*((volatile unsigned long *)0x40029048))
  #define PWM1_0_ISC_R            (*((volatile unsigned long *)0x4002904C))
  #define PWM1_0_LOAD_R           (*((volatile unsigned long *)0x40029050))
  #define PWM1_0_COUNT_R          (*((volatile unsigned long *)0x40029054))
  #define PWM1_0_CMPA_R           (*((volatile unsigned long *)0x40029058))
  #define PWM1_0_CMPB_R           (*((volatile unsigned long *)0x4002905C))
  #define PWM1_0_GENA_R           (*((volatile unsigned long *)0x40029060))
  #define PWM1_0_GENB_R           (*((volatile unsigned long *)0x40029064))
  #define PWM1_0_DBCTL_R          (*((volatile unsigned long *)0x40029068))
  #define PWM1_0_DBRISE_R         (*((volatile unsigned long *)0x4002906C))
  #define PWM1_0_DBFALL_R         (*((volatile unsigned long *)0x40029070))
  #define PWM1_0_FLTSRC0_R        (*((volatile unsigned long *)0x40029074))
  #define PWM1_0_FLTSRC1_R        (*((volatile unsigned long *)0x40029078))
  #define PWM1_0_MINFLTPER_R      (*((volatile unsigned long *)0x4002907C))
  #define PWM1_1_CTL_R            (*((volatile unsigned long *)0x40029080))
  #define PWM1_1_INTEN_R          (*((volatile unsigned long *)0x40029084))
  #define PWM1_1_RIS_R            (*((volatile unsigned long *)0x40029088))
  #define PWM1_1_ISC_R            (*((volatile unsigned long *)0x4002908C))
  #define PWM1_1_LOAD_R           (*((volatile unsigned long *)0x40029090))
  #define PWM1_1_COUNT_R          (*((volatile unsigned long *)0x40029094))
  #define PWM1_1_CMPA_R           (*((volatile unsigned long *)0x40029098))
  #define PWM1_1_CMPB_R           (*((volatile unsigned long *)0x4002909C))
  #define PWM1_1_GENA_R           (*((volatile unsigned long *)0x400290A0))
  #define PWM1_1_GENB_R           (*((volatile unsigned long *)0x400290A4))
  #define PWM1_1_DBCTL_R          (*((volatile unsigned long *)0x400290A8))
  #define PWM1_1_DBRISE_R         (*((volatile unsigned long *)0x400290AC))
  #define PWM1_1_DBFALL_R         (*((volatile unsigned long *)0x400290B0))
  #define PWM1_1_FLTSRC0_R        (*((volatile unsigned long *)0x400290B4))
  #define PWM1_1_FLTSRC1_R        (*((volatile unsigned long *)0x400290B8))
  #define PWM1_1_MINFLTPER_R      (*((volatile unsigned long *)0x400290BC))
  #define PWM1_2_CTL_R            (*((volatile unsigned long *)0x400290C0))
  #define PWM1_2_INTEN_R          (*((volatile unsigned long *)0x400290C4))
  #define PWM1_2_RIS_R            (*((volatile unsigned long *)0x400290C8))
  #define PWM1_2_ISC_R            (*((volatile unsigned long *)0x400290CC))
  #define PWM1_2_LOAD_R           (*((volatile unsigned long *)0x400290D0))
  #define PWM1_2_COUNT_R          (*((volatile unsigned long *)0x400290D4))
  #define PWM1_2_CMPA_R           (*((volatile unsigned long *)0x400290D8))
  #define PWM1_2_CMPB_R           (*((volatile unsigned long *)0x400290DC))
  #define PWM1_2_GENA_R           (*((volatile unsigned long *)0x400290E0))
  #define PWM1_2_GENB_R           (*((volatile unsigned long *)0x400290E4))
  #define PWM1_2_DBCTL_R          (*((volatile unsigned long *)0x400290E8))
  #define PWM1_2_DBRISE_R         (*((volatile unsigned long *)0x400290EC))
  #define PWM1_2_DBFALL_R         (*((volatile unsigned long *)0x400290F0))
  #define PWM1_2_FLTSRC0_R        (*((volatile unsigned long *)0x400290F4))
  #define PWM1_2_FLTSRC1_R        (*((volatile unsigned long *)0x400290F8))
  #define PWM1_2_MINFLTPER_R      (*((volatile unsigned long *)0x400290FC))
  #define PWM1_3_CTL_R            (*((volatile unsigned long *)0x40029100))
  #define PWM1_3_INTEN_R          (*((volatile unsigned long *)0x40029104))
  #define PWM1_3_RIS_R            (*((volatile unsigned long *)0x40029108))
  #define PWM1_3_ISC_R            (*((volatile unsigned long *)0x4002910C))
  #define PWM1_3_LOAD_R           (*((volatile unsigned long *)0x40029110))
  #define PWM1_3_COUNT_R          (*((volatile unsigned long *)0x40029114))
  #define PWM1_3_CMPA_R           (*((volatile unsigned long *)0x40029118))
  #define PWM1_3_CMPB_R           (*((volatile unsigned long *)0x4002911C))
  #define PWM1_3_GENA_R           (*((volatile unsigned long *)0x40029120))
  #define PWM1_3_GENB_R           (*((volatile unsigned long *)0x40029124))
  #define PWM1_3_DBCTL_R          (*((volatile unsigned long *)0x40029128))
  #define PWM1_3_DBRISE_R         (*((volatile unsigned long *)0x4002912C))
  #define PWM1_3_DBFALL_R         (*((volatile unsigned long *)0x40029130))
  #define PWM1_3_FLTSRC0_R        (*((volatile unsigned long *)0x40029134))
  #define PWM1_3_FLTSRC1_R        (*((volatile unsigned long *)0x40029138))
  #define PWM1_3_MINFLTPER_R      (*((volatile unsigned long *)0x4002913C))
  #define PWM1_0_FLTSEN_R         (*((volatile unsigned long *)0x40029800))
  #define PWM1_0_FLTSTAT0_R       (*((volatile unsigned long *)0x40029804))
  #define PWM1_0_FLTSTAT1_R       (*((volatile unsigned long *)0x40029808))
  #define PWM1_1_FLTSEN_R         (*((volatile unsigned long *)0x40029880))
  #define PWM1_1_FLTSTAT0_R       (*((volatile unsigned long *)0x40029884))
  #define PWM1_1_FLTSTAT1_R       (*((volatile unsigned long *)0x40029888))
  #define PWM1_2_FLTSTAT0_R       (*((volatile unsigned long *)0x40029904))
  #define PWM1_2_FLTSTAT1_R       (*((volatile unsigned long *)0x40029908))
  #define PWM1_3_FLTSTAT0_R       (*((volatile unsigned long *)0x40029984))
  #define PWM1_3_FLTSTAT1_R       (*((volatile unsigned long *)0x40029988))
  #define PWM1_PP_R               (*((volatile unsigned long *)0x40029FC0))

  //*****************************************************************************
  //
  // QEI registers (QEI0)
  //
  //*****************************************************************************
  #define QEI0_CTL_R              (*((volatile unsigned long *)0x4002C000))
  #define QEI0_STAT_R             (*((volatile unsigned long *)0x4002C004))
  #define QEI0_POS_R              (*((volatile unsigned long *)0x4002C008))
  #define QEI0_MAXPOS_R           (*((volatile unsigned long *)0x4002C00C))
  #define QEI0_LOAD_R             (*((volatile unsigned long *)0x4002C010))
  #define QEI0_TIME_R             (*((volatile unsigned long *)0x4002C014))
  #define QEI0_COUNT_R            (*((volatile unsigned long *)0x4002C018))
  #define QEI0_SPEED_R            (*((volatile unsigned long *)0x4002C01C))
  #define QEI0_INTEN_R            (*((volatile unsigned long *)0x4002C020))
  #define QEI0_RIS_R              (*((volatile unsigned long *)0x4002C024))
  #define QEI0_ISC_R              (*((volatile unsigned long *)0x4002C028))

  //*****************************************************************************
  //
  // QEI registers (QEI1)
  //
  //*****************************************************************************
  #define QEI1_CTL_R              (*((volatile unsigned long *)0x4002D000))
  #define QEI1_STAT_R             (*((volatile unsigned long *)0x4002D004))
  #define QEI1_POS_R              (*((volatile unsigned long *)0x4002D008))
  #define QEI1_MAXPOS_R           (*((volatile unsigned long *)0x4002D00C))
  #define QEI1_LOAD_R             (*((volatile unsigned long *)0x4002D010))
  #define QEI1_TIME_R             (*((volatile unsigned long *)0x4002D014))
  #define QEI1_COUNT_R            (*((volatile unsigned long *)0x4002D018))
  #define QEI1_SPEED_R            (*((volatile unsigned long *)0x4002D01C))
  #define QEI1_INTEN_R            (*((volatile unsigned long *)0x4002D020))
  #define QEI1_RIS_R              (*((volatile unsigned long *)0x4002D024))
  #define QEI1_ISC_R              (*((volatile unsigned long *)0x4002D028))

  //*****************************************************************************
  //
  // Timer registers (TIMER0)
  //
  //*****************************************************************************
  #define TIMER0_CFG_R            (*((volatile unsigned long *)0x40030000))
  #define TIMER0_TAMR_R           (*((volatile unsigned long *)0x40030004))
  #define TIMER0_TBMR_R           (*((volatile unsigned long *)0x40030008))
  #define TIMER0_CTL_R            (*((volatile unsigned long *)0x4003000C))
  #define TIMER0_SYNC_R           (*((volatile unsigned long *)0x40030010))
  #define TIMER0_IMR_R            (*((volatile unsigned long *)0x40030018))
  #define TIMER0_RIS_R            (*((volatile unsigned long *)0x4003001C))
  #define TIMER0_MIS_R            (*((volatile unsigned long *)0x40030020))
  #define TIMER0_ICR_R            (*((volatile unsigned long *)0x40030024))
  #define TIMER0_TAILR_R          (*((volatile unsigned long *)0x40030028))
  #define TIMER0_TBILR_R          (*((volatile unsigned long *)0x4003002C))
  #define TIMER0_TAMATCHR_R       (*((volatile unsigned long *)0x40030030))
  #define TIMER0_TBMATCHR_R       (*((volatile unsigned long *)0x40030034))
  #define TIMER0_TAPR_R           (*((volatile unsigned long *)0x40030038))
  #define TIMER0_TBPR_R           (*((volatile unsigned long *)0x4003003C))
  #define TIMER0_TAPMR_R          (*((volatile unsigned long *)0x40030040))
  #define TIMER0_TBPMR_R          (*((volatile unsigned long *)0x40030044))
  #define TIMER0_TAR_R            (*((volatile unsigned long *)0x40030048))
  #define TIMER0_TBR_R            (*((volatile unsigned long *)0x4003004C))
  #define TIMER0_TAV_R            (*((volatile unsigned long *)0x40030050))
  #define TIMER0_TBV_R            (*((volatile unsigned long *)0x40030054))
  #define TIMER0_RTCPD_R          (*((volatile unsigned long *)0x40030058))
  #define TIMER0_TAPS_R           (*((volatile unsigned long *)0x4003005C))
  #define TIMER0_TBPS_R           (*((volatile unsigned long *)0x40030060))
  #define TIMER0_TAPV_R           (*((volatile unsigned long *)0x40030064))
  #define TIMER0_TBPV_R           (*((volatile unsigned long *)0x40030068))
  #define TIMER0_PP_R             (*((volatile unsigned long *)0x40030FC0))

  //*****************************************************************************
  //
  // Timer registers (TIMER1)
  //
  //*****************************************************************************
  #define TIMER1_CFG_R            (*((volatile unsigned long *)0x40031000))
  #define TIMER1_TAMR_R           (*((volatile unsigned long *)0x40031004))
  #define TIMER1_TBMR_R           (*((volatile unsigned long *)0x40031008))
  #define TIMER1_CTL_R            (*((volatile unsigned long *)0x4003100C))
  #define TIMER1_SYNC_R           (*((volatile unsigned long *)0x40031010))
  #define TIMER1_IMR_R            (*((volatile unsigned long *)0x40031018))
  #define TIMER1_RIS_R            (*((volatile unsigned long *)0x4003101C))
  #define TIMER1_MIS_R            (*((volatile unsigned long *)0x40031020))
  #define TIMER1_ICR_R            (*((volatile unsigned long *)0x40031024))
  #define TIMER1_TAILR_R          (*((volatile unsigned long *)0x40031028))
  #define TIMER1_TBILR_R          (*((volatile unsigned long *)0x4003102C))
  #define TIMER1_TAMATCHR_R       (*((volatile unsigned long *)0x40031030))
  #define TIMER1_TBMATCHR_R       (*((volatile unsigned long *)0x40031034))
  #define TIMER1_TAPR_R           (*((volatile unsigned long *)0x40031038))
  #define TIMER1_TBPR_R           (*((volatile unsigned long *)0x4003103C))
  #define TIMER1_TAPMR_R          (*((volatile unsigned long *)0x40031040))
  #define TIMER1_TBPMR_R          (*((volatile unsigned long *)0x40031044))
  #define TIMER1_TAR_R            (*((volatile unsigned long *)0x40031048))
  #define TIMER1_TBR_R            (*((volatile unsigned long *)0x4003104C))
  #define TIMER1_TAV_R            (*((volatile unsigned long *)0x40031050))
  #define TIMER1_TBV_R            (*((volatile unsigned long *)0x40031054))
  #define TIMER1_RTCPD_R          (*((volatile unsigned long *)0x40031058))
  #define TIMER1_TAPS_R           (*((volatile unsigned long *)0x4003105C))
  #define TIMER1_TBPS_R           (*((volatile unsigned long *)0x40031060))
  #define TIMER1_TAPV_R           (*((volatile unsigned long *)0x40031064))
  #define TIMER1_TBPV_R           (*((volatile unsigned long *)0x40031068))
  #define TIMER1_PP_R             (*((volatile unsigned long *)0x40031FC0))

  //*****************************************************************************
  //
  // Timer registers (TIMER2)
  //
  //*****************************************************************************
  #define TIMER2_CFG_R            (*((volatile unsigned long *)0x40032000))
  #define TIMER2_TAMR_R           (*((volatile unsigned long *)0x40032004))
  #define TIMER2_TBMR_R           (*((volatile unsigned long *)0x40032008))
  #define TIMER2_CTL_R            (*((volatile unsigned long *)0x4003200C))
  #define TIMER2_SYNC_R           (*((volatile unsigned long *)0x40032010))
  #define TIMER2_IMR_R            (*((volatile unsigned long *)0x40032018))
  #define TIMER2_RIS_R            (*((volatile unsigned long *)0x4003201C))
  #define TIMER2_MIS_R            (*((volatile unsigned long *)0x40032020))
  #define TIMER2_ICR_R            (*((volatile unsigned long *)0x40032024))
  #define TIMER2_TAILR_R          (*((volatile unsigned long *)0x40032028))
  #define TIMER2_TBILR_R          (*((volatile unsigned long *)0x4003202C))
  #define TIMER2_TAMATCHR_R       (*((volatile unsigned long *)0x40032030))
  #define TIMER2_TBMATCHR_R       (*((volatile unsigned long *)0x40032034))
  #define TIMER2_TAPR_R           (*((volatile unsigned long *)0x40032038))
  #define TIMER2_TBPR_R           (*((volatile unsigned long *)0x4003203C))
  #define TIMER2_TAPMR_R          (*((volatile unsigned long *)0x40032040))
  #define TIMER2_TBPMR_R          (*((volatile unsigned long *)0x40032044))
  #define TIMER2_TAR_R            (*((volatile unsigned long *)0x40032048))
  #define TIMER2_TBR_R            (*((volatile unsigned long *)0x4003204C))
  #define TIMER2_TAV_R            (*((volatile unsigned long *)0x40032050))
  #define TIMER2_TBV_R            (*((volatile unsigned long *)0x40032054))
  #define TIMER2_RTCPD_R          (*((volatile unsigned long *)0x40032058))
  #define TIMER2_TAPS_R           (*((volatile unsigned long *)0x4003205C))
  #define TIMER2_TBPS_R           (*((volatile unsigned long *)0x40032060))
  #define TIMER2_TAPV_R           (*((volatile unsigned long *)0x40032064))
  #define TIMER2_TBPV_R           (*((volatile unsigned long *)0x40032068))
  #define TIMER2_PP_R             (*((volatile unsigned long *)0x40032FC0))

