imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // Timer registers (TIMER3)
  //
  //*****************************************************************************
  #define TIMER3_CFG_R            (*((volatile unsigned long *)0x40033000))
  #define TIMER3_TAMR_R           (*((volatile unsigned long *)0x40033004))
  #define TIMER3_TBMR_R           (*((volatile unsigned long *)0x40033008))
  #define TIMER3_CTL_R            (*((volatile unsigned long *)0x4003300C))
  #define TIMER3_SYNC_R           (*((volatile unsigned long *)0x40033010))
  #define TIMER3_IMR_R            (*((volatile unsigned long *)0x40033018))
  #define TIMER3_RIS_R            (*((volatile unsigned long *)0x4003301C))
  #define TIMER3_MIS_R            (*((volatile unsigned long *)0x40033020))
  #define TIMER3_ICR_R            (*((volatile unsigned long *)0x40033024))
  #define TIMER3_TAILR_R          (*((volatile unsigned long *)0x40033028))
  #define TIMER3_TBILR_R          (*((volatile unsigned long *)0x4003302C))
  #define TIMER3_TAMATCHR_R       (*((volatile unsigned long *)0x40033030))
  #define TIMER3_TBMATCHR_R       (*((volatile unsigned long *)0x40033034))
  #define TIMER3_TAPR_R           (*((volatile unsigned long *)0x40033038))
  #define TIMER3_TBPR_R           (*((volatile unsigned long *)0x4003303C))
  #define TIMER3_TAPMR_R          (*((volatile unsigned long *)0x40033040))
  #define TIMER3_TBPMR_R          (*((volatile unsigned long *)0x40033044))
  #define TIMER3_TAR_R            (*((volatile unsigned long *)0x40033048))
  #define TIMER3_TBR_R            (*((volatile unsigned long *)0x4003304C))
  #define TIMER3_TAV_R            (*((volatile unsigned long *)0x40033050))
  #define TIMER3_TBV_R            (*((volatile unsigned long *)0x40033054))
  #define TIMER3_RTCPD_R          (*((volatile unsigned long *)0x40033058))
  #define TIMER3_TAPS_R           (*((volatile unsigned long *)0x4003305C))
  #define TIMER3_TBPS_R           (*((volatile unsigned long *)0x40033060))
  #define TIMER3_TAPV_R           (*((volatile unsigned long *)0x40033064))
  #define TIMER3_TBPV_R           (*((volatile unsigned long *)0x40033068))
  #define TIMER3_PP_R             (*((volatile unsigned long *)0x40033FC0))

  //*****************************************************************************
  //
  // Timer registers (TIMER4)
  //
  //*****************************************************************************
  #define TIMER4_CFG_R            (*((volatile unsigned long *)0x40034000))
  #define TIMER4_TAMR_R           (*((volatile unsigned long *)0x40034004))
  #define TIMER4_TBMR_R           (*((volatile unsigned long *)0x40034008))
  #define TIMER4_CTL_R            (*((volatile unsigned long *)0x4003400C))
  #define TIMER4_SYNC_R           (*((volatile unsigned long *)0x40034010))
  #define TIMER4_IMR_R            (*((volatile unsigned long *)0x40034018))
  #define TIMER4_RIS_R            (*((volatile unsigned long *)0x4003401C))
  #define TIMER4_MIS_R            (*((volatile unsigned long *)0x40034020))
  #define TIMER4_ICR_R            (*((volatile unsigned long *)0x40034024))
  #define TIMER4_TAILR_R          (*((volatile unsigned long *)0x40034028))
  #define TIMER4_TBILR_R          (*((volatile unsigned long *)0x4003402C))
  #define TIMER4_TAMATCHR_R       (*((volatile unsigned long *)0x40034030))
  #define TIMER4_TBMATCHR_R       (*((volatile unsigned long *)0x40034034))
  #define TIMER4_TAPR_R           (*((volatile unsigned long *)0x40034038))
  #define TIMER4_TBPR_R           (*((volatile unsigned long *)0x4003403C))
  #define TIMER4_TAPMR_R          (*((volatile unsigned long *)0x40034040))
  #define TIMER4_TBPMR_R          (*((volatile unsigned long *)0x40034044))
  #define TIMER4_TAR_R            (*((volatile unsigned long *)0x40034048))
  #define TIMER4_TBR_R            (*((volatile unsigned long *)0x4003404C))
  #define TIMER4_TAV_R            (*((volatile unsigned long *)0x40034050))
  #define TIMER4_TBV_R            (*((volatile unsigned long *)0x40034054))
  #define TIMER4_RTCPD_R          (*((volatile unsigned long *)0x40034058))
  #define TIMER4_TAPS_R           (*((volatile unsigned long *)0x4003405C))
  #define TIMER4_TBPS_R           (*((volatile unsigned long *)0x40034060))
  #define TIMER4_TAPV_R           (*((volatile unsigned long *)0x40034064))
  #define TIMER4_TBPV_R           (*((volatile unsigned long *)0x40034068))
  #define TIMER4_PP_R             (*((volatile unsigned long *)0x40034FC0))

  //*****************************************************************************
  //
  // Timer registers (TIMER5)
  //
  //*****************************************************************************
  #define TIMER5_CFG_R            (*((volatile unsigned long *)0x40035000))
  #define TIMER5_TAMR_R           (*((volatile unsigned long *)0x40035004))
  #define TIMER5_TBMR_R           (*((volatile unsigned long *)0x40035008))
  #define TIMER5_CTL_R            (*((volatile unsigned long *)0x4003500C))
  #define TIMER5_SYNC_R           (*((volatile unsigned long *)0x40035010))
  #define TIMER5_IMR_R            (*((volatile unsigned long *)0x40035018))
  #define TIMER5_RIS_R            (*((volatile unsigned long *)0x4003501C))
  #define TIMER5_MIS_R            (*((volatile unsigned long *)0x40035020))
  #define TIMER5_ICR_R            (*((volatile unsigned long *)0x40035024))
  #define TIMER5_TAILR_R          (*((volatile unsigned long *)0x40035028))
  #define TIMER5_TBILR_R          (*((volatile unsigned long *)0x4003502C))
  #define TIMER5_TAMATCHR_R       (*((volatile unsigned long *)0x40035030))
  #define TIMER5_TBMATCHR_R       (*((volatile unsigned long *)0x40035034))
  #define TIMER5_TAPR_R           (*((volatile unsigned long *)0x40035038))
  #define TIMER5_TBPR_R           (*((volatile unsigned long *)0x4003503C))
  #define TIMER5_TAPMR_R          (*((volatile unsigned long *)0x40035040))
  #define TIMER5_TBPMR_R          (*((volatile unsigned long *)0x40035044))
  #define TIMER5_TAR_R            (*((volatile unsigned long *)0x40035048))
  #define TIMER5_TBR_R            (*((volatile unsigned long *)0x4003504C))
  #define TIMER5_TAV_R            (*((volatile unsigned long *)0x40035050))
  #define TIMER5_TBV_R            (*((volatile unsigned long *)0x40035054))
  #define TIMER5_RTCPD_R          (*((volatile unsigned long *)0x40035058))
  #define TIMER5_TAPS_R           (*((volatile unsigned long *)0x4003505C))
  #define TIMER5_TBPS_R           (*((volatile unsigned long *)0x40035060))
  #define TIMER5_TAPV_R           (*((volatile unsigned long *)0x40035064))
  #define TIMER5_TBPV_R           (*((volatile unsigned long *)0x40035068))
  #define TIMER5_PP_R             (*((volatile unsigned long *)0x40035FC0))

  //*****************************************************************************
  //
  // Timer registers (WTIMER0)
  //
  //*****************************************************************************
  #define WTIMER0_CFG_R           (*((volatile unsigned long *)0x40036000))
  #define WTIMER0_TAMR_R          (*((volatile unsigned long *)0x40036004))
  #define WTIMER0_TBMR_R          (*((volatile unsigned long *)0x40036008))
  #define WTIMER0_CTL_R           (*((volatile unsigned long *)0x4003600C))
  #define WTIMER0_SYNC_R          (*((volatile unsigned long *)0x40036010))
  #define WTIMER0_IMR_R           (*((volatile unsigned long *)0x40036018))
  #define WTIMER0_RIS_R           (*((volatile unsigned long *)0x4003601C))
  #define WTIMER0_MIS_R           (*((volatile unsigned long *)0x40036020))
  #define WTIMER0_ICR_R           (*((volatile unsigned long *)0x40036024))
  #define WTIMER0_TAILR_R         (*((volatile unsigned long *)0x40036028))
  #define WTIMER0_TBILR_R         (*((volatile unsigned long *)0x4003602C))
  #define WTIMER0_TAMATCHR_R      (*((volatile unsigned long *)0x40036030))
  #define WTIMER0_TBMATCHR_R      (*((volatile unsigned long *)0x40036034))
  #define WTIMER0_TAPR_R          (*((volatile unsigned long *)0x40036038))
  #define WTIMER0_TBPR_R          (*((volatile unsigned long *)0x4003603C))
  #define WTIMER0_TAPMR_R         (*((volatile unsigned long *)0x40036040))
  #define WTIMER0_TBPMR_R         (*((volatile unsigned long *)0x40036044))
  #define WTIMER0_TAR_R           (*((volatile unsigned long *)0x40036048))
  #define WTIMER0_TBR_R           (*((volatile unsigned long *)0x4003604C))
  #define WTIMER0_TAV_R           (*((volatile unsigned long *)0x40036050))
  #define WTIMER0_TBV_R           (*((volatile unsigned long *)0x40036054))
  #define WTIMER0_RTCPD_R         (*((volatile unsigned long *)0x40036058))
  #define WTIMER0_TAPS_R          (*((volatile unsigned long *)0x4003605C))
  #define WTIMER0_TBPS_R          (*((volatile unsigned long *)0x40036060))
  #define WTIMER0_TAPV_R          (*((volatile unsigned long *)0x40036064))
  #define WTIMER0_TBPV_R          (*((volatile unsigned long *)0x40036068))
  #define WTIMER0_PP_R            (*((volatile unsigned long *)0x40036FC0))

  //*****************************************************************************
  //
  // Timer registers (WTIMER1)
  //
  //*****************************************************************************
  #define WTIMER1_CFG_R           (*((volatile unsigned long *)0x40037000))
  #define WTIMER1_TAMR_R          (*((volatile unsigned long *)0x40037004))
  #define WTIMER1_TBMR_R          (*((volatile unsigned long *)0x40037008))
  #define WTIMER1_CTL_R           (*((volatile unsigned long *)0x4003700C))
  #define WTIMER1_SYNC_R          (*((volatile unsigned long *)0x40037010))
  #define WTIMER1_IMR_R           (*((volatile unsigned long *)0x40037018))
  #define WTIMER1_RIS_R           (*((volatile unsigned long *)0x4003701C))
  #define WTIMER1_MIS_R           (*((volatile unsigned long *)0x40037020))
  #define WTIMER1_ICR_R           (*((volatile unsigned long *)0x40037024))
  #define WTIMER1_TAILR_R         (*((volatile unsigned long *)0x40037028))
  #define WTIMER1_TBILR_R         (*((volatile unsigned long *)0x4003702C))
  #define WTIMER1_TAMATCHR_R      (*((volatile unsigned long *)0x40037030))
  #define WTIMER1_TBMATCHR_R      (*((volatile unsigned long *)0x40037034))
  #define WTIMER1_TAPR_R          (*((volatile unsigned long *)0x40037038))
  #define WTIMER1_TBPR_R          (*((volatile unsigned long *)0x4003703C))
  #define WTIMER1_TAPMR_R         (*((volatile unsigned long *)0x40037040))
  #define WTIMER1_TBPMR_R         (*((volatile unsigned long *)0x40037044))
  #define WTIMER1_TAR_R           (*((volatile unsigned long *)0x40037048))
  #define WTIMER1_TBR_R           (*((volatile unsigned long *)0x4003704C))
  #define WTIMER1_TAV_R           (*((volatile unsigned long *)0x40037050))
  #define WTIMER1_TBV_R           (*((volatile unsigned long *)0x40037054))
  #define WTIMER1_RTCPD_R         (*((volatile unsigned long *)0x40037058))
  #define WTIMER1_TAPS_R          (*((volatile unsigned long *)0x4003705C))
  #define WTIMER1_TBPS_R          (*((volatile unsigned long *)0x40037060))
  #define WTIMER1_TAPV_R          (*((volatile unsigned long *)0x40037064))
  #define WTIMER1_TBPV_R          (*((volatile unsigned long *)0x40037068))
  #define WTIMER1_PP_R            (*((volatile unsigned long *)0x40037FC0))

  //*****************************************************************************
  //
  // ADC registers (ADC0)
  //
  //*****************************************************************************
  #define ADC0_ACTSS_R            (*((volatile unsigned long *)0x40038000))
  #define ADC0_RIS_R              (*((volatile unsigned long *)0x40038004))
  #define ADC0_IM_R               (*((volatile unsigned long *)0x40038008))
  #define ADC0_ISC_R              (*((volatile unsigned long *)0x4003800C))
  #define ADC0_OSTAT_R            (*((volatile unsigned long *)0x40038010))
  #define ADC0_EMUX_R             (*((volatile unsigned long *)0x40038014))
  #define ADC0_USTAT_R            (*((volatile unsigned long *)0x40038018))
  #define ADC0_TSSEL_R            (*((volatile unsigned long *)0x4003801C))
  #define ADC0_SSPRI_R            (*((volatile unsigned long *)0x40038020))
  #define ADC0_SPC_R              (*((volatile unsigned long *)0x40038024))
  #define ADC0_PSSI_R             (*((volatile unsigned long *)0x40038028))
  #define ADC0_SAC_R              (*((volatile unsigned long *)0x40038030))
  #define ADC0_DCISC_R            (*((volatile unsigned long *)0x40038034))
  #define ADC0_CTL_R              (*((volatile unsigned long *)0x40038038))
  #define ADC0_SSMUX0_R           (*((volatile unsigned long *)0x40038040))
  #define ADC0_SSCTL0_R           (*((volatile unsigned long *)0x40038044))
  #define ADC0_SSFIFO0_R          (*((volatile unsigned long *)0x40038048))
  #define ADC0_SSFSTAT0_R         (*((volatile unsigned long *)0x4003804C))
  #define ADC0_SSOP0_R            (*((volatile unsigned long *)0x40038050))
  #define ADC0_SSDC0_R            (*((volatile unsigned long *)0x40038054))
  #define ADC0_SSMUX1_R           (*((volatile unsigned long *)0x40038060))
  #define ADC0_SSCTL1_R           (*((volatile unsigned long *)0x40038064))
  #define ADC0_SSFIFO1_R          (*((volatile unsigned long *)0x40038068))
  #define ADC0_SSFSTAT1_R         (*((volatile unsigned long *)0x4003806C))
  #define ADC0_SSOP1_R            (*((volatile unsigned long *)0x40038070))
  #define ADC0_SSDC1_R            (*((volatile unsigned long *)0x40038074))
  #define ADC0_SSMUX2_R           (*((volatile unsigned long *)0x40038080))
  #define ADC0_SSCTL2_R           (*((volatile unsigned long *)0x40038084))
  #define ADC0_SSFIFO2_R          (*((volatile unsigned long *)0x40038088))
  #define ADC0_SSFSTAT2_R         (*((volatile unsigned long *)0x4003808C))
  #define ADC0_SSOP2_R            (*((volatile unsigned long *)0x40038090))
  #define ADC0_SSDC2_R            (*((volatile unsigned long *)0x40038094))
  #define ADC0_SSMUX3_R           (*((volatile unsigned long *)0x400380A0))
  #define ADC0_SSCTL3_R           (*((volatile unsigned long *)0x400380A4))
  #define ADC0_SSFIFO3_R          (*((volatile unsigned long *)0x400380A8))
  #define ADC0_SSFSTAT3_R         (*((volatile unsigned long *)0x400380AC))
  #define ADC0_SSOP3_R            (*((volatile unsigned long *)0x400380B0))
  #define ADC0_SSDC3_R            (*((volatile unsigned long *)0x400380B4))
  #define ADC0_DCRIC_R            (*((volatile unsigned long *)0x40038D00))
  #define ADC0_DCCTL0_R           (*((volatile unsigned long *)0x40038E00))
  #define ADC0_DCCTL1_R           (*((volatile unsigned long *)0x40038E04))
  #define ADC0_DCCTL2_R           (*((volatile unsigned long *)0x40038E08))
  #define ADC0_DCCTL3_R           (*((volatile unsigned long *)0x40038E0C))
  #define ADC0_DCCTL4_R           (*((volatile unsigned long *)0x40038E10))
  #define ADC0_DCCTL5_R           (*((volatile unsigned long *)0x40038E14))
  #define ADC0_DCCTL6_R           (*((volatile unsigned long *)0x40038E18))
  #define ADC0_DCCTL7_R           (*((volatile unsigned long *)0x40038E1C))
  #define ADC0_DCCMP0_R           (*((volatile unsigned long *)0x40038E40))
  #define ADC0_DCCMP1_R           (*((volatile unsigned long *)0x40038E44))
  #define ADC0_DCCMP2_R           (*((volatile unsigned long *)0x40038E48))
  #define ADC0_DCCMP3_R           (*((volatile unsigned long *)0x40038E4C))
  #define ADC0_DCCMP4_R           (*((volatile unsigned long *)0x40038E50))
  #define ADC0_DCCMP5_R           (*((volatile unsigned long *)0x40038E54))
  #define ADC0_DCCMP6_R           (*((volatile unsigned long *)0x40038E58))
  #define ADC0_DCCMP7_R           (*((volatile unsigned long *)0x40038E5C))
  #define ADC0_PP_R               (*((volatile unsigned long *)0x40038FC0))
  #define ADC0_PC_R               (*((volatile unsigned long *)0x40038FC4))
  #define ADC0_CC_R               (*((volatile unsigned long *)0x40038FC8))

  //*****************************************************************************
  //
  // ADC registers (ADC1)
  //
  //*****************************************************************************
  #define ADC1_ACTSS_R            (*((volatile unsigned long *)0x40039000))
  #define ADC1_RIS_R              (*((volatile unsigned long *)0x40039004))
  #define ADC1_IM_R               (*((volatile unsigned long *)0x40039008))
  #define ADC1_ISC_R              (*((volatile unsigned long *)0x4003900C))
  #define ADC1_OSTAT_R            (*((volatile unsigned long *)0x40039010))
  #define ADC1_EMUX_R             (*((volatile unsigned long *)0x40039014))
  #define ADC1_USTAT_R            (*((volatile unsigned long *)0x40039018))
  #define ADC1_TSSEL_R            (*((volatile unsigned long *)0x4003901C))
  #define ADC1_SSPRI_R            (*((volatile unsigned long *)0x40039020))
  #define ADC1_SPC_R              (*((volatile unsigned long *)0x40039024))
  #define ADC1_PSSI_R             (*((volatile unsigned long *)0x40039028))
  #define ADC1_SAC_R              (*((volatile unsigned long *)0x40039030))
  #define ADC1_DCISC_R            (*((volatile unsigned long *)0x40039034))
  #define ADC1_CTL_R              (*((volatile unsigned long *)0x40039038))
  #define ADC1_SSMUX0_R           (*((volatile unsigned long *)0x40039040))
  #define ADC1_SSCTL0_R           (*((volatile unsigned long *)0x40039044))
  #define ADC1_SSFIFO0_R          (*((volatile unsigned long *)0x40039048))
  #define ADC1_SSFSTAT0_R         (*((volatile unsigned long *)0x4003904C))
  #define ADC1_SSOP0_R            (*((volatile unsigned long *)0x40039050))
  #define ADC1_SSDC0_R            (*((volatile unsigned long *)0x40039054))
  #define ADC1_SSMUX1_R           (*((volatile unsigned long *)0x40039060))
  #define ADC1_SSCTL1_R           (*((volatile unsigned long *)0x40039064))
  #define ADC1_SSFIFO1_R          (*((volatile unsigned long *)0x40039068))
  #define ADC1_SSFSTAT1_R         (*((volatile unsigned long *)0x4003906C))
  #define ADC1_SSOP1_R            (*((volatile unsigned long *)0x40039070))
  #define ADC1_SSDC1_R            (*((volatile unsigned long *)0x40039074))
  #define ADC1_SSMUX2_R           (*((volatile unsigned long *)0x40039080))
  #define ADC1_SSCTL2_R           (*((volatile unsigned long *)0x40039084))
  #define ADC1_SSFIFO2_R          (*((volatile unsigned long *)0x40039088))
  #define ADC1_SSFSTAT2_R         (*((volatile unsigned long *)0x4003908C))
  #define ADC1_SSOP2_R            (*((volatile unsigned long *)0x40039090))
  #define ADC1_SSDC2_R            (*((volatile unsigned long *)0x40039094))
  #define ADC1_SSMUX3_R           (*((volatile unsigned long *)0x400390A0))
  #define ADC1_SSCTL3_R           (*((volatile unsigned long *)0x400390A4))
  #define ADC1_SSFIFO3_R          (*((volatile unsigned long *)0x400390A8))
  #define ADC1_SSFSTAT3_R         (*((volatile unsigned long *)0x400390AC))
  #define ADC1_SSOP3_R            (*((volatile unsigned long *)0x400390B0))
  #define ADC1_SSDC3_R            (*((volatile unsigned long *)0x400390B4))
  #define ADC1_DCRIC_R            (*((volatile unsigned long *)0x40039D00))
  #define ADC1_DCCTL0_R           (*((volatile unsigned long *)0x40039E00))
  #define ADC1_DCCTL1_R           (*((volatile unsigned long *)0x40039E04))
  #define ADC1_DCCTL2_R           (*((volatile unsigned long *)0x40039E08))
  #define ADC1_DCCTL3_R           (*((volatile unsigned long *)0x40039E0C))
  #define ADC1_DCCTL4_R           (*((volatile unsigned long *)0x40039E10))
  #define ADC1_DCCTL5_R           (*((volatile unsigned long *)0x40039E14))
  #define ADC1_DCCTL6_R           (*((volatile unsigned long *)0x40039E18))
  #define ADC1_DCCTL7_R           (*((volatile unsigned long *)0x40039E1C))
  #define ADC1_DCCMP0_R           (*((volatile unsigned long *)0x40039E40))
  #define ADC1_DCCMP1_R           (*((volatile unsigned long *)0x40039E44))
  #define ADC1_DCCMP2_R           (*((volatile unsigned long *)0x40039E48))
  #define ADC1_DCCMP3_R           (*((volatile unsigned long *)0x40039E4C))
  #define ADC1_DCCMP4_R           (*((volatile unsigned long *)0x40039E50))
  #define ADC1_DCCMP5_R           (*((volatile unsigned long *)0x40039E54))
  #define ADC1_DCCMP6_R           (*((volatile unsigned long *)0x40039E58))
  #define ADC1_DCCMP7_R           (*((volatile unsigned long *)0x40039E5C))
  #define ADC1_PP_R               (*((volatile unsigned long *)0x40039FC0))
  #define ADC1_PC_R               (*((volatile unsigned long *)0x40039FC4))
  #define ADC1_CC_R               (*((volatile unsigned long *)0x40039FC8))

  //*****************************************************************************
  //
  // Comparator registers (COMP)
  //
  //*****************************************************************************
  #define COMP_ACMIS_R            (*((volatile unsigned long *)0x4003C000))
  #define COMP_ACRIS_R            (*((volatile unsigned long *)0x4003C004))
  #define COMP_ACINTEN_R          (*((volatile unsigned long *)0x4003C008))
  #define COMP_ACREFCTL_R         (*((volatile unsigned long *)0x4003C010))
  #define COMP_ACSTAT0_R          (*((volatile unsigned long *)0x4003C020))
  #define COMP_ACCTL0_R           (*((volatile unsigned long *)0x4003C024))
  #define COMP_ACSTAT1_R          (*((volatile unsigned long *)0x4003C040))
  #define COMP_ACCTL1_R           (*((volatile unsigned long *)0x4003C044))
  #define COMP_PP_R               (*((volatile unsigned long *)0x4003CFC0))

