imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // GPIO registers (PORTE AHB)
  //
  //*****************************************************************************
  #define GPIO_PORTE_AHB_DATA_BITS_R                                            \
                                  ((volatile unsigned long *)0x4005C000)
  #define GPIO_PORTE_AHB_DATA_R   (*((volatile unsigned long *)0x4005C3FC))
  #define GPIO_PORTE_AHB_DIR_R    (*((volatile unsigned long *)0x4005C400))
  #define GPIO_PORTE_AHB_IS_R     (*((volatile unsigned long *)0x4005C404))
  #define GPIO_PORTE_AHB_IBE_R    (*((volatile unsigned long *)0x4005C408))
  #define GPIO_PORTE_AHB_IEV_R    (*((volatile unsigned long *)0x4005C40C))
  #define GPIO_PORTE_AHB_IM_R     (*((volatile unsigned long *)0x4005C410))
  #define GPIO_PORTE_AHB_RIS_R    (*((volatile unsigned long *)0x4005C414))
  #define GPIO_PORTE_AHB_MIS_R    (*((volatile unsigned long *)0x4005C418))
  #define GPIO_PORTE_AHB_ICR_R    (*((volatile unsigned long *)0x4005C41C))
  #define GPIO_PORTE_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005C420))
  #define GPIO_PORTE_AHB_DR2R_R   (*((volatile unsigned long *)0x4005C500))
  #define GPIO_PORTE_AHB_DR4R_R   (*((volatile unsigned long *)0x4005C504))
  #define GPIO_PORTE_AHB_DR8R_R   (*((volatile unsigned long *)0x4005C508))
  #define GPIO_PORTE_AHB_ODR_R    (*((volatile unsigned long *)0x4005C50C))
  #define GPIO_PORTE_AHB_PUR_R    (*((volatile unsigned long *)0x4005C510))
  #define GPIO_PORTE_AHB_PDR_R    (*((volatile unsigned long *)0x4005C514))
  #define GPIO_PORTE_AHB_SLR_R    (*((volatile unsigned long *)0x4005C518))
  #define GPIO_PORTE_AHB_DEN_R    (*((volatile unsigned long *)0x4005C51C))
  #define GPIO_PORTE_AHB_LOCK_R   (*((volatile unsigned long *)0x4005C520))
  #define GPIO_PORTE_AHB_CR_R     (*((volatile unsigned long *)0x4005C524))
  #define GPIO_PORTE_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005C528))
  #define GPIO_PORTE_AHB_PCTL_R   (*((volatile unsigned long *)0x4005C52C))
  #define GPIO_PORTE_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005C530))
  #define GPIO_PORTE_AHB_DMACTL_R (*((volatile unsigned long *)0x4005C534))

  //*****************************************************************************
  //
  // GPIO registers (PORTF AHB)
  //
  //*****************************************************************************
  #define GPIO_PORTF_AHB_DATA_BITS_R                                            \
                                  ((volatile unsigned long *)0x4005D000)
  #define GPIO_PORTF_AHB_DATA_R   (*((volatile unsigned long *)0x4005D3FC))
  #define GPIO_PORTF_AHB_DIR_R    (*((volatile unsigned long *)0x4005D400))
  #define GPIO_PORTF_AHB_IS_R     (*((volatile unsigned long *)0x4005D404))
  #define GPIO_PORTF_AHB_IBE_R    (*((volatile unsigned long *)0x4005D408))
  #define GPIO_PORTF_AHB_IEV_R    (*((volatile unsigned long *)0x4005D40C))
  #define GPIO_PORTF_AHB_IM_R     (*((volatile unsigned long *)0x4005D410))
  #define GPIO_PORTF_AHB_RIS_R    (*((volatile unsigned long *)0x4005D414))
  #define GPIO_PORTF_AHB_MIS_R    (*((volatile unsigned long *)0x4005D418))
  #define GPIO_PORTF_AHB_ICR_R    (*((volatile unsigned long *)0x4005D41C))
  #define GPIO_PORTF_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005D420))
  #define GPIO_PORTF_AHB_DR2R_R   (*((volatile unsigned long *)0x4005D500))
  #define GPIO_PORTF_AHB_DR4R_R   (*((volatile unsigned long *)0x4005D504))
  #define GPIO_PORTF_AHB_DR8R_R   (*((volatile unsigned long *)0x4005D508))
  #define GPIO_PORTF_AHB_ODR_R    (*((volatile unsigned long *)0x4005D50C))
  #define GPIO_PORTF_AHB_PUR_R    (*((volatile unsigned long *)0x4005D510))
  #define GPIO_PORTF_AHB_PDR_R    (*((volatile unsigned long *)0x4005D514))
  #define GPIO_PORTF_AHB_SLR_R    (*((volatile unsigned long *)0x4005D518))
  #define GPIO_PORTF_AHB_DEN_R    (*((volatile unsigned long *)0x4005D51C))
  #define GPIO_PORTF_AHB_LOCK_R   (*((volatile unsigned long *)0x4005D520))
  #define GPIO_PORTF_AHB_CR_R     (*((volatile unsigned long *)0x4005D524))
  #define GPIO_PORTF_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005D528))
  #define GPIO_PORTF_AHB_PCTL_R   (*((volatile unsigned long *)0x4005D52C))
  #define GPIO_PORTF_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005D530))
  #define GPIO_PORTF_AHB_DMACTL_R (*((volatile unsigned long *)0x4005D534))

  //*****************************************************************************
  //
  // EEPROM registers (EEPROM)
  //
  //*****************************************************************************
  #define EEPROM_EESIZE_R         (*((volatile unsigned long *)0x400AF000))
  #define EEPROM_EEBLOCK_R        (*((volatile unsigned long *)0x400AF004))
  #define EEPROM_EEOFFSET_R       (*((volatile unsigned long *)0x400AF008))
  #define EEPROM_EERDWR_R         (*((volatile unsigned long *)0x400AF010))
  #define EEPROM_EERDWRINC_R      (*((volatile unsigned long *)0x400AF014))
  #define EEPROM_EEDONE_R         (*((volatile unsigned long *)0x400AF018))
  #define EEPROM_EESUPP_R         (*((volatile unsigned long *)0x400AF01C))
  #define EEPROM_EEUNLOCK_R       (*((volatile unsigned long *)0x400AF020))
  #define EEPROM_EEPROT_R         (*((volatile unsigned long *)0x400AF030))
  #define EEPROM_EEPASS0_R        (*((volatile unsigned long *)0x400AF034))
  #define EEPROM_EEPASS1_R        (*((volatile unsigned long *)0x400AF038))
  #define EEPROM_EEPASS2_R        (*((volatile unsigned long *)0x400AF03C))
  #define EEPROM_EEINT_R          (*((volatile unsigned long *)0x400AF040))
  #define EEPROM_EEHIDE_R         (*((volatile unsigned long *)0x400AF050))
  #define EEPROM_EEDBGME_R        (*((volatile unsigned long *)0x400AF080))
  #define EEPROM_PP_R             (*((volatile unsigned long *)0x400AFFC0))

  //*****************************************************************************
  //
  // System Exception Module registers (SYSEXC)
  //
  //*****************************************************************************
  #define SYSEXC_RIS_R            (*((volatile unsigned long *)0x400F9000))
  #define SYSEXC_IM_R             (*((volatile unsigned long *)0x400F9004))
  #define SYSEXC_MIS_R            (*((volatile unsigned long *)0x400F9008))
  #define SYSEXC_IC_R             (*((volatile unsigned long *)0x400F900C))

  //*****************************************************************************
  //
  // Hibernation module registers (HIB)
  //
  //*****************************************************************************
  #define HIB_RTCC_R              (*((volatile unsigned long *)0x400FC000))
  #define HIB_RTCM0_R             (*((volatile unsigned long *)0x400FC004))
  #define HIB_RTCLD_R             (*((volatile unsigned long *)0x400FC00C))
  #define HIB_CTL_R               (*((volatile unsigned long *)0x400FC010))
  #define HIB_IM_R                (*((volatile unsigned long *)0x400FC014))
  #define HIB_RIS_R               (*((volatile unsigned long *)0x400FC018))
  #define HIB_MIS_R               (*((volatile unsigned long *)0x400FC01C))
  #define HIB_IC_R                (*((volatile unsigned long *)0x400FC020))
  #define HIB_RTCT_R              (*((volatile unsigned long *)0x400FC024))
  #define HIB_RTCSS_R             (*((volatile unsigned long *)0x400FC028))
  #define HIB_DATA_R              (*((volatile unsigned long *)0x400FC030))

  //*****************************************************************************
  //
  // FLASH registers (FLASH CTRL)
  //
  //*****************************************************************************
  #define FLASH_FMA_R             (*((volatile unsigned long *)0x400FD000))
  #define FLASH_FMD_R             (*((volatile unsigned long *)0x400FD004))
  #define FLASH_FMC_R             (*((volatile unsigned long *)0x400FD008))
  #define FLASH_FCRIS_R           (*((volatile unsigned long *)0x400FD00C))
  #define FLASH_FCIM_R            (*((volatile unsigned long *)0x400FD010))
  #define FLASH_FCMISC_R          (*((volatile unsigned long *)0x400FD014))
  #define FLASH_FMC2_R            (*((volatile unsigned long *)0x400FD020))
  #define FLASH_FWBVAL_R          (*((volatile unsigned long *)0x400FD030))
  #define FLASH_FWBN_R            (*((volatile unsigned long *)0x400FD100))
  #define FLASH_FSIZE_R           (*((volatile unsigned long *)0x400FDFC0))
  #define FLASH_SSIZE_R           (*((volatile unsigned long *)0x400FDFC4))
  #define FLASH_ROMSWMAP_R        (*((volatile unsigned long *)0x400FDFCC))
  #define FLASH_RMCTL_R           (*((volatile unsigned long *)0x400FE0F0))
  #define FLASH_BOOTCFG_R         (*((volatile unsigned long *)0x400FE1D0))
  #define FLASH_USERREG0_R        (*((volatile unsigned long *)0x400FE1E0))
  #define FLASH_USERREG1_R        (*((volatile unsigned long *)0x400FE1E4))
  #define FLASH_USERREG2_R        (*((volatile unsigned long *)0x400FE1E8))
  #define FLASH_USERREG3_R        (*((volatile unsigned long *)0x400FE1EC))
  #define FLASH_FMPRE0_R          (*((volatile unsigned long *)0x400FE200))
  #define FLASH_FMPRE1_R          (*((volatile unsigned long *)0x400FE204))
  #define FLASH_FMPRE2_R          (*((volatile unsigned long *)0x400FE208))
  #define FLASH_FMPRE3_R          (*((volatile unsigned long *)0x400FE20C))
  #define FLASH_FMPPE0_R          (*((volatile unsigned long *)0x400FE400))
  #define FLASH_FMPPE1_R          (*((volatile unsigned long *)0x400FE404))
  #define FLASH_FMPPE2_R          (*((volatile unsigned long *)0x400FE408))
  #define FLASH_FMPPE3_R          (*((volatile unsigned long *)0x400FE40C))

  //*****************************************************************************
  //
  // System Control registers (SYSCTL)
  //
  //*****************************************************************************
  #define SYSCTL_DID0_R           (*((volatile unsigned long *)0x400FE000))
  #define SYSCTL_DID1_R           (*((volatile unsigned long *)0x400FE004))
  #define SYSCTL_DC0_R            (*((volatile unsigned long *)0x400FE008))
  #define SYSCTL_DC1_R            (*((volatile unsigned long *)0x400FE010))
  #define SYSCTL_DC2_R            (*((volatile unsigned long *)0x400FE014))
  #define SYSCTL_DC3_R            (*((volatile unsigned long *)0x400FE018))
  #define SYSCTL_DC4_R            (*((volatile unsigned long *)0x400FE01C))
  #define SYSCTL_DC5_R            (*((volatile unsigned long *)0x400FE020))
  #define SYSCTL_DC6_R            (*((volatile unsigned long *)0x400FE024))
  #define SYSCTL_DC7_R            (*((volatile unsigned long *)0x400FE028))
  #define SYSCTL_DC8_R            (*((volatile unsigned long *)0x400FE02C))
  #define SYSCTL_PBORCTL_R        (*((volatile unsigned long *)0x400FE030))
  #define SYSCTL_SRCR0_R          (*((volatile unsigned long *)0x400FE040))
  #define SYSCTL_SRCR1_R          (*((volatile unsigned long *)0x400FE044))
  #define SYSCTL_SRCR2_R          (*((volatile unsigned long *)0x400FE048))
  #define SYSCTL_RIS_R            (*((volatile unsigned long *)0x400FE050))
  #define SYSCTL_IMC_R            (*((volatile unsigned long *)0x400FE054))
  #define SYSCTL_MISC_R           (*((volatile unsigned long *)0x400FE058))
  #define SYSCTL_RESC_R           (*((volatile unsigned long *)0x400FE05C))
  #define SYSCTL_RCC_R            (*((volatile unsigned long *)0x400FE060))
  #define SYSCTL_GPIOHBCTL_R      (*((volatile unsigned long *)0x400FE06C))
  #define SYSCTL_RCC2_R           (*((volatile unsigned long *)0x400FE070))
  #define SYSCTL_MOSCCTL_R        (*((volatile unsigned long *)0x400FE07C))
  #define SYSCTL_RCGC0_R          (*((volatile unsigned long *)0x400FE100))
  #define SYSCTL_RCGC1_R          (*((volatile unsigned long *)0x400FE104))
  #define SYSCTL_RCGC2_R          (*((volatile unsigned long *)0x400FE108))
  #define SYSCTL_SCGC0_R          (*((volatile unsigned long *)0x400FE110))
  #define SYSCTL_SCGC1_R          (*((volatile unsigned long *)0x400FE114))
  #define SYSCTL_SCGC2_R          (*((volatile unsigned long *)0x400FE118))
  #define SYSCTL_DCGC0_R          (*((volatile unsigned long *)0x400FE120))
  #define SYSCTL_DCGC1_R          (*((volatile unsigned long *)0x400FE124))
  #define SYSCTL_DCGC2_R          (*((volatile unsigned long *)0x400FE128))
  #define SYSCTL_DSLPCLKCFG_R     (*((volatile unsigned long *)0x400FE144))
  #define SYSCTL_SYSPROP_R        (*((volatile unsigned long *)0x400FE14C))
  #define SYSCTL_PIOSCCAL_R       (*((volatile unsigned long *)0x400FE150))
  #define SYSCTL_PIOSCSTAT_R      (*((volatile unsigned long *)0x400FE154))
  #define SYSCTL_PLLFREQ0_R       (*((volatile unsigned long *)0x400FE160))
  #define SYSCTL_PLLFREQ1_R       (*((volatile unsigned long *)0x400FE164))
  #define SYSCTL_PLLSTAT_R        (*((volatile unsigned long *)0x400FE168))
  #define SYSCTL_DC9_R            (*((volatile unsigned long *)0x400FE190))
  #define SYSCTL_NVMSTAT_R        (*((volatile unsigned long *)0x400FE1A0))
  #define SYSCTL_PPWD_R           (*((volatile unsigned long *)0x400FE300))
  #define SYSCTL_PPTIMER_R        (*((volatile unsigned long *)0x400FE304))
  #define SYSCTL_PPGPIO_R         (*((volatile unsigned long *)0x400FE308))
  #define SYSCTL_PPDMA_R          (*((volatile unsigned long *)0x400FE30C))
  #define SYSCTL_PPHIB_R          (*((volatile unsigned long *)0x400FE314))
  #define SYSCTL_PPUART_R         (*((volatile unsigned long *)0x400FE318))
  #define SYSCTL_PPSSI_R          (*((volatile unsigned long *)0x400FE31C))
  #define SYSCTL_PPI2C_R          (*((volatile unsigned long *)0x400FE320))
  #define SYSCTL_PPUSB_R          (*((volatile unsigned long *)0x400FE328))
  #define SYSCTL_PPCAN_R          (*((volatile unsigned long *)0x400FE334))
  #define SYSCTL_PPADC_R          (*((volatile unsigned long *)0x400FE338))
  #define SYSCTL_PPACMP_R         (*((volatile unsigned long *)0x400FE33C))
  #define SYSCTL_PPPWM_R          (*((volatile unsigned long *)0x400FE340))
  #define SYSCTL_PPQEI_R          (*((volatile unsigned long *)0x400FE344))
  #define SYSCTL_PPEEPROM_R       (*((volatile unsigned long *)0x400FE358))
  #define SYSCTL_PPWTIMER_R       (*((volatile unsigned long *)0x400FE35C))
  #define SYSCTL_SRWD_R           (*((volatile unsigned long *)0x400FE500))
  #define SYSCTL_SRTIMER_R        (*((volatile unsigned long *)0x400FE504))
  #define SYSCTL_SRGPIO_R         (*((volatile unsigned long *)0x400FE508))
  #define SYSCTL_SRDMA_R          (*((volatile unsigned long *)0x400FE50C))
  #define SYSCTL_SRHIB_R          (*((volatile unsigned long *)0x400FE514))
  #define SYSCTL_SRUART_R         (*((volatile unsigned long *)0x400FE518))
  #define SYSCTL_SRSSI_R          (*((volatile unsigned long *)0x400FE51C))
  #define SYSCTL_SRI2C_R          (*((volatile unsigned long *)0x400FE520))
  #define SYSCTL_SRUSB_R          (*((volatile unsigned long *)0x400FE528))
  #define SYSCTL_SRCAN_R          (*((volatile unsigned long *)0x400FE534))
  #define SYSCTL_SRADC_R          (*((volatile unsigned long *)0x400FE538))
  #define SYSCTL_SRACMP_R         (*((volatile unsigned long *)0x400FE53C))
  #define SYSCTL_SRPWM_R          (*((volatile unsigned long *)0x400FE540))
  #define SYSCTL_SRQEI_R          (*((volatile unsigned long *)0x400FE544))
  #define SYSCTL_SREEPROM_R       (*((volatile unsigned long *)0x400FE558))
  #define SYSCTL_SRWTIMER_R       (*((volatile unsigned long *)0x400FE55C))
  #define SYSCTL_RCGCWD_R         (*((volatile unsigned long *)0x400FE600))
  #define SYSCTL_RCGCTIMER_R      (*((volatile unsigned long *)0x400FE604))
  #define SYSCTL_RCGCGPIO_R       (*((volatile unsigned long *)0x400FE608))
  #define SYSCTL_RCGCDMA_R        (*((volatile unsigned long *)0x400FE60C))
  #define SYSCTL_RCGCHIB_R        (*((volatile unsigned long *)0x400FE614))
  #define SYSCTL_RCGCUART_R       (*((volatile unsigned long *)0x400FE618))
  #define SYSCTL_RCGCSSI_R        (*((volatile unsigned long *)0x400FE61C))
  #define SYSCTL_RCGCI2C_R        (*((volatile unsigned long *)0x400FE620))
  #define SYSCTL_RCGCUSB_R        (*((volatile unsigned long *)0x400FE628))
  #define SYSCTL_RCGCCAN_R        (*((volatile unsigned long *)0x400FE634))
  #define SYSCTL_RCGCADC_R        (*((volatile unsigned long *)0x400FE638))
  #define SYSCTL_RCGCACMP_R       (*((volatile unsigned long *)0x400FE63C))
  #define SYSCTL_RCGCPWM_R        (*((volatile unsigned long *)0x400FE640))
  #define SYSCTL_RCGCQEI_R        (*((volatile unsigned long *)0x400FE644))
  #define SYSCTL_RCGCEEPROM_R     (*((volatile unsigned long *)0x400FE658))
  #define SYSCTL_RCGCWTIMER_R     (*((volatile unsigned long *)0x400FE65C))
  #define SYSCTL_SCGCWD_R         (*((volatile unsigned long *)0x400FE700))
  #define SYSCTL_SCGCTIMER_R      (*((volatile unsigned long *)0x400FE704))
  #define SYSCTL_SCGCGPIO_R       (*((volatile unsigned long *)0x400FE708))
  #define SYSCTL_SCGCDMA_R        (*((volatile unsigned long *)0x400FE70C))
  #define SYSCTL_SCGCHIB_R        (*((volatile unsigned long *)0x400FE714))
  #define SYSCTL_SCGCUART_R       (*((volatile unsigned long *)0x400FE718))
  #define SYSCTL_SCGCSSI_R        (*((volatile unsigned long *)0x400FE71C))
  #define SYSCTL_SCGCI2C_R        (*((volatile unsigned long *)0x400FE720))
  #define SYSCTL_SCGCUSB_R        (*((volatile unsigned long *)0x400FE728))
  #define SYSCTL_SCGCCAN_R        (*((volatile unsigned long *)0x400FE734))
  #define SYSCTL_SCGCADC_R        (*((volatile unsigned long *)0x400FE738))
  #define SYSCTL_SCGCACMP_R       (*((volatile unsigned long *)0x400FE73C))
  #define SYSCTL_SCGCPWM_R        (*((volatile unsigned long *)0x400FE740))
  #define SYSCTL_SCGCQEI_R        (*((volatile unsigned long *)0x400FE744))
  #define SYSCTL_SCGCEEPROM_R     (*((volatile unsigned long *)0x400FE758))
  #define SYSCTL_SCGCWTIMER_R     (*((volatile unsigned long *)0x400FE75C))
  #define SYSCTL_DCGCWD_R         (*((volatile unsigned long *)0x400FE800))
  #define SYSCTL_DCGCTIMER_R      (*((volatile unsigned long *)0x400FE804))
  #define SYSCTL_DCGCGPIO_R       (*((volatile unsigned long *)0x400FE808))
  #define SYSCTL_DCGCDMA_R        (*((volatile unsigned long *)0x400FE80C))
  #define SYSCTL_DCGCHIB_R        (*((volatile unsigned long *)0x400FE814))
  #define SYSCTL_DCGCUART_R       (*((volatile unsigned long *)0x400FE818))
  #define SYSCTL_DCGCSSI_R        (*((volatile unsigned long *)0x400FE81C))
  #define SYSCTL_DCGCI2C_R        (*((volatile unsigned long *)0x400FE820))
  #define SYSCTL_DCGCUSB_R        (*((volatile unsigned long *)0x400FE828))
  #define SYSCTL_DCGCCAN_R        (*((volatile unsigned long *)0x400FE834))
  #define SYSCTL_DCGCADC_R        (*((volatile unsigned long *)0x400FE838))
  #define SYSCTL_DCGCACMP_R       (*((volatile unsigned long *)0x400FE83C))
  #define SYSCTL_DCGCPWM_R        (*((volatile unsigned long *)0x400FE840))
  #define SYSCTL_DCGCQEI_R        (*((volatile unsigned long *)0x400FE844))
  #define SYSCTL_DCGCEEPROM_R     (*((volatile unsigned long *)0x400FE858))
  #define SYSCTL_DCGCWTIMER_R     (*((volatile unsigned long *)0x400FE85C))
  #define SYSCTL_PRWD_R           (*((volatile unsigned long *)0x400FEA00))
  #define SYSCTL_PRTIMER_R        (*((volatile unsigned long *)0x400FEA04))
  #define SYSCTL_PRGPIO_R         (*((volatile unsigned long *)0x400FEA08))
  #define SYSCTL_PRDMA_R          (*((volatile unsigned long *)0x400FEA0C))
  #define SYSCTL_PRHIB_R          (*((volatile unsigned long *)0x400FEA14))
  #define SYSCTL_PRUART_R         (*((volatile unsigned long *)0x400FEA18))
  #define SYSCTL_PRSSI_R          (*((volatile unsigned long *)0x400FEA1C))
  #define SYSCTL_PRI2C_R          (*((volatile unsigned long *)0x400FEA20))
  #define SYSCTL_PRUSB_R          (*((volatile unsigned long *)0x400FEA28))
  #define SYSCTL_PRCAN_R          (*((volatile unsigned long *)0x400FEA34))
  #define SYSCTL_PRADC_R          (*((volatile unsigned long *)0x400FEA38))
  #define SYSCTL_PRACMP_R         (*((volatile unsigned long *)0x400FEA3C))
  #define SYSCTL_PRPWM_R          (*((volatile unsigned long *)0x400FEA40))
  #define SYSCTL_PRQEI_R          (*((volatile unsigned long *)0x400FEA44))
  #define SYSCTL_PREEPROM_R       (*((volatile unsigned long *)0x400FEA58))
  #define SYSCTL_PRWTIMER_R       (*((volatile unsigned long *)0x400FEA5C))

  //*****************************************************************************
  //
  // Micro Direct Memory Access registers (UDMA)
  //
  //*****************************************************************************
  #define UDMA_STAT_R             (*((volatile unsigned long *)0x400FF000))
  #define UDMA_CFG_R              (*((volatile unsigned long *)0x400FF004))
  #define UDMA_CTLBASE_R          (*((volatile unsigned long *)0x400FF008))
  #define UDMA_ALTBASE_R          (*((volatile unsigned long *)0x400FF00C))
  #define UDMA_WAITSTAT_R         (*((volatile unsigned long *)0x400FF010))
  #define UDMA_SWREQ_R            (*((volatile unsigned long *)0x400FF014))
  #define UDMA_USEBURSTSET_R      (*((volatile unsigned long *)0x400FF018))
  #define UDMA_USEBURSTCLR_R      (*((volatile unsigned long *)0x400FF01C))
  #define UDMA_REQMASKSET_R       (*((volatile unsigned long *)0x400FF020))
  #define UDMA_REQMASKCLR_R       (*((volatile unsigned long *)0x400FF024))
  #define UDMA_ENASET_R           (*((volatile unsigned long *)0x400FF028))
  #define UDMA_ENACLR_R           (*((volatile unsigned long *)0x400FF02C))
  #define UDMA_ALTSET_R           (*((volatile unsigned long *)0x400FF030))
  #define UDMA_ALTCLR_R           (*((volatile unsigned long *)0x400FF034))
  #define UDMA_PRIOSET_R          (*((volatile unsigned long *)0x400FF038))
  #define UDMA_PRIOCLR_R          (*((volatile unsigned long *)0x400FF03C))
  #define UDMA_ERRCLR_R           (*((volatile unsigned long *)0x400FF04C))
  #define UDMA_CHASGN_R           (*((volatile unsigned long *)0x400FF500))
  #define UDMA_CHIS_R             (*((volatile unsigned long *)0x400FF504))
  #define UDMA_CHMAP0_R           (*((volatile unsigned long *)0x400FF510))
  #define UDMA_CHMAP1_R           (*((volatile unsigned long *)0x400FF514))
  #define UDMA_CHMAP2_R           (*((volatile unsigned long *)0x400FF518))
  #define UDMA_CHMAP3_R           (*((volatile unsigned long *)0x400FF51C))

  //*****************************************************************************
  //
  // Micro Direct Memory Access (uDMA) offsets (UDMA)
  //
  //*****************************************************************************
  #define UDMA_SRCENDP            0x00000000  // DMA Channel Source Address End
                                              // Pointer
  #define UDMA_DSTENDP            0x00000004  // DMA Channel Destination Address
                                              // End Pointer
  #define UDMA_CHCTL              0x00000008  // DMA Channel Control Word

