imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // NVIC registers (NVIC)
  //
  //*****************************************************************************
  #define NVIC_ACTLR_R            (*((volatile unsigned long *)0xE000E008))
  #define NVIC_ST_CTRL_R          (*((volatile unsigned long *)0xE000E010))
  #define NVIC_ST_RELOAD_R        (*((volatile unsigned long *)0xE000E014))
  #define NVIC_ST_CURRENT_R       (*((volatile unsigned long *)0xE000E018))
  #define NVIC_EN0_R              (*((volatile unsigned long *)0xE000E100))
  #define NVIC_EN1_R              (*((volatile unsigned long *)0xE000E104))
  #define NVIC_EN2_R              (*((volatile unsigned long *)0xE000E108))
  #define NVIC_EN3_R              (*((volatile unsigned long *)0xE000E10C))
  #define NVIC_EN4_R              (*((volatile unsigned long *)0xE000E110))
  #define NVIC_DIS0_R             (*((volatile unsigned long *)0xE000E180))
  #define NVIC_DIS1_R             (*((volatile unsigned long *)0xE000E184))
  #define NVIC_DIS2_R             (*((volatile unsigned long *)0xE000E188))
  #define NVIC_DIS3_R             (*((volatile unsigned long *)0xE000E18C))
  #define NVIC_DIS4_R             (*((volatile unsigned long *)0xE000E190))
  #define NVIC_PEND0_R            (*((volatile unsigned long *)0xE000E200))
  #define NVIC_PEND1_R            (*((volatile unsigned long *)0xE000E204))
  #define NVIC_PEND2_R            (*((volatile unsigned long *)0xE000E208))
  #define NVIC_PEND3_R            (*((volatile unsigned long *)0xE000E20C))
  #define NVIC_PEND4_R            (*((volatile unsigned long *)0xE000E210))
  #define NVIC_UNPEND0_R          (*((volatile unsigned long *)0xE000E280))
  #define NVIC_UNPEND1_R          (*((volatile unsigned long *)0xE000E284))
  #define NVIC_UNPEND2_R          (*((volatile unsigned long *)0xE000E288))
  #define NVIC_UNPEND3_R          (*((volatile unsigned long *)0xE000E28C))
  #define NVIC_UNPEND4_R          (*((volatile unsigned long *)0xE000E290))
  #define NVIC_ACTIVE0_R          (*((volatile unsigned long *)0xE000E300))
  #define NVIC_ACTIVE1_R          (*((volatile unsigned long *)0xE000E304))
  #define NVIC_ACTIVE2_R          (*((volatile unsigned long *)0xE000E308))
  #define NVIC_ACTIVE3_R          (*((volatile unsigned long *)0xE000E30C))
  #define NVIC_ACTIVE4_R          (*((volatile unsigned long *)0xE000E310))
  #define NVIC_PRI0_R             (*((volatile unsigned long *)0xE000E400))
  #define NVIC_PRI1_R             (*((volatile unsigned long *)0xE000E404))
  #define NVIC_PRI2_R             (*((volatile unsigned long *)0xE000E408))
  #define NVIC_PRI3_R             (*((volatile unsigned long *)0xE000E40C))
  #define NVIC_PRI4_R             (*((volatile unsigned long *)0xE000E410))
  #define NVIC_PRI5_R             (*((volatile unsigned long *)0xE000E414))
  #define NVIC_PRI6_R             (*((volatile unsigned long *)0xE000E418))
  #define NVIC_PRI7_R             (*((volatile unsigned long *)0xE000E41C))
  #define NVIC_PRI8_R             (*((volatile unsigned long *)0xE000E420))
  #define NVIC_PRI9_R             (*((volatile unsigned long *)0xE000E424))
  #define NVIC_PRI10_R            (*((volatile unsigned long *)0xE000E428))
  #define NVIC_PRI11_R            (*((volatile unsigned long *)0xE000E42C))
  #define NVIC_PRI12_R            (*((volatile unsigned long *)0xE000E430))
  #define NVIC_PRI13_R            (*((volatile unsigned long *)0xE000E434))
  #define NVIC_PRI14_R            (*((volatile unsigned long *)0xE000E438))
  #define NVIC_PRI15_R            (*((volatile unsigned long *)0xE000E43C))
  #define NVIC_PRI16_R            (*((volatile unsigned long *)0xE000E440))
  #define NVIC_PRI17_R            (*((volatile unsigned long *)0xE000E444))
  #define NVIC_PRI18_R            (*((volatile unsigned long *)0xE000E448))
  #define NVIC_PRI19_R            (*((volatile unsigned long *)0xE000E44C))
  #define NVIC_PRI20_R            (*((volatile unsigned long *)0xE000E450))
  #define NVIC_PRI21_R            (*((volatile unsigned long *)0xE000E454))
  #define NVIC_PRI22_R            (*((volatile unsigned long *)0xE000E458))
  #define NVIC_PRI23_R            (*((volatile unsigned long *)0xE000E45C))
  #define NVIC_PRI24_R            (*((volatile unsigned long *)0xE000E460))
  #define NVIC_PRI25_R            (*((volatile unsigned long *)0xE000E464))
  #define NVIC_PRI26_R            (*((volatile unsigned long *)0xE000E468))
  #define NVIC_PRI27_R            (*((volatile unsigned long *)0xE000E46C))
  #define NVIC_PRI28_R            (*((volatile unsigned long *)0xE000E470))
  #define NVIC_PRI29_R            (*((volatile unsigned long *)0xE000E474))
  #define NVIC_PRI30_R            (*((volatile unsigned long *)0xE000E478))
  #define NVIC_PRI31_R            (*((volatile unsigned long *)0xE000E47C))
  #define NVIC_PRI32_R            (*((volatile unsigned long *)0xE000E480))
  #define NVIC_PRI33_R            (*((volatile unsigned long *)0xE000E484))
  #define NVIC_PRI34_R            (*((volatile unsigned long *)0xE000E488))
  #define NVIC_CPUID_R            (*((volatile unsigned long *)0xE000ED00))
  #define NVIC_INT_CTRL_R         (*((volatile unsigned long *)0xE000ED04))
  #define NVIC_VTABLE_R           (*((volatile unsigned long *)0xE000ED08))
  #define NVIC_APINT_R            (*((volatile unsigned long *)0xE000ED0C))
  #define NVIC_SYS_CTRL_R         (*((volatile unsigned long *)0xE000ED10))
  #define NVIC_CFG_CTRL_R         (*((volatile unsigned long *)0xE000ED14))
  #define NVIC_SYS_PRI1_R         (*((volatile unsigned long *)0xE000ED18))
  #define NVIC_SYS_PRI2_R         (*((volatile unsigned long *)0xE000ED1C))
  #define NVIC_SYS_PRI3_R         (*((volatile unsigned long *)0xE000ED20))
  #define NVIC_SYS_HND_CTRL_R     (*((volatile unsigned long *)0xE000ED24))
  #define NVIC_FAULT_STAT_R       (*((volatile unsigned long *)0xE000ED28))
  #define NVIC_HFAULT_STAT_R      (*((volatile unsigned long *)0xE000ED2C))
  #define NVIC_DEBUG_STAT_R       (*((volatile unsigned long *)0xE000ED30))
  #define NVIC_MM_ADDR_R          (*((volatile unsigned long *)0xE000ED34))
  #define NVIC_FAULT_ADDR_R       (*((volatile unsigned long *)0xE000ED38))
  #define NVIC_CPAC_R             (*((volatile unsigned long *)0xE000ED88))
  #define NVIC_MPU_TYPE_R         (*((volatile unsigned long *)0xE000ED90))
  #define NVIC_MPU_CTRL_R         (*((volatile unsigned long *)0xE000ED94))
  #define NVIC_MPU_NUMBER_R       (*((volatile unsigned long *)0xE000ED98))
  #define NVIC_MPU_BASE_R         (*((volatile unsigned long *)0xE000ED9C))
  #define NVIC_MPU_ATTR_R         (*((volatile unsigned long *)0xE000EDA0))
  #define NVIC_MPU_BASE1_R        (*((volatile unsigned long *)0xE000EDA4))
  #define NVIC_MPU_ATTR1_R        (*((volatile unsigned long *)0xE000EDA8))
  #define NVIC_MPU_BASE2_R        (*((volatile unsigned long *)0xE000EDAC))
  #define NVIC_MPU_ATTR2_R        (*((volatile unsigned long *)0xE000EDB0))
  #define NVIC_MPU_BASE3_R        (*((volatile unsigned long *)0xE000EDB4))
  #define NVIC_MPU_ATTR3_R        (*((volatile unsigned long *)0xE000EDB8))
  #define NVIC_DBG_CTRL_R         (*((volatile unsigned long *)0xE000EDF0))
  #define NVIC_DBG_XFER_R         (*((volatile unsigned long *)0xE000EDF4))
  #define NVIC_DBG_DATA_R         (*((volatile unsigned long *)0xE000EDF8))
  #define NVIC_DBG_INT_R          (*((volatile unsigned long *)0xE000EDFC))
  #define NVIC_SW_TRIG_R          (*((volatile unsigned long *)0xE000EF00))
  #define NVIC_FPCC_R             (*((volatile unsigned long *)0xE000EF34))
  #define NVIC_FPCA_R             (*((volatile unsigned long *)0xE000EF38))
  #define NVIC_FPDSC_R            (*((volatile unsigned long *)0xE000EF3C))

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_LOAD register.
  //
  //*****************************************************************************
  #define WDT_LOAD_M              0xFFFFFFFF  // Watchdog Load Value
  #define WDT_LOAD_S              0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_VALUE register.
  //
  //*****************************************************************************
  #define WDT_VALUE_M             0xFFFFFFFF  // Watchdog Value
  #define WDT_VALUE_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_CTL register.
  //
  //*****************************************************************************
  #define WDT_CTL_WRC             0x80000000  // Write Complete
  #define WDT_CTL_INTTYPE         0x00000004  // Watchdog Interrupt Type
  #define WDT_CTL_RESEN           0x00000002  // Watchdog Reset Enable
  #define WDT_CTL_INTEN           0x00000001  // Watchdog Interrupt Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_ICR register.
  //
  //*****************************************************************************
  #define WDT_ICR_M               0xFFFFFFFF  // Watchdog Interrupt Clear
  #define WDT_ICR_S               0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_RIS register.
  //
  //*****************************************************************************
  #define WDT_RIS_WDTRIS          0x00000001  // Watchdog Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_MIS register.
  //
  //*****************************************************************************
  #define WDT_MIS_WDTMIS          0x00000001  // Watchdog Masked Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_TEST register.
  //
  //*****************************************************************************
  #define WDT_TEST_STALL          0x00000100  // Watchdog Stall Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the WDT_O_LOCK register.
  //
  //*****************************************************************************
  #define WDT_LOCK_M              0xFFFFFFFF  // Watchdog Lock
  #define WDT_LOCK_UNLOCKED       0x00000000  // Unlocked
  #define WDT_LOCK_LOCKED         0x00000001  // Locked
  #define WDT_LOCK_UNLOCK         0x1ACCE551  // Unlocks the watchdog timer

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_O_IM register.
  //
  //*****************************************************************************
  #define GPIO_IM_GPIO_M          0x000000FF  // GPIO Interrupt Mask Enable
  #define GPIO_IM_GPIO_S          0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_O_RIS register.
  //
  //*****************************************************************************
  #define GPIO_RIS_GPIO_M         0x000000FF  // GPIO Interrupt Raw Status
  #define GPIO_RIS_GPIO_S         0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_O_MIS register.
  //
  //*****************************************************************************
  #define GPIO_MIS_GPIO_M         0x000000FF  // GPIO Masked Interrupt Status
  #define GPIO_MIS_GPIO_S         0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_O_ICR register.
  //
  //*****************************************************************************
  #define GPIO_ICR_GPIO_M         0x000000FF  // GPIO Interrupt Clear
  #define GPIO_ICR_GPIO_S         0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_O_LOCK register.
  //
  //*****************************************************************************
  #define GPIO_LOCK_M             0xFFFFFFFF  // GPIO Lock
  #define GPIO_LOCK_UNLOCKED      0x00000000  // The GPIOCR register is unlocked
                                              // and may be modified
  #define GPIO_LOCK_LOCKED        0x00000001  // The GPIOCR register is locked
                                              // and may not be modified
  #define GPIO_LOCK_KEY           0x4C4F434B  // Unlocks the GPIO_CR register

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_PCTL register for
  // port A.
  //
  //*****************************************************************************
  #define GPIO_PCTL_PA7_M         0xF0000000  // PA7 mask
  #define GPIO_PCTL_PA7_I2C1SDA   0x30000000  // I2C1SDA on PA7
  #define GPIO_PCTL_PA7_M1PWM3    0x50000000  // M1PWM3 on PA7
  #define GPIO_PCTL_PA6_M         0x0F000000  // PA6 mask
  #define GPIO_PCTL_PA6_I2C1SCL   0x03000000  // I2C1SCL on PA6
  #define GPIO_PCTL_PA6_M1PWM2    0x05000000  // M1PWM2 on PA6
  #define GPIO_PCTL_PA5_M         0x00F00000  // PA5 mask
  #define GPIO_PCTL_PA5_SSI0TX    0x00200000  // SSI0TX on PA5
  #define GPIO_PCTL_PA4_M         0x000F0000  // PA4 mask
  #define GPIO_PCTL_PA4_SSI0RX    0x00020000  // SSI0RX on PA4
  #define GPIO_PCTL_PA3_M         0x0000F000  // PA3 mask
  #define GPIO_PCTL_PA3_SSI0FSS   0x00002000  // SSI0FSS on PA3
  #define GPIO_PCTL_PA2_M         0x00000F00  // PA2 mask
  #define GPIO_PCTL_PA2_SSI0CLK   0x00000200  // SSI0CLK on PA2
  #define GPIO_PCTL_PA1_M         0x000000F0  // PA1 mask
  #define GPIO_PCTL_PA1_U0TX      0x00000010  // U0TX on PA1
  #define GPIO_PCTL_PA1_CAN1TX    0x00000080  // CAN1TX on PA1
  #define GPIO_PCTL_PA0_M         0x0000000F  // PA0 mask
  #define GPIO_PCTL_PA0_U0RX      0x00000001  // U0RX on PA0
  #define GPIO_PCTL_PA0_CAN1RX    0x00000008  // CAN1RX on PA0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_PCTL register for
  // port B.
  //
  //*****************************************************************************
  #define GPIO_PCTL_PB7_M         0xF0000000  // PB7 mask
  #define GPIO_PCTL_PB7_SSI2TX    0x20000000  // SSI2TX on PB7
  #define GPIO_PCTL_PB7_M0PWM1    0x40000000  // M0PWM1 on PB7
  #define GPIO_PCTL_PB7_T0CCP1    0x70000000  // T0CCP1 on PB7
  #define GPIO_PCTL_PB6_M         0x0F000000  // PB6 mask
  #define GPIO_PCTL_PB6_SSI2RX    0x02000000  // SSI2RX on PB6
  #define GPIO_PCTL_PB6_M0PWM0    0x04000000  // M0PWM0 on PB6
  #define GPIO_PCTL_PB6_T0CCP0    0x07000000  // T0CCP0 on PB6
  #define GPIO_PCTL_PB5_M         0x00F00000  // PB5 mask
  #define GPIO_PCTL_PB5_SSI2FSS   0x00200000  // SSI2FSS on PB5
  #define GPIO_PCTL_PB5_M0PWM3    0x00400000  // M0PWM3 on PB5
  #define GPIO_PCTL_PB5_T1CCP1    0x00700000  // T1CCP1 on PB5
  #define GPIO_PCTL_PB5_CAN0TX    0x00800000  // CAN0TX on PB5
  #define GPIO_PCTL_PB4_M         0x000F0000  // PB4 mask
  #define GPIO_PCTL_PB4_SSI2CLK   0x00020000  // SSI2CLK on PB4
  #define GPIO_PCTL_PB4_M0PWM2    0x00040000  // M0PWM2 on PB4
  #define GPIO_PCTL_PB4_T1CCP0    0x00070000  // T1CCP0 on PB4
  #define GPIO_PCTL_PB4_CAN0RX    0x00080000  // CAN0RX on PB4
  #define GPIO_PCTL_PB3_M         0x0000F000  // PB3 mask
  #define GPIO_PCTL_PB3_I2C0SDA   0x00003000  // I2C0SDA on PB3
  #define GPIO_PCTL_PB3_T3CCP1    0x00007000  // T3CCP1 on PB3
  #define GPIO_PCTL_PB2_M         0x00000F00  // PB2 mask
  #define GPIO_PCTL_PB2_I2C0SCL   0x00000300  // I2C0SCL on PB2
  #define GPIO_PCTL_PB2_T3CCP0    0x00000700  // T3CCP0 on PB2
  #define GPIO_PCTL_PB1_M         0x000000F0  // PB1 mask
  #define GPIO_PCTL_PB1_USB0VBUS  0x00000000  // USB0VBUS on PB1
  #define GPIO_PCTL_PB1_U1TX      0x00000010  // U1TX on PB1
  #define GPIO_PCTL_PB1_T2CCP1    0x00000070  // T2CCP1 on PB1
  #define GPIO_PCTL_PB0_M         0x0000000F  // PB0 mask
  #define GPIO_PCTL_PB0_USB0ID    0x00000000  // USB0ID on PB0
  #define GPIO_PCTL_PB0_U1RX      0x00000001  // U1RX on PB0
  #define GPIO_PCTL_PB0_T2CCP0    0x00000007  // T2CCP0 on PB0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_PCTL register for
  // port C.
  //
  //*****************************************************************************
  #define GPIO_PCTL_PC7_M         0xF0000000  // PC7 mask
  #define GPIO_PCTL_PC7_U3TX      0x10000000  // U3TX on PC7
  #define GPIO_PCTL_PC7_WT1CCP1   0x70000000  // WT1CCP1 on PC7
  #define GPIO_PCTL_PC7_USB0PFLT  0x80000000  // USB0PFLT on PC7
  #define GPIO_PCTL_PC6_M         0x0F000000  // PC6 mask
  #define GPIO_PCTL_PC6_U3RX      0x01000000  // U3RX on PC6
  #define GPIO_PCTL_PC6_PHB1      0x06000000  // PHB1 on PC6
  #define GPIO_PCTL_PC6_WT1CCP0   0x07000000  // WT1CCP0 on PC6
  #define GPIO_PCTL_PC6_USB0EPEN  0x08000000  // USB0EPEN on PC6
  #define GPIO_PCTL_PC5_M         0x00F00000  // PC5 mask
  #define GPIO_PCTL_PC5_U4TX      0x00100000  // U4TX on PC5
  #define GPIO_PCTL_PC5_U1TX      0x00200000  // U1TX on PC5
  #define GPIO_PCTL_PC5_M0PWM7    0x00400000  // M0PWM7 on PC5
  #define GPIO_PCTL_PC5_PHA1      0x00600000  // PHA1 on PC5
  #define GPIO_PCTL_PC5_WT0CCP1   0x00700000  // WT0CCP1 on PC5
  #define GPIO_PCTL_PC5_U1CTS     0x00800000  // U1CTS on PC5
  #define GPIO_PCTL_PC4_M         0x000F0000  // PC4 mask
  #define GPIO_PCTL_PC4_U4RX      0x00010000  // U4RX on PC4
  #define GPIO_PCTL_PC4_U1RX      0x00020000  // U1RX on PC4
  #define GPIO_PCTL_PC4_M0PWM6    0x00040000  // M0PWM6 on PC4
  #define GPIO_PCTL_PC4_IDX1      0x00060000  // IDX1 on PC4
  #define GPIO_PCTL_PC4_WT0CCP0   0x00070000  // WT0CCP0 on PC4
  #define GPIO_PCTL_PC4_U1RTS     0x00080000  // U1RTS on PC4
  #define GPIO_PCTL_PC3_M         0x0000F000  // PC3 mask
  #define GPIO_PCTL_PC3_TDO       0x00001000  // TDO on PC3
  #define GPIO_PCTL_PC3_T5CCP1    0x00007000  // T5CCP1 on PC3
  #define GPIO_PCTL_PC2_M         0x00000F00  // PC2 mask
  #define GPIO_PCTL_PC2_TDI       0x00000100  // TDI on PC2
  #define GPIO_PCTL_PC2_T5CCP0    0x00000700  // T5CCP0 on PC2
  #define GPIO_PCTL_PC1_M         0x000000F0  // PC1 mask
  #define GPIO_PCTL_PC1_TMS       0x00000010  // TMS on PC1
  #define GPIO_PCTL_PC1_T4CCP1    0x00000070  // T4CCP1 on PC1
  #define GPIO_PCTL_PC0_M         0x0000000F  // PC0 mask
  #define GPIO_PCTL_PC0_TCK       0x00000001  // TCK on PC0
  #define GPIO_PCTL_PC0_T4CCP0    0x00000007  // T4CCP0 on PC0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the GPIO_PCTL register for
  // port D.
  //
  //*****************************************************************************
  #define GPIO_PCTL_PD7_M         0xF0000000  // PD7 mask
  #define GPIO_PCTL_PD7_U2TX      0x10000000  // U2TX on PD7
  #define GPIO_PCTL_PD7_PHB0      0x60000000  // PHB0 on PD7
  #define GPIO_PCTL_PD7_WT5CCP1   0x70000000  // WT5CCP1 on PD7
  #define GPIO_PCTL_PD7_NMI       0x80000000  // NMI on PD7
  #define GPIO_PCTL_PD6_M         0x0F000000  // PD6 mask
  #define GPIO_PCTL_PD6_U2RX      0x01000000  // U2RX on PD6
  #define GPIO_PCTL_PD6_M0FAULT0  0x04000000  // M0FAULT0 on PD6
  #define GPIO_PCTL_PD6_PHA0      0x06000000  // PHA0 on PD6
  #define GPIO_PCTL_PD6_WT5CCP0   0x07000000  // WT5CCP0 on PD6
  #define GPIO_PCTL_PD5_M         0x00F00000  // PD5 mask
  #define GPIO_PCTL_PD5_USB0DP    0x00000000  // USB0DP on PD5
  #define GPIO_PCTL_PD5_U6TX      0x00100000  // U6TX on PD5
  #define GPIO_PCTL_PD5_WT4CCP1   0x00700000  // WT4CCP1 on PD5
  #define GPIO_PCTL_PD4_M         0x000F0000  // PD4 mask
  #define GPIO_PCTL_PD4_USB0DM    0x00000000  // USB0DM on PD4
  #define GPIO_PCTL_PD4_U6RX      0x00010000  // U6RX on PD4
  #define GPIO_PCTL_PD4_WT4CCP0   0x00070000  // WT4CCP0 on PD4
  #define GPIO_PCTL_PD3_M         0x0000F000  // PD3 mask
  #define GPIO_PCTL_PD3_AIN4      0x00000000  // AIN4 on PD3
  #define GPIO_PCTL_PD3_SSI3TX    0x00001000  // SSI3TX on PD3
  #define GPIO_PCTL_PD3_SSI1TX    0x00002000  // SSI1TX on PD3
  #define GPIO_PCTL_PD3_IDX0      0x00006000  // IDX0 on PD3
  #define GPIO_PCTL_PD3_WT3CCP1   0x00007000  // WT3CCP1 on PD3
  #define GPIO_PCTL_PD3_USB0PFLT  0x00008000  // USB0PFLT on PD3
  #define GPIO_PCTL_PD2_M         0x00000F00  // PD2 mask
  #define GPIO_PCTL_PD2_AIN5      0x00000000  // AIN5 on PD2
  #define GPIO_PCTL_PD2_SSI3RX    0x00000100  // SSI3RX on PD2
  #define GPIO_PCTL_PD2_SSI1RX    0x00000200  // SSI1RX on PD2
  #define GPIO_PCTL_PD2_M0FAULT0  0x00000400  // M0FAULT0 on PD2
  #define GPIO_PCTL_PD2_WT3CCP0   0x00000700  // WT3CCP0 on PD2
  #define GPIO_PCTL_PD2_USB0EPEN  0x00000800  // USB0EPEN on PD2
  #define GPIO_PCTL_PD1_M         0x000000F0  // PD1 mask
  #define GPIO_PCTL_PD1_AIN6      0x00000000  // AIN6 on PD1
  #define GPIO_PCTL_PD1_SSI3FSS   0x00000010  // SSI3FSS on PD1
  #define GPIO_PCTL_PD1_SSI1FSS   0x00000020  // SSI1FSS on PD1
  #define GPIO_PCTL_PD1_I2C3SDA   0x00000030  // I2C3SDA on PD1
  #define GPIO_PCTL_PD1_M0PWM7    0x00000040  // M0PWM7 on PD1
  #define GPIO_PCTL_PD1_M1PWM1    0x00000050  // M1PWM1 on PD1
  #define GPIO_PCTL_PD1_WT2CCP1   0x00000070  // WT2CCP1 on PD1
  #define GPIO_PCTL_PD0_M         0x0000000F  // PD0 mask
  #define GPIO_PCTL_PD0_AIN7      0x00000000  // AIN7 on PD0
  #define GPIO_PCTL_PD0_SSI3CLK   0x00000001  // SSI3CLK on PD0
  #define GPIO_PCTL_PD0_SSI1CLK   0x00000002  // SSI1CLK on PD0
  #define GPIO_PCTL_PD0_I2C3SCL   0x00000003  // I2C3SCL on PD0
  #define GPIO_PCTL_PD0_M0PWM6    0x00000004  // M0PWM6 on PD0
  #define GPIO_PCTL_PD0_M1PWM0    0x00000005  // M1PWM0 on PD0
  #define GPIO_PCTL_PD0_WT2CCP0   0x00000007  // WT2CCP0 on PD0

