imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the UART_O_9BITADDR
  // register.
  //
  //*****************************************************************************
  #define UART_9BITADDR_9BITEN    0x00008000  // Enable 9-Bit Mode
  #define UART_9BITADDR_ADDR_M    0x000000FF  // Self Address for 9-Bit Mode
  #define UART_9BITADDR_ADDR_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the UART_O_9BITAMASK
  // register.
  //
  //*****************************************************************************
  #define UART_9BITAMASK_MASK_M   0x000000FF  // Self Address Mask for 9-Bit Mode
  #define UART_9BITAMASK_MASK_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the UART_O_PP register.
  //
  //*****************************************************************************
  #define UART_PP_NB              0x00000002  // 9-Bit Support
  #define UART_PP_SC              0x00000001  // Smart Card Support

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the UART_O_CC register.
  //
  //*****************************************************************************
  #define UART_CC_CS_M            0x0000000F  // UART Baud Clock Source
  #define UART_CC_CS_SYSCLK       0x00000000  // The system clock (default)
  #define UART_CC_CS_PIOSC        0x00000005  // PIOSC

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MSA register.
  //
  //*****************************************************************************
  #define I2C_MSA_SA_M            0x000000FE  // I2C Slave Address
  #define I2C_MSA_RS              0x00000001  // Receive not send
  #define I2C_MSA_SA_S            1

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MCS register.
  //
  //*****************************************************************************
  #define I2C_MCS_CLKTO           0x00000080  // Clock Timeout Error
  #define I2C_MCS_BUSBSY          0x00000040  // Bus Busy
  #define I2C_MCS_IDLE            0x00000020  // I2C Idle
  #define I2C_MCS_ARBLST          0x00000010  // Arbitration Lost
  #define I2C_MCS_HS              0x00000010  // High-Speed Enable
  #define I2C_MCS_ACK             0x00000008  // Data Acknowledge Enable
  #define I2C_MCS_DATACK          0x00000008  // Acknowledge Data
  #define I2C_MCS_ADRACK          0x00000004  // Acknowledge Address
  #define I2C_MCS_STOP            0x00000004  // Generate STOP
  #define I2C_MCS_ERROR           0x00000002  // Error
  #define I2C_MCS_START           0x00000002  // Generate START
  #define I2C_MCS_RUN             0x00000001  // I2C Master Enable
  #define I2C_MCS_BUSY            0x00000001  // I2C Busy

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MDR register.
  //
  //*****************************************************************************
  #define I2C_MDR_DATA_M          0x000000FF  // Data Transferred
  #define I2C_MDR_DATA_S          0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MTPR register.
  //
  //*****************************************************************************
  #define I2C_MTPR_HS             0x00000080  // High-Speed Enable
  #define I2C_MTPR_TPR_M          0x0000007F  // Timer Period
  #define I2C_MTPR_TPR_S          0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MIMR register.
  //
  //*****************************************************************************
  #define I2C_MIMR_CLKIM          0x00000002  // Clock Timeout Interrupt Mask
  #define I2C_MIMR_IM             0x00000001  // Master Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MRIS register.
  //
  //*****************************************************************************
  #define I2C_MRIS_CLKRIS         0x00000002  // Clock Timeout Raw Interrupt
                                              // Status
  #define I2C_MRIS_RIS            0x00000001  // Master Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MMIS register.
  //
  //*****************************************************************************
  #define I2C_MMIS_CLKMIS         0x00000002  // Clock Timeout Masked Interrupt
                                              // Status
  #define I2C_MMIS_MIS            0x00000001  // Masked Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MICR register.
  //
  //*****************************************************************************
  #define I2C_MICR_CLKIC          0x00000002  // Clock Timeout Interrupt Clear
  #define I2C_MICR_IC             0x00000001  // Master Interrupt Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MCR register.
  //
  //*****************************************************************************
  #define I2C_MCR_GFE             0x00000040  // I2C Glitch Filter Enable
  #define I2C_MCR_SFE             0x00000020  // I2C Slave Function Enable
  #define I2C_MCR_MFE             0x00000010  // I2C Master Function Enable
  #define I2C_MCR_LPBK            0x00000001  // I2C Loopback

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MCLKOCNT register.
  //
  //*****************************************************************************
  #define I2C_MCLKOCNT_CNTL_M     0x000000FF  // I2C Master Count
  #define I2C_MCLKOCNT_CNTL_S     0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MBMON register.
  //
  //*****************************************************************************
  #define I2C_MBMON_SDA           0x00000002  // I2C SDA Status
  #define I2C_MBMON_SCL           0x00000001  // I2C SCL Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_MCR2 register.
  //
  //*****************************************************************************
  #define I2C_MCR2_GFPW_M         0x00000070  // I2C Glitch Filter Pulse Width
  #define I2C_MCR2_GFPW_BYPASS    0x00000000  // Bypass
  #define I2C_MCR2_GFPW_1         0x00000010  // 1 clock
  #define I2C_MCR2_GFPW_2         0x00000020  // 2 clocks
  #define I2C_MCR2_GFPW_3         0x00000030  // 3 clocks
  #define I2C_MCR2_GFPW_4         0x00000040  // 4 clocks
  #define I2C_MCR2_GFPW_8         0x00000050  // 8 clocks
  #define I2C_MCR2_GFPW_16        0x00000060  // 16 clocks
  #define I2C_MCR2_GFPW_32        0x00000070  // 32 clocks

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SOAR register.
  //
  //*****************************************************************************
  #define I2C_SOAR_OAR_M          0x0000007F  // I2C Slave Own Address
  #define I2C_SOAR_OAR_S          0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SCSR register.
  //
  //*****************************************************************************
  #define I2C_SCSR_OAR2SEL        0x00000008  // OAR2 Address Matched
  #define I2C_SCSR_FBR            0x00000004  // First Byte Received
  #define I2C_SCSR_TREQ           0x00000002  // Transmit Request
  #define I2C_SCSR_DA             0x00000001  // Device Active
  #define I2C_SCSR_RREQ           0x00000001  // Receive Request

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SDR register.
  //
  //*****************************************************************************
  #define I2C_SDR_DATA_M          0x000000FF  // Data for Transfer
  #define I2C_SDR_DATA_S          0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SIMR register.
  //
  //*****************************************************************************
  #define I2C_SIMR_STOPIM         0x00000004  // Stop Condition Interrupt Mask
  #define I2C_SIMR_STARTIM        0x00000002  // Start Condition Interrupt Mask
  #define I2C_SIMR_DATAIM         0x00000001  // Data Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SRIS register.
  //
  //*****************************************************************************
  #define I2C_SRIS_STOPRIS        0x00000004  // Stop Condition Raw Interrupt
                                              // Status
  #define I2C_SRIS_STARTRIS       0x00000002  // Start Condition Raw Interrupt
                                              // Status
  #define I2C_SRIS_DATARIS        0x00000001  // Data Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SMIS register.
  //
  //*****************************************************************************
  #define I2C_SMIS_STOPMIS        0x00000004  // Stop Condition Masked Interrupt
                                              // Status
  #define I2C_SMIS_STARTMIS       0x00000002  // Start Condition Masked Interrupt
                                              // Status
  #define I2C_SMIS_DATAMIS        0x00000001  // Data Masked Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SICR register.
  //
  //*****************************************************************************
  #define I2C_SICR_STOPIC         0x00000004  // Stop Condition Interrupt Clear
  #define I2C_SICR_STARTIC        0x00000002  // Start Condition Interrupt Clear
  #define I2C_SICR_DATAIC         0x00000001  // Data Interrupt Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SOAR2 register.
  //
  //*****************************************************************************
  #define I2C_SOAR2_OAR2EN        0x00000080  // I2C Slave Own Address 2 Enable
  #define I2C_SOAR2_OAR2_M        0x0000007F  // I2C Slave Own Address 2
  #define I2C_SOAR2_OAR2_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_SACKCTL register.
  //
  //*****************************************************************************
  #define I2C_SACKCTL_ACKOVAL     0x00000002  // I2C Slave ACK Override Value
  #define I2C_SACKCTL_ACKOEN      0x00000001  // I2C Slave ACK Override Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_PP register.
  //
  //*****************************************************************************
  #define I2C_PP_HS               0x00000001  // High-Speed Capable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the I2C_O_PC register.
  //
  //*****************************************************************************
  #define I2C_PC_HS               0x00000001  // High-Speed Capable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_CTL register.
  //
  //*****************************************************************************
  #define PWM_CTL_GLOBALSYNC3     0x00000008  // Update PWM Generator 3
  #define PWM_CTL_GLOBALSYNC2     0x00000004  // Update PWM Generator 2
  #define PWM_CTL_GLOBALSYNC1     0x00000002  // Update PWM Generator 1
  #define PWM_CTL_GLOBALSYNC0     0x00000001  // Update PWM Generator 0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_SYNC register.
  //
  //*****************************************************************************
  #define PWM_SYNC_SYNC3          0x00000008  // Reset Generator 3 Counter
  #define PWM_SYNC_SYNC2          0x00000004  // Reset Generator 2 Counter
  #define PWM_SYNC_SYNC1          0x00000002  // Reset Generator 1 Counter
  #define PWM_SYNC_SYNC0          0x00000001  // Reset Generator 0 Counter

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_ENABLE register.
  //
  //*****************************************************************************
  #define PWM_ENABLE_PWM7EN       0x00000080  // PWM7 Output Enable
  #define PWM_ENABLE_PWM6EN       0x00000040  // PWM6 Output Enable
  #define PWM_ENABLE_PWM5EN       0x00000020  // PWM5 Output Enable
  #define PWM_ENABLE_PWM4EN       0x00000010  // PWM4 Output Enable
  #define PWM_ENABLE_PWM3EN       0x00000008  // PWM3 Output Enable
  #define PWM_ENABLE_PWM2EN       0x00000004  // PWM2 Output Enable
  #define PWM_ENABLE_PWM1EN       0x00000002  // PWM1 Output Enable
  #define PWM_ENABLE_PWM0EN       0x00000001  // PWM0 Output Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_INVERT register.
  //
  //*****************************************************************************
  #define PWM_INVERT_PWM7INV      0x00000080  // Invert PWM7 Signal
  #define PWM_INVERT_PWM6INV      0x00000040  // Invert PWM6 Signal
  #define PWM_INVERT_PWM5INV      0x00000020  // Invert PWM5 Signal
  #define PWM_INVERT_PWM4INV      0x00000010  // Invert PWM4 Signal
  #define PWM_INVERT_PWM3INV      0x00000008  // Invert PWM3 Signal
  #define PWM_INVERT_PWM2INV      0x00000004  // Invert PWM2 Signal
  #define PWM_INVERT_PWM1INV      0x00000002  // Invert PWM1 Signal
  #define PWM_INVERT_PWM0INV      0x00000001  // Invert PWM0 Signal

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_FAULT register.
  //
  //*****************************************************************************
  #define PWM_FAULT_FAULT7        0x00000080  // PWM7 Fault
  #define PWM_FAULT_FAULT6        0x00000040  // PWM6 Fault
  #define PWM_FAULT_FAULT5        0x00000020  // PWM5 Fault
  #define PWM_FAULT_FAULT4        0x00000010  // PWM4 Fault
  #define PWM_FAULT_FAULT3        0x00000008  // PWM3 Fault
  #define PWM_FAULT_FAULT2        0x00000004  // PWM2 Fault
  #define PWM_FAULT_FAULT1        0x00000002  // PWM1 Fault
  #define PWM_FAULT_FAULT0        0x00000001  // PWM0 Fault

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_INTEN register.
  //
  //*****************************************************************************
  #define PWM_INTEN_INTFAULT1     0x00020000  // Interrupt Fault 1
  #define PWM_INTEN_INTFAULT0     0x00010000  // Interrupt Fault 0
  #define PWM_INTEN_INTPWM3       0x00000008  // PWM3 Interrupt Enable
  #define PWM_INTEN_INTPWM2       0x00000004  // PWM2 Interrupt Enable
  #define PWM_INTEN_INTPWM1       0x00000002  // PWM1 Interrupt Enable
  #define PWM_INTEN_INTPWM0       0x00000001  // PWM0 Interrupt Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_RIS register.
  //
  //*****************************************************************************
  #define PWM_RIS_INTFAULT1       0x00020000  // Interrupt Fault PWM 1
  #define PWM_RIS_INTFAULT0       0x00010000  // Interrupt Fault PWM 0
  #define PWM_RIS_INTPWM3         0x00000008  // PWM3 Interrupt Asserted
  #define PWM_RIS_INTPWM2         0x00000004  // PWM2 Interrupt Asserted
  #define PWM_RIS_INTPWM1         0x00000002  // PWM1 Interrupt Asserted
  #define PWM_RIS_INTPWM0         0x00000001  // PWM0 Interrupt Asserted

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_ISC register.
  //
  //*****************************************************************************
  #define PWM_ISC_INTFAULT1       0x00020000  // FAULT1 Interrupt Asserted
  #define PWM_ISC_INTFAULT0       0x00010000  // FAULT0 Interrupt Asserted
  #define PWM_ISC_INTPWM3         0x00000008  // PWM3 Interrupt Status
  #define PWM_ISC_INTPWM2         0x00000004  // PWM2 Interrupt Status
  #define PWM_ISC_INTPWM1         0x00000002  // PWM1 Interrupt Status
  #define PWM_ISC_INTPWM0         0x00000001  // PWM0 Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_STATUS register.
  //
  //*****************************************************************************
  #define PWM_STATUS_FAULT1       0x00000002  // Generator 1 Fault Status
  #define PWM_STATUS_FAULT0       0x00000001  // Generator 0 Fault Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_FAULTVAL register.
  //
  //*****************************************************************************
  #define PWM_FAULTVAL_PWM7       0x00000080  // PWM7 Fault Value
  #define PWM_FAULTVAL_PWM6       0x00000040  // PWM6 Fault Value
  #define PWM_FAULTVAL_PWM5       0x00000020  // PWM5 Fault Value
  #define PWM_FAULTVAL_PWM4       0x00000010  // PWM4 Fault Value
  #define PWM_FAULTVAL_PWM3       0x00000008  // PWM3 Fault Value
  #define PWM_FAULTVAL_PWM2       0x00000004  // PWM2 Fault Value
  #define PWM_FAULTVAL_PWM1       0x00000002  // PWM1 Fault Value
  #define PWM_FAULTVAL_PWM0       0x00000001  // PWM0 Fault Value

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the PWM_O_ENUPD register.
  //
  //*****************************************************************************
  #define PWM_ENUPD_ENUPD7_M      0x0000C000  // PWM7 Enable Update Mode
  #define PWM_ENUPD_ENUPD7_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD7_LSYNC  0x00008000  // Locally Synchronized
  #define PWM_ENUPD_ENUPD7_GSYNC  0x0000C000  // Globally Synchronized
  #define PWM_ENUPD_ENUPD6_M      0x00003000  // PWM6 Enable Update Mode
  #define PWM_ENUPD_ENUPD6_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD6_LSYNC  0x00002000  // Locally Synchronized
  #define PWM_ENUPD_ENUPD6_GSYNC  0x00003000  // Globally Synchronized
  #define PWM_ENUPD_ENUPD5_M      0x00000C00  // PWM5 Enable Update Mode
  #define PWM_ENUPD_ENUPD5_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD5_LSYNC  0x00000800  // Locally Synchronized
  #define PWM_ENUPD_ENUPD5_GSYNC  0x00000C00  // Globally Synchronized
  #define PWM_ENUPD_ENUPD4_M      0x00000300  // PWM4 Enable Update Mode
  #define PWM_ENUPD_ENUPD4_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD4_LSYNC  0x00000200  // Locally Synchronized
  #define PWM_ENUPD_ENUPD4_GSYNC  0x00000300  // Globally Synchronized
  #define PWM_ENUPD_ENUPD3_M      0x000000C0  // PWM3 Enable Update Mode
  #define PWM_ENUPD_ENUPD3_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD3_LSYNC  0x00000080  // Locally Synchronized
  #define PWM_ENUPD_ENUPD3_GSYNC  0x000000C0  // Globally Synchronized
  #define PWM_ENUPD_ENUPD2_M      0x00000030  // PWM2 Enable Update Mode
  #define PWM_ENUPD_ENUPD2_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD2_LSYNC  0x00000020  // Locally Synchronized
  #define PWM_ENUPD_ENUPD2_GSYNC  0x00000030  // Globally Synchronized
  #define PWM_ENUPD_ENUPD1_M      0x0000000C  // PWM1 Enable Update Mode
  #define PWM_ENUPD_ENUPD1_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD1_LSYNC  0x00000008  // Locally Synchronized
  #define PWM_ENUPD_ENUPD1_GSYNC  0x0000000C  // Globally Synchronized
  #define PWM_ENUPD_ENUPD0_M      0x00000003  // PWM0 Enable Update Mode
  #define PWM_ENUPD_ENUPD0_IMM    0x00000000  // Immediate
  #define PWM_ENUPD_ENUPD0_LSYNC  0x00000002  // Locally Synchronized
  #define PWM_ENUPD_ENUPD0_GSYNC  0x00000003  // Globally Synchronized

