imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_CTL register.
  //
  //*****************************************************************************
  #define QEI_CTL_FILTCNT_M       0x000F0000  // Input Filter Prescale Count
  #define QEI_CTL_FILTEN          0x00002000  // Enable Input Filter
  #define QEI_CTL_STALLEN         0x00001000  // Stall QEI
  #define QEI_CTL_INVI            0x00000800  // Invert Index Pulse
  #define QEI_CTL_INVB            0x00000400  // Invert PhB
  #define QEI_CTL_INVA            0x00000200  // Invert PhA
  #define QEI_CTL_VELDIV_M        0x000001C0  // Predivide Velocity
  #define QEI_CTL_VELDIV_1        0x00000000  // QEI clock /1
  #define QEI_CTL_VELDIV_2        0x00000040  // QEI clock /2
  #define QEI_CTL_VELDIV_4        0x00000080  // QEI clock /4
  #define QEI_CTL_VELDIV_8        0x000000C0  // QEI clock /8
  #define QEI_CTL_VELDIV_16       0x00000100  // QEI clock /16
  #define QEI_CTL_VELDIV_32       0x00000140  // QEI clock /32
  #define QEI_CTL_VELDIV_64       0x00000180  // QEI clock /64
  #define QEI_CTL_VELDIV_128      0x000001C0  // QEI clock /128
  #define QEI_CTL_VELEN           0x00000020  // Capture Velocity
  #define QEI_CTL_RESMODE         0x00000010  // Reset Mode
  #define QEI_CTL_CAPMODE         0x00000008  // Capture Mode
  #define QEI_CTL_SIGMODE         0x00000004  // Signal Mode
  #define QEI_CTL_SWAP            0x00000002  // Swap Signals
  #define QEI_CTL_ENABLE          0x00000001  // Enable QEI
  #define QEI_CTL_FILTCNT_S       16

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_STAT register.
  //
  //*****************************************************************************
  #define QEI_STAT_DIRECTION      0x00000002  // Direction of Rotation
  #define QEI_STAT_ERROR          0x00000001  // Error Detected

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_POS register.
  //
  //*****************************************************************************
  #define QEI_POS_M               0xFFFFFFFF  // Current Position Integrator
                                              // Value
  #define QEI_POS_S               0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_MAXPOS register.
  //
  //*****************************************************************************
  #define QEI_MAXPOS_M            0xFFFFFFFF  // Maximum Position Integrator
                                              // Value
  #define QEI_MAXPOS_S            0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_LOAD register.
  //
  //*****************************************************************************
  #define QEI_LOAD_M              0xFFFFFFFF  // Velocity Timer Load Value
  #define QEI_LOAD_S              0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_TIME register.
  //
  //*****************************************************************************
  #define QEI_TIME_M              0xFFFFFFFF  // Velocity Timer Current Value
  #define QEI_TIME_S              0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_COUNT register.
  //
  //*****************************************************************************
  #define QEI_COUNT_M             0xFFFFFFFF  // Velocity Pulse Count
  #define QEI_COUNT_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_SPEED register.
  //
  //*****************************************************************************
  #define QEI_SPEED_M             0xFFFFFFFF  // Velocity
  #define QEI_SPEED_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_INTEN register.
  //
  //*****************************************************************************
  #define QEI_INTEN_ERROR         0x00000008  // Phase Error Interrupt Enable
  #define QEI_INTEN_DIR           0x00000004  // Direction Change Interrupt
                                              // Enable
  #define QEI_INTEN_TIMER         0x00000002  // Timer Expires Interrupt Enable
  #define QEI_INTEN_INDEX         0x00000001  // Index Pulse Detected Interrupt
                                              // Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_RIS register.
  //
  //*****************************************************************************
  #define QEI_RIS_ERROR           0x00000008  // Phase Error Detected
  #define QEI_RIS_DIR             0x00000004  // Direction Change Detected
  #define QEI_RIS_TIMER           0x00000002  // Velocity Timer Expired
  #define QEI_RIS_INDEX           0x00000001  // Index Pulse Asserted

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the QEI_O_ISC register.
  //
  //*****************************************************************************
  #define QEI_ISC_ERROR           0x00000008  // Phase Error Interrupt
  #define QEI_ISC_DIR             0x00000004  // Direction Change Interrupt
  #define QEI_ISC_TIMER           0x00000002  // Velocity Timer Expired Interrupt
  #define QEI_ISC_INDEX           0x00000001  // Index Pulse Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_CFG register.
  //
  //*****************************************************************************
  #define TIMER_CFG_M             0x00000007  // GPTM Configuration
  #define TIMER_CFG_32_BIT_TIMER  0x00000000  // 32-bit timer configuration
  #define TIMER_CFG_32_BIT_RTC    0x00000001  // 32-bit real-time clock (RTC)
                                              // counter configuration
  #define TIMER_CFG_16_BIT        0x00000004  // 16-bit timer configuration. The
                                              // function is controlled by bits
                                              // 1:0 of GPTMTAMR and GPTMTBMR

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAMR register.
  //
  //*****************************************************************************
  #define TIMER_TAMR_TAPLO        0x00000800  // GPTM Timer A PWM Legacy
                                              // Operation
  #define TIMER_TAMR_TAMRSU       0x00000400  // GPTM Timer A Match Register
                                              // Update
  #define TIMER_TAMR_TAPWMIE      0x00000200  // GPTM Timer A PWM Interrupt
                                              // Enable
  #define TIMER_TAMR_TAILD        0x00000100  // GPTM Timer A Interval Load Write
  #define TIMER_TAMR_TASNAPS      0x00000080  // GPTM Timer A Snap-Shot Mode
  #define TIMER_TAMR_TAWOT        0x00000040  // GPTM Timer A Wait-on-Trigger
  #define TIMER_TAMR_TAMIE        0x00000020  // GPTM Timer A Match Interrupt
                                              // Enable
  #define TIMER_TAMR_TACDIR       0x00000010  // GPTM Timer A Count Direction
  #define TIMER_TAMR_TAAMS        0x00000008  // GPTM Timer A Alternate Mode
                                              // Select
  #define TIMER_TAMR_TACMR        0x00000004  // GPTM Timer A Capture Mode
  #define TIMER_TAMR_TAMR_M       0x00000003  // GPTM Timer A Mode
  #define TIMER_TAMR_TAMR_1_SHOT  0x00000001  // One-Shot Timer mode
  #define TIMER_TAMR_TAMR_PERIOD  0x00000002  // Periodic Timer mode
  #define TIMER_TAMR_TAMR_CAP     0x00000003  // Capture mode

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBMR register.
  //
  //*****************************************************************************
  #define TIMER_TBMR_TBPLO        0x00000800  // GPTM Timer B PWM Legacy
                                              // Operation
  #define TIMER_TBMR_TBMRSU       0x00000400  // GPTM Timer B Match Register
                                              // Update
  #define TIMER_TBMR_TBPWMIE      0x00000200  // GPTM Timer B PWM Interrupt
                                              // Enable
  #define TIMER_TBMR_TBILD        0x00000100  // GPTM Timer B Interval Load Write
  #define TIMER_TBMR_TBSNAPS      0x00000080  // GPTM Timer B Snap-Shot Mode
  #define TIMER_TBMR_TBWOT        0x00000040  // GPTM Timer B Wait-on-Trigger
  #define TIMER_TBMR_TBMIE        0x00000020  // GPTM Timer B Match Interrupt
                                              // Enable
  #define TIMER_TBMR_TBCDIR       0x00000010  // GPTM Timer B Count Direction
  #define TIMER_TBMR_TBAMS        0x00000008  // GPTM Timer B Alternate Mode
                                              // Select
  #define TIMER_TBMR_TBCMR        0x00000004  // GPTM Timer B Capture Mode
  #define TIMER_TBMR_TBMR_M       0x00000003  // GPTM Timer B Mode
  #define TIMER_TBMR_TBMR_1_SHOT  0x00000001  // One-Shot Timer mode
  #define TIMER_TBMR_TBMR_PERIOD  0x00000002  // Periodic Timer mode
  #define TIMER_TBMR_TBMR_CAP     0x00000003  // Capture mode

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_CTL register.
  //
  //*****************************************************************************
  #define TIMER_CTL_TBPWML        0x00004000  // GPTM Timer B PWM Output Level
  #define TIMER_CTL_TBOTE         0x00002000  // GPTM Timer B Output Trigger
                                              // Enable
  #define TIMER_CTL_TBEVENT_M     0x00000C00  // GPTM Timer B Event Mode
  #define TIMER_CTL_TBEVENT_POS   0x00000000  // Positive edge
  #define TIMER_CTL_TBEVENT_NEG   0x00000400  // Negative edge
  #define TIMER_CTL_TBEVENT_BOTH  0x00000C00  // Both edges
  #define TIMER_CTL_TBSTALL       0x00000200  // GPTM Timer B Stall Enable
  #define TIMER_CTL_TBEN          0x00000100  // GPTM Timer B Enable
  #define TIMER_CTL_TAPWML        0x00000040  // GPTM Timer A PWM Output Level
  #define TIMER_CTL_TAOTE         0x00000020  // GPTM Timer A Output Trigger
                                              // Enable
  #define TIMER_CTL_RTCEN         0x00000010  // GPTM RTC Stall Enable
  #define TIMER_CTL_TAEVENT_M     0x0000000C  // GPTM Timer A Event Mode
  #define TIMER_CTL_TAEVENT_POS   0x00000000  // Positive edge
  #define TIMER_CTL_TAEVENT_NEG   0x00000004  // Negative edge
  #define TIMER_CTL_TAEVENT_BOTH  0x0000000C  // Both edges
  #define TIMER_CTL_TASTALL       0x00000002  // GPTM Timer A Stall Enable
  #define TIMER_CTL_TAEN          0x00000001  // GPTM Timer A Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_SYNC register.
  //
  //*****************************************************************************
  #define TIMER_SYNC_SYNCWT5_M    0x00C00000  // Synchronize GPTM 32/64-Bit Timer
                                              // 5
  #define TIMER_SYNC_SYNCWT5_NONE 0x00000000  // GPTM 32/64-Bit Timer 5 is not
                                              // affected
  #define TIMER_SYNC_SYNCWT5_TA   0x00400000  // A timeout event for Timer A of
                                              // GPTM 32/64-Bit Timer 5 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT5_TB   0x00800000  // A timeout event for Timer B of
                                              // GPTM 32/64-Bit Timer 5 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT5_TATB 0x00C00000  // A timeout event for both Timer A
                                              // and Timer B of GPTM 32/64-Bit
                                              // Timer 5 is triggered
  #define TIMER_SYNC_SYNCWT4_M    0x00300000  // Synchronize GPTM 32/64-Bit Timer
                                              // 4
  #define TIMER_SYNC_SYNCWT4_NONE 0x00000000  // GPTM 32/64-Bit Timer 4 is not
                                              // affected
  #define TIMER_SYNC_SYNCWT4_TA   0x00100000  // A timeout event for Timer A of
                                              // GPTM 32/64-Bit Timer 4 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT4_TB   0x00200000  // A timeout event for Timer B of
                                              // GPTM 32/64-Bit Timer 4 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT4_TATB 0x00300000  // A timeout event for both Timer A
                                              // and Timer B of GPTM 32/64-Bit
                                              // Timer 4 is triggered
  #define TIMER_SYNC_SYNCWT3_M    0x000C0000  // Synchronize GPTM 32/64-Bit Timer
                                              // 3
  #define TIMER_SYNC_SYNCWT3_NONE 0x00000000  // GPTM 32/64-Bit Timer 3 is not
                                              // affected
  #define TIMER_SYNC_SYNCWT3_TA   0x00040000  // A timeout event for Timer A of
                                              // GPTM 32/64-Bit Timer 3 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT3_TB   0x00080000  // A timeout event for Timer B of
                                              // GPTM 32/64-Bit Timer 3 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT3_TATB 0x000C0000  // A timeout event for both Timer A
                                              // and Timer B of GPTM 32/64-Bit
                                              // Timer 3 is triggered
  #define TIMER_SYNC_SYNCWT2_M    0x00030000  // Synchronize GPTM 32/64-Bit Timer
                                              // 2
  #define TIMER_SYNC_SYNCWT2_NONE 0x00000000  // GPTM 32/64-Bit Timer 2 is not
                                              // affected
  #define TIMER_SYNC_SYNCWT2_TA   0x00010000  // A timeout event for Timer A of
                                              // GPTM 32/64-Bit Timer 2 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT2_TB   0x00020000  // A timeout event for Timer B of
                                              // GPTM 32/64-Bit Timer 2 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT2_TATB 0x00030000  // A timeout event for both Timer A
                                              // and Timer B of GPTM 32/64-Bit
                                              // Timer 2 is triggered
  #define TIMER_SYNC_SYNCWT1_M    0x0000C000  // Synchronize GPTM 32/64-Bit Timer
                                              // 1
  #define TIMER_SYNC_SYNCWT1_NONE 0x00000000  // GPTM 32/64-Bit Timer 1 is not
                                              // affected
  #define TIMER_SYNC_SYNCWT1_TA   0x00004000  // A timeout event for Timer A of
                                              // GPTM 32/64-Bit Timer 1 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT1_TB   0x00008000  // A timeout event for Timer B of
                                              // GPTM 32/64-Bit Timer 1 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT1_TATB 0x0000C000  // A timeout event for both Timer A
                                              // and Timer B of GPTM 32/64-Bit
                                              // Timer 1 is triggered
  #define TIMER_SYNC_SYNCWT0_M    0x00003000  // Synchronize GPTM 32/64-Bit Timer
                                              // 0
  #define TIMER_SYNC_SYNCWT0_NONE 0x00000000  // GPTM 32/64-Bit Timer 0 is not
                                              // affected
  #define TIMER_SYNC_SYNCWT0_TA   0x00001000  // A timeout event for Timer A of
                                              // GPTM 32/64-Bit Timer 0 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT0_TB   0x00002000  // A timeout event for Timer B of
                                              // GPTM 32/64-Bit Timer 0 is
                                              // triggered
  #define TIMER_SYNC_SYNCWT0_TATB 0x00003000  // A timeout event for both Timer A
                                              // and Timer B of GPTM 32/64-Bit
                                              // Timer 0 is triggered
  #define TIMER_SYNC_SYNCT5_M     0x00000C00  // Synchronize GPTM 16/32-Bit Timer
                                              // 5
  #define TIMER_SYNC_SYNCT5_NONE  0x00000000  // GPTM 16/32-Bit Timer 5 is not
                                              // affected
  #define TIMER_SYNC_SYNCT5_TA    0x00000400  // A timeout event for Timer A of
                                              // GPTM 16/32-Bit Timer 5 is
                                              // triggered
  #define TIMER_SYNC_SYNCT5_TB    0x00000800  // A timeout event for Timer B of
                                              // GPTM 16/32-Bit Timer 5 is
                                              // triggered
  #define TIMER_SYNC_SYNCT5_TATB  0x00000C00  // A timeout event for both Timer A
                                              // and Timer B of GPTM 16/32-Bit
                                              // Timer 5 is triggered
  #define TIMER_SYNC_SYNCT4_M     0x00000300  // Synchronize GPTM 16/32-Bit Timer
                                              // 4
  #define TIMER_SYNC_SYNCT4_NONE  0x00000000  // GPTM 16/32-Bit Timer 4 is not
                                              // affected
  #define TIMER_SYNC_SYNCT4_TA    0x00000100  // A timeout event for Timer A of
                                              // GPTM 16/32-Bit Timer 4 is
                                              // triggered
  #define TIMER_SYNC_SYNCT4_TB    0x00000200  // A timeout event for Timer B of
                                              // GPTM 16/32-Bit Timer 4 is
                                              // triggered
  #define TIMER_SYNC_SYNCT4_TATB  0x00000300  // A timeout event for both Timer A
                                              // and Timer B of GPTM 16/32-Bit
                                              // Timer 4 is triggered
  #define TIMER_SYNC_SYNCT3_M     0x000000C0  // Synchronize GPTM 16/32-Bit Timer
                                              // 3
  #define TIMER_SYNC_SYNCT3_NONE  0x00000000  // GPTM 16/32-Bit Timer 3 is not
                                              // affected
  #define TIMER_SYNC_SYNCT3_TA    0x00000040  // A timeout event for Timer A of
                                              // GPTM 16/32-Bit Timer 3 is
                                              // triggered
  #define TIMER_SYNC_SYNCT3_TB    0x00000080  // A timeout event for Timer B of
                                              // GPTM 16/32-Bit Timer 3 is
                                              // triggered
  #define TIMER_SYNC_SYNCT3_TATB  0x000000C0  // A timeout event for both Timer A
                                              // and Timer B of GPTM 16/32-Bit
                                              // Timer 3 is triggered
  #define TIMER_SYNC_SYNCT2_M     0x00000030  // Synchronize GPTM 16/32-Bit Timer
                                              // 2
  #define TIMER_SYNC_SYNCT2_NONE  0x00000000  // GPTM 16/32-Bit Timer 2 is not
                                              // affected
  #define TIMER_SYNC_SYNCT2_TA    0x00000010  // A timeout event for Timer A of
                                              // GPTM 16/32-Bit Timer 2 is
                                              // triggered
  #define TIMER_SYNC_SYNCT2_TB    0x00000020  // A timeout event for Timer B of
                                              // GPTM 16/32-Bit Timer 2 is
                                              // triggered
  #define TIMER_SYNC_SYNCT2_TATB  0x00000030  // A timeout event for both Timer A
                                              // and Timer B of GPTM 16/32-Bit
                                              // Timer 2 is triggered
  #define TIMER_SYNC_SYNCT1_M     0x0000000C  // Synchronize GPTM 16/32-Bit Timer
                                              // 1
  #define TIMER_SYNC_SYNCT1_NONE  0x00000000  // GPTM 16/32-Bit Timer 1 is not
                                              // affected
  #define TIMER_SYNC_SYNCT1_TA    0x00000004  // A timeout event for Timer A of
                                              // GPTM 16/32-Bit Timer 1 is
                                              // triggered
  #define TIMER_SYNC_SYNCT1_TB    0x00000008  // A timeout event for Timer B of
                                              // GPTM 16/32-Bit Timer 1 is
                                              // triggered
  #define TIMER_SYNC_SYNCT1_TATB  0x0000000C  // A timeout event for both Timer A
                                              // and Timer B of GPTM 16/32-Bit
                                              // Timer 1 is triggered
  #define TIMER_SYNC_SYNCT0_M     0x00000003  // Synchronize GPTM 16/32-Bit Timer
                                              // 0
  #define TIMER_SYNC_SYNCT0_NONE  0x00000000  // GPTM 16/32-Bit Timer 0 is not
                                              // affected
  #define TIMER_SYNC_SYNCT0_TA    0x00000001  // A timeout event for Timer A of
                                              // GPTM 16/32-Bit Timer 0 is
                                              // triggered
  #define TIMER_SYNC_SYNCT0_TB    0x00000002  // A timeout event for Timer B of
                                              // GPTM 16/32-Bit Timer 0 is
                                              // triggered
  #define TIMER_SYNC_SYNCT0_TATB  0x00000003  // A timeout event for both Timer A
                                              // and Timer B of GPTM 16/32-Bit
                                              // Timer 0 is triggered

