imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_IMR register.
  //
  //*****************************************************************************
  #define TIMER_IMR_WUEIM         0x00010000  // GPTM Write Update Error
                                              // Interrupt Mask
  #define TIMER_IMR_TBMIM         0x00000800  // GPTM Timer B Match Interrupt
                                              // Mask
  #define TIMER_IMR_CBEIM         0x00000400  // GPTM Timer B Capture Mode Event
                                              // Interrupt Mask
  #define TIMER_IMR_CBMIM         0x00000200  // GPTM Timer B Capture Mode Match
                                              // Interrupt Mask
  #define TIMER_IMR_TBTOIM        0x00000100  // GPTM Timer B Time-Out Interrupt
                                              // Mask
  #define TIMER_IMR_TAMIM         0x00000010  // GPTM Timer A Match Interrupt
                                              // Mask
  #define TIMER_IMR_RTCIM         0x00000008  // GPTM RTC Interrupt Mask
  #define TIMER_IMR_CAEIM         0x00000004  // GPTM Timer A Capture Mode Event
                                              // Interrupt Mask
  #define TIMER_IMR_CAMIM         0x00000002  // GPTM Timer A Capture Mode Match
                                              // Interrupt Mask
  #define TIMER_IMR_TATOIM        0x00000001  // GPTM Timer A Time-Out Interrupt
                                              // Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_RIS register.
  //
  //*****************************************************************************
  #define TIMER_RIS_WUERIS        0x00010000  // GPTM Write Update Error Raw
                                              // Interrupt
  #define TIMER_RIS_TBMRIS        0x00000800  // GPTM Timer B Match Raw Interrupt
  #define TIMER_RIS_CBERIS        0x00000400  // GPTM Timer B Capture Mode Event
                                              // Raw Interrupt
  #define TIMER_RIS_CBMRIS        0x00000200  // GPTM Timer B Capture Mode Match
                                              // Raw Interrupt
  #define TIMER_RIS_TBTORIS       0x00000100  // GPTM Timer B Time-Out Raw
                                              // Interrupt
  #define TIMER_RIS_TAMRIS        0x00000010  // GPTM Timer A Match Raw Interrupt
  #define TIMER_RIS_RTCRIS        0x00000008  // GPTM RTC Raw Interrupt
  #define TIMER_RIS_CAERIS        0x00000004  // GPTM Timer A Capture Mode Event
                                              // Raw Interrupt
  #define TIMER_RIS_CAMRIS        0x00000002  // GPTM Timer A Capture Mode Match
                                              // Raw Interrupt
  #define TIMER_RIS_TATORIS       0x00000001  // GPTM Timer A Time-Out Raw
                                              // Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_MIS register.
  //
  //*****************************************************************************
  #define TIMER_MIS_WUEMIS        0x00010000  // GPTM Write Update Error Masked
                                              // Interrupt
  #define TIMER_MIS_TBMMIS        0x00000800  // GPTM Timer B Match Masked
                                              // Interrupt
  #define TIMER_MIS_CBEMIS        0x00000400  // GPTM Timer B Capture Mode Event
                                              // Masked Interrupt
  #define TIMER_MIS_CBMMIS        0x00000200  // GPTM Timer B Capture Mode Match
                                              // Masked Interrupt
  #define TIMER_MIS_TBTOMIS       0x00000100  // GPTM Timer B Time-Out Masked
                                              // Interrupt
  #define TIMER_MIS_TAMMIS        0x00000010  // GPTM Timer A Match Masked
                                              // Interrupt
  #define TIMER_MIS_RTCMIS        0x00000008  // GPTM RTC Masked Interrupt
  #define TIMER_MIS_CAEMIS        0x00000004  // GPTM Timer A Capture Mode Event
                                              // Masked Interrupt
  #define TIMER_MIS_CAMMIS        0x00000002  // GPTM Timer A Capture Mode Match
                                              // Masked Interrupt
  #define TIMER_MIS_TATOMIS       0x00000001  // GPTM Timer A Time-Out Masked
                                              // Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_ICR register.
  //
  //*****************************************************************************
  #define TIMER_ICR_WUECINT       0x00010000  // 32/64-Bit GPTM Write Update
                                              // Error Interrupt Clear
  #define TIMER_ICR_TBMCINT       0x00000800  // GPTM Timer B Match Interrupt
                                              // Clear
  #define TIMER_ICR_CBECINT       0x00000400  // GPTM Timer B Capture Mode Event
                                              // Interrupt Clear
  #define TIMER_ICR_CBMCINT       0x00000200  // GPTM Timer B Capture Mode Match
                                              // Interrupt Clear
  #define TIMER_ICR_TBTOCINT      0x00000100  // GPTM Timer B Time-Out Interrupt
                                              // Clear
  #define TIMER_ICR_TAMCINT       0x00000010  // GPTM Timer A Match Interrupt
                                              // Clear
  #define TIMER_ICR_RTCCINT       0x00000008  // GPTM RTC Interrupt Clear
  #define TIMER_ICR_CAECINT       0x00000004  // GPTM Timer A Capture Mode Event
                                              // Interrupt Clear
  #define TIMER_ICR_CAMCINT       0x00000002  // GPTM Timer A Capture Mode Match
                                              // Interrupt Clear
  #define TIMER_ICR_TATOCINT      0x00000001  // GPTM Timer A Time-Out Raw
                                              // Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAILR register.
  //
  //*****************************************************************************
  #define TIMER_TAILR_M           0xFFFFFFFF  // GPTM Timer A Interval Load
                                              // Register
  #define TIMER_TAILR_S           0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBILR register.
  //
  //*****************************************************************************
  #define TIMER_TBILR_M           0xFFFFFFFF  // GPTM Timer B Interval Load
                                              // Register
  #define TIMER_TBILR_S           0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAMATCHR
  // register.
  //
  //*****************************************************************************
  #define TIMER_TAMATCHR_TAMR_M   0xFFFFFFFF  // GPTM Timer A Match Register
  #define TIMER_TAMATCHR_TAMR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBMATCHR
  // register.
  //
  //*****************************************************************************
  #define TIMER_TBMATCHR_TBMR_M   0xFFFFFFFF  // GPTM Timer B Match Register
  #define TIMER_TBMATCHR_TBMR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAPR register.
  //
  //*****************************************************************************
  #define TIMER_TAPR_TAPSRH_M     0x0000FF00  // GPTM Timer A Prescale High Byte
  #define TIMER_TAPR_TAPSR_M      0x000000FF  // GPTM Timer A Prescale
  #define TIMER_TAPR_TAPSRH_S     8
  #define TIMER_TAPR_TAPSR_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBPR register.
  //
  //*****************************************************************************
  #define TIMER_TBPR_TBPSRH_M     0x0000FF00  // GPTM Timer B Prescale High Byte
  #define TIMER_TBPR_TBPSR_M      0x000000FF  // GPTM Timer B Prescale
  #define TIMER_TBPR_TBPSRH_S     8
  #define TIMER_TBPR_TBPSR_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAPMR register.
  //
  //*****************************************************************************
  #define TIMER_TAPMR_TAPSMRH_M   0x0000FF00  // GPTM Timer A Prescale Match High
                                              // Byte
  #define TIMER_TAPMR_TAPSMR_M    0x000000FF  // GPTM TimerA Prescale Match
  #define TIMER_TAPMR_TAPSMRH_S   8
  #define TIMER_TAPMR_TAPSMR_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBPMR register.
  //
  //*****************************************************************************
  #define TIMER_TBPMR_TBPSMRH_M   0x0000FF00  // GPTM Timer B Prescale Match High
                                              // Byte
  #define TIMER_TBPMR_TBPSMR_M    0x000000FF  // GPTM TimerB Prescale Match
  #define TIMER_TBPMR_TBPSMRH_S   8
  #define TIMER_TBPMR_TBPSMR_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAR register.
  //
  //*****************************************************************************
  #define TIMER_TAR_M             0xFFFFFFFF  // GPTM Timer A Register
  #define TIMER_TAR_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBR register.
  //
  //*****************************************************************************
  #define TIMER_TBR_M             0xFFFFFFFF  // GPTM Timer B Register
  #define TIMER_TBR_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAV register.
  //
  //*****************************************************************************
  #define TIMER_TAV_M             0xFFFFFFFF  // GPTM Timer A Value
  #define TIMER_TAV_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBV register.
  //
  //*****************************************************************************
  #define TIMER_TBV_M             0xFFFFFFFF  // GPTM Timer B Value
  #define TIMER_TBV_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_RTCPD register.
  //
  //*****************************************************************************
  #define TIMER_RTCPD_RTCPD_M     0x0000FFFF  // RTC Predivide Counter Value
  #define TIMER_RTCPD_RTCPD_S     0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAPS register.
  //
  //*****************************************************************************
  #define TIMER_TAPS_PSS_M        0x0000FFFF  // GPTM Timer A Prescaler Snapshot
  #define TIMER_TAPS_PSS_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBPS register.
  //
  //*****************************************************************************
  #define TIMER_TBPS_PSS_M        0x0000FFFF  // GPTM Timer A Prescaler Value
  #define TIMER_TBPS_PSS_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TAPV register.
  //
  //*****************************************************************************
  #define TIMER_TAPV_PSV_M        0x0000FFFF  // GPTM Timer A Prescaler Value
  #define TIMER_TAPV_PSV_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_TBPV register.
  //
  //*****************************************************************************
  #define TIMER_TBPV_PSV_M        0x0000FFFF  // GPTM Timer B Prescaler Value
  #define TIMER_TBPV_PSV_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the TIMER_O_PP register.
  //
  //*****************************************************************************
  #define TIMER_PP_SIZE_M         0x0000000F  // Count Size
  #define TIMER_PP_SIZE_16        0x00000000  // Timer A and Timer B counters are
                                              // 16 bits each with an 8-bit
                                              // prescale counter
  #define TIMER_PP_SIZE_32        0x00000001  // Timer A and Timer B counters are
                                              // 32 bits each with a 16-bit
                                              // prescale counter

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_ACTSS register.
  //
  //*****************************************************************************
  #define ADC_ACTSS_BUSY          0x00010000  // ADC Busy
  #define ADC_ACTSS_ASEN3         0x00000008  // ADC SS3 Enable
  #define ADC_ACTSS_ASEN2         0x00000004  // ADC SS2 Enable
  #define ADC_ACTSS_ASEN1         0x00000002  // ADC SS1 Enable
  #define ADC_ACTSS_ASEN0         0x00000001  // ADC SS0 Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_RIS register.
  //
  //*****************************************************************************
  #define ADC_RIS_INRDC           0x00010000  // Digital Comparator Raw Interrupt
                                              // Status
  #define ADC_RIS_INR3            0x00000008  // SS3 Raw Interrupt Status
  #define ADC_RIS_INR2            0x00000004  // SS2 Raw Interrupt Status
  #define ADC_RIS_INR1            0x00000002  // SS1 Raw Interrupt Status
  #define ADC_RIS_INR0            0x00000001  // SS0 Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_IM register.
  //
  //*****************************************************************************
  #define ADC_IM_DCONSS3          0x00080000  // Digital Comparator Interrupt on
                                              // SS3
  #define ADC_IM_DCONSS2          0x00040000  // Digital Comparator Interrupt on
                                              // SS2
  #define ADC_IM_DCONSS1          0x00020000  // Digital Comparator Interrupt on
                                              // SS1
  #define ADC_IM_DCONSS0          0x00010000  // Digital Comparator Interrupt on
                                              // SS0
  #define ADC_IM_MASK3            0x00000008  // SS3 Interrupt Mask
  #define ADC_IM_MASK2            0x00000004  // SS2 Interrupt Mask
  #define ADC_IM_MASK1            0x00000002  // SS1 Interrupt Mask
  #define ADC_IM_MASK0            0x00000001  // SS0 Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_ISC register.
  //
  //*****************************************************************************
  #define ADC_ISC_DCINSS3         0x00080000  // Digital Comparator Interrupt
                                              // Status on SS3
  #define ADC_ISC_DCINSS2         0x00040000  // Digital Comparator Interrupt
                                              // Status on SS2
  #define ADC_ISC_DCINSS1         0x00020000  // Digital Comparator Interrupt
                                              // Status on SS1
  #define ADC_ISC_DCINSS0         0x00010000  // Digital Comparator Interrupt
                                              // Status on SS0
  #define ADC_ISC_IN3             0x00000008  // SS3 Interrupt Status and Clear
  #define ADC_ISC_IN2             0x00000004  // SS2 Interrupt Status and Clear
  #define ADC_ISC_IN1             0x00000002  // SS1 Interrupt Status and Clear
  #define ADC_ISC_IN0             0x00000001  // SS0 Interrupt Status and Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_OSTAT register.
  //
  //*****************************************************************************
  #define ADC_OSTAT_OV3           0x00000008  // SS3 FIFO Overflow
  #define ADC_OSTAT_OV2           0x00000004  // SS2 FIFO Overflow
  #define ADC_OSTAT_OV1           0x00000002  // SS1 FIFO Overflow
  #define ADC_OSTAT_OV0           0x00000001  // SS0 FIFO Overflow

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_EMUX register.
  //
  //*****************************************************************************
  #define ADC_EMUX_EM3_M          0x0000F000  // SS3 Trigger Select
  #define ADC_EMUX_EM3_PROCESSOR  0x00000000  // Processor (default)
  #define ADC_EMUX_EM3_COMP0      0x00001000  // Analog Comparator 0
  #define ADC_EMUX_EM3_COMP1      0x00002000  // Analog Comparator 1
  #define ADC_EMUX_EM3_EXTERNAL   0x00004000  // External (GPIO PB4)
  #define ADC_EMUX_EM3_TIMER      0x00005000  // Timer
  #define ADC_EMUX_EM3_PWM0       0x00006000  // PWM0
  #define ADC_EMUX_EM3_PWM1       0x00007000  // PWM1
  #define ADC_EMUX_EM3_PWM2       0x00008000  // PWM2
  #define ADC_EMUX_EM3_PWM3       0x00009000  // PWM3
  #define ADC_EMUX_EM3_ALWAYS     0x0000F000  // Always (continuously sample)
  #define ADC_EMUX_EM2_M          0x00000F00  // SS2 Trigger Select
  #define ADC_EMUX_EM2_PROCESSOR  0x00000000  // Processor (default)
  #define ADC_EMUX_EM2_COMP0      0x00000100  // Analog Comparator 0
  #define ADC_EMUX_EM2_COMP1      0x00000200  // Analog Comparator 1
  #define ADC_EMUX_EM2_EXTERNAL   0x00000400  // External (GPIO PB4)
  #define ADC_EMUX_EM2_TIMER      0x00000500  // Timer
  #define ADC_EMUX_EM2_PWM0       0x00000600  // PWM0
  #define ADC_EMUX_EM2_PWM1       0x00000700  // PWM1
  #define ADC_EMUX_EM2_PWM2       0x00000800  // PWM2
  #define ADC_EMUX_EM2_PWM3       0x00000900  // PWM3
  #define ADC_EMUX_EM2_ALWAYS     0x00000F00  // Always (continuously sample)
  #define ADC_EMUX_EM1_M          0x000000F0  // SS1 Trigger Select
  #define ADC_EMUX_EM1_PROCESSOR  0x00000000  // Processor (default)
  #define ADC_EMUX_EM1_COMP0      0x00000010  // Analog Comparator 0
  #define ADC_EMUX_EM1_COMP1      0x00000020  // Analog Comparator 1
  #define ADC_EMUX_EM1_EXTERNAL   0x00000040  // External (GPIO PB4)
  #define ADC_EMUX_EM1_TIMER      0x00000050  // Timer
  #define ADC_EMUX_EM1_PWM0       0x00000060  // PWM0
  #define ADC_EMUX_EM1_PWM1       0x00000070  // PWM1
  #define ADC_EMUX_EM1_PWM2       0x00000080  // PWM2
  #define ADC_EMUX_EM1_PWM3       0x00000090  // PWM3
  #define ADC_EMUX_EM1_ALWAYS     0x000000F0  // Always (continuously sample)
  #define ADC_EMUX_EM0_M          0x0000000F  // SS0 Trigger Select
  #define ADC_EMUX_EM0_PROCESSOR  0x00000000  // Processor (default)
  #define ADC_EMUX_EM0_COMP0      0x00000001  // Analog Comparator 0
  #define ADC_EMUX_EM0_COMP1      0x00000002  // Analog Comparator 1
  #define ADC_EMUX_EM0_EXTERNAL   0x00000004  // External (GPIO PB4)
  #define ADC_EMUX_EM0_TIMER      0x00000005  // Timer
  #define ADC_EMUX_EM0_PWM0       0x00000006  // PWM0
  #define ADC_EMUX_EM0_PWM1       0x00000007  // PWM1
  #define ADC_EMUX_EM0_PWM2       0x00000008  // PWM2
  #define ADC_EMUX_EM0_PWM3       0x00000009  // PWM3
  #define ADC_EMUX_EM0_ALWAYS     0x0000000F  // Always (continuously sample)

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_USTAT register.
  //
  //*****************************************************************************
  #define ADC_USTAT_UV3           0x00000008  // SS3 FIFO Underflow
  #define ADC_USTAT_UV2           0x00000004  // SS2 FIFO Underflow
  #define ADC_USTAT_UV1           0x00000002  // SS1 FIFO Underflow
  #define ADC_USTAT_UV0           0x00000001  // SS0 FIFO Underflow

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_TSSEL register.
  //
  //*****************************************************************************
  #define ADC_TSSEL_PS3_M         0x30000000  // PWM Unit Select
  #define ADC_TSSEL_PS3_0         0x00000000  // PWM Unit 0
  #define ADC_TSSEL_PS3_1         0x10000000  // PWM Unit 1
  #define ADC_TSSEL_PS2_M         0x00300000  // PWM Unit Select
  #define ADC_TSSEL_PS2_0         0x00000000  // PWM Unit 0
  #define ADC_TSSEL_PS2_1         0x00100000  // PWM Unit 1
  #define ADC_TSSEL_PS1_M         0x00003000  // PWM Unit Select
  #define ADC_TSSEL_PS1_0         0x00000000  // PWM Unit 0
  #define ADC_TSSEL_PS1_1         0x00001000  // PWM Unit 1
  #define ADC_TSSEL_PS0_M         0x00000030  // PWM Unit Select
  #define ADC_TSSEL_PS0_0         0x00000000  // PWM Unit 0
  #define ADC_TSSEL_PS0_1         0x00000010  // PWM Unit 1

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_SSPRI register.
  //
  //*****************************************************************************
  #define ADC_SSPRI_SS3_M         0x00003000  // SS3 Priority
  #define ADC_SSPRI_SS2_M         0x00000300  // SS2 Priority
  #define ADC_SSPRI_SS1_M         0x00000030  // SS1 Priority
  #define ADC_SSPRI_SS0_M         0x00000003  // SS0 Priority

