imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_SSFSTAT3 register.
  //
  //*****************************************************************************
  #define ADC_SSFSTAT3_FULL       0x00001000  // FIFO Full
  #define ADC_SSFSTAT3_EMPTY      0x00000100  // FIFO Empty
  #define ADC_SSFSTAT3_HPTR_M     0x000000F0  // FIFO Head Pointer
  #define ADC_SSFSTAT3_TPTR_M     0x0000000F  // FIFO Tail Pointer
  #define ADC_SSFSTAT3_HPTR_S     4
  #define ADC_SSFSTAT3_TPTR_S     0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_SSOP3 register.
  //
  //*****************************************************************************
  #define ADC_SSOP3_S0DCOP        0x00000001  // Sample 0 Digital Comparator
                                              // Operation

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_SSDC3 register.
  //
  //*****************************************************************************
  #define ADC_SSDC3_S0DCSEL_M     0x0000000F  // Sample 0 Digital Comparator
                                              // Select

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCRIC register.
  //
  //*****************************************************************************
  #define ADC_DCRIC_DCTRIG7       0x00800000  // Digital Comparator Trigger 7
  #define ADC_DCRIC_DCTRIG6       0x00400000  // Digital Comparator Trigger 6
  #define ADC_DCRIC_DCTRIG5       0x00200000  // Digital Comparator Trigger 5
  #define ADC_DCRIC_DCTRIG4       0x00100000  // Digital Comparator Trigger 4
  #define ADC_DCRIC_DCTRIG3       0x00080000  // Digital Comparator Trigger 3
  #define ADC_DCRIC_DCTRIG2       0x00040000  // Digital Comparator Trigger 2
  #define ADC_DCRIC_DCTRIG1       0x00020000  // Digital Comparator Trigger 1
  #define ADC_DCRIC_DCTRIG0       0x00010000  // Digital Comparator Trigger 0
  #define ADC_DCRIC_DCINT7        0x00000080  // Digital Comparator Interrupt 7
  #define ADC_DCRIC_DCINT6        0x00000040  // Digital Comparator Interrupt 6
  #define ADC_DCRIC_DCINT5        0x00000020  // Digital Comparator Interrupt 5
  #define ADC_DCRIC_DCINT4        0x00000010  // Digital Comparator Interrupt 4
  #define ADC_DCRIC_DCINT3        0x00000008  // Digital Comparator Interrupt 3
  #define ADC_DCRIC_DCINT2        0x00000004  // Digital Comparator Interrupt 2
  #define ADC_DCRIC_DCINT1        0x00000002  // Digital Comparator Interrupt 1
  #define ADC_DCRIC_DCINT0        0x00000001  // Digital Comparator Interrupt 0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL0 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL0_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL0_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL0_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL0_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL0_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL0_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL0_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL0_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL0_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL0_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL0_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL0_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL0_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL0_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL0_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL0_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL0_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL0_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL0_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL0_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL1 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL1_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL1_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL1_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL1_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL1_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL1_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL1_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL1_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL1_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL1_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL1_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL1_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL1_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL1_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL1_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL1_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL1_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL1_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL1_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL1_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL2 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL2_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL2_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL2_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL2_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL2_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL2_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL2_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL2_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL2_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL2_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL2_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL2_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL2_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL2_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL2_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL2_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL2_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL2_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL2_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL2_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL3 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL3_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL3_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL3_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL3_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL3_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL3_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL3_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL3_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL3_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL3_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL3_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL3_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL3_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL3_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL3_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL3_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL3_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL3_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL3_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL3_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL4 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL4_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL4_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL4_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL4_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL4_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL4_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL4_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL4_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL4_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL4_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL4_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL4_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL4_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL4_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL4_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL4_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL4_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL4_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL4_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL4_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL5 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL5_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL5_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL5_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL5_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL5_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL5_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL5_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL5_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL5_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL5_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL5_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL5_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL5_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL5_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL5_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL5_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL5_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL5_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL5_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL5_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL6 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL6_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL6_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL6_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL6_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL6_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL6_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL6_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL6_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL6_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL6_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL6_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL6_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL6_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL6_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL6_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL6_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL6_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL6_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL6_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL6_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCTL7 register.
  //
  //*****************************************************************************
  #define ADC_DCCTL7_CTE          0x00001000  // Comparison Trigger Enable
  #define ADC_DCCTL7_CTC_M        0x00000C00  // Comparison Trigger Condition
  #define ADC_DCCTL7_CTC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL7_CTC_MID      0x00000400  // Mid Band
  #define ADC_DCCTL7_CTC_HIGH     0x00000C00  // High Band
  #define ADC_DCCTL7_CTM_M        0x00000300  // Comparison Trigger Mode
  #define ADC_DCCTL7_CTM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL7_CTM_ONCE     0x00000100  // Once
  #define ADC_DCCTL7_CTM_HALWAYS  0x00000200  // Hysteresis Always
  #define ADC_DCCTL7_CTM_HONCE    0x00000300  // Hysteresis Once
  #define ADC_DCCTL7_CIE          0x00000010  // Comparison Interrupt Enable
  #define ADC_DCCTL7_CIC_M        0x0000000C  // Comparison Interrupt Condition
  #define ADC_DCCTL7_CIC_LOW      0x00000000  // Low Band
  #define ADC_DCCTL7_CIC_MID      0x00000004  // Mid Band
  #define ADC_DCCTL7_CIC_HIGH     0x0000000C  // High Band
  #define ADC_DCCTL7_CIM_M        0x00000003  // Comparison Interrupt Mode
  #define ADC_DCCTL7_CIM_ALWAYS   0x00000000  // Always
  #define ADC_DCCTL7_CIM_ONCE     0x00000001  // Once
  #define ADC_DCCTL7_CIM_HALWAYS  0x00000002  // Hysteresis Always
  #define ADC_DCCTL7_CIM_HONCE    0x00000003  // Hysteresis Once

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP0 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP0_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP0_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP0_COMP1_S      16
  #define ADC_DCCMP0_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP1 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP1_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP1_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP1_COMP1_S      16
  #define ADC_DCCMP1_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP2 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP2_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP2_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP2_COMP1_S      16
  #define ADC_DCCMP2_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP3 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP3_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP3_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP3_COMP1_S      16
  #define ADC_DCCMP3_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP4 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP4_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP4_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP4_COMP1_S      16
  #define ADC_DCCMP4_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP5 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP5_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP5_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP5_COMP1_S      16
  #define ADC_DCCMP5_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP6 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP6_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP6_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP6_COMP1_S      16
  #define ADC_DCCMP6_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_DCCMP7 register.
  //
  //*****************************************************************************
  #define ADC_DCCMP7_COMP1_M      0x0FFF0000  // Compare 1
  #define ADC_DCCMP7_COMP0_M      0x00000FFF  // Compare 0
  #define ADC_DCCMP7_COMP1_S      16
  #define ADC_DCCMP7_COMP0_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_PP register.
  //
  //*****************************************************************************
  #define ADC_PP_TS               0x00800000  // Temperature Sensor
  #define ADC_PP_RSL_M            0x007C0000  // Resolution
  #define ADC_PP_TYPE_M           0x00030000  // ADC Architecture
  #define ADC_PP_TYPE_SAR         0x00000000  // SAR
  #define ADC_PP_DC_M             0x0000FC00  // Digital Comparator Count
  #define ADC_PP_CH_M             0x000003F0  // ADC Channel Count
  #define ADC_PP_MSR_M            0x0000000F  // Maximum ADC Sample Rate
  #define ADC_PP_MSR_125K         0x00000001  // 125 ksps
  #define ADC_PP_MSR_250K         0x00000003  // 250 ksps
  #define ADC_PP_MSR_500K         0x00000005  // 500 ksps
  #define ADC_PP_MSR_1M           0x00000007  // 1 Msps
  #define ADC_PP_RSL_S            18
  #define ADC_PP_DC_S             10
  #define ADC_PP_CH_S             4

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_PC register.
  //
  //*****************************************************************************
  #define ADC_PC_SR_M             0x0000000F  // ADC Sample Rate
  #define ADC_PC_SR_125K          0x00000001  // 125 ksps
  #define ADC_PC_SR_250K          0x00000003  // 250 ksps
  #define ADC_PC_SR_500K          0x00000005  // 500 ksps
  #define ADC_PC_SR_1M            0x00000007  // 1 Msps

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the ADC_O_CC register.
  //
  //*****************************************************************************
  #define ADC_CC_CS_M             0x0000000F  // ADC Clock Source
  #define ADC_CC_CS_SYSPLL        0x00000000  // Either the system clock (if the
                                              // PLL bypass is in effect) or the
                                              // 16 MHz clock derived from PLL /
                                              // 25 (default)
  #define ADC_CC_CS_PIOSC         0x00000001  // PIOSC

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the COMP_O_ACMIS register.
  //
  //*****************************************************************************
  #define COMP_ACMIS_IN1          0x00000002  // Comparator 1 Masked Interrupt
                                              // Status
  #define COMP_ACMIS_IN0          0x00000001  // Comparator 0 Masked Interrupt
                                              // Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the COMP_O_ACRIS register.
  //
  //*****************************************************************************
  #define COMP_ACRIS_IN1          0x00000002  // Comparator 1 Interrupt Status
  #define COMP_ACRIS_IN0          0x00000001  // Comparator 0 Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the COMP_O_ACINTEN register.
  //
  //*****************************************************************************
  #define COMP_ACINTEN_IN1        0x00000002  // Comparator 1 Interrupt Enable
  #define COMP_ACINTEN_IN0        0x00000001  // Comparator 0 Interrupt Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the COMP_O_ACREFCTL
  // register.
  //
  //*****************************************************************************
  #define COMP_ACREFCTL_EN        0x00000200  // Resistor Ladder Enable
  #define COMP_ACREFCTL_RNG       0x00000100  // Resistor Ladder Range
  #define COMP_ACREFCTL_VREF_M    0x0000000F  // Resistor Ladder Voltage Ref
  #define COMP_ACREFCTL_VREF_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the COMP_O_ACSTAT0 register.
  //
  //*****************************************************************************
  #define COMP_ACSTAT0_OVAL       0x00000002  // Comparator Output Value

