imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXIS register.
  //
  //*****************************************************************************
  #define USB_TXIS_EP7            0x00000080  // TX Endpoint 7 Interrupt
  #define USB_TXIS_EP6            0x00000040  // TX Endpoint 6 Interrupt
  #define USB_TXIS_EP5            0x00000020  // TX Endpoint 5 Interrupt
  #define USB_TXIS_EP4            0x00000010  // TX Endpoint 4 Interrupt
  #define USB_TXIS_EP3            0x00000008  // TX Endpoint 3 Interrupt
  #define USB_TXIS_EP2            0x00000004  // TX Endpoint 2 Interrupt
  #define USB_TXIS_EP1            0x00000002  // TX Endpoint 1 Interrupt
  #define USB_TXIS_EP0            0x00000001  // TX and RX Endpoint 0 Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXIS register.
  //
  //*****************************************************************************
  #define USB_RXIS_EP7            0x00000080  // RX Endpoint 7 Interrupt
  #define USB_RXIS_EP6            0x00000040  // RX Endpoint 6 Interrupt
  #define USB_RXIS_EP5            0x00000020  // RX Endpoint 5 Interrupt
  #define USB_RXIS_EP4            0x00000010  // RX Endpoint 4 Interrupt
  #define USB_RXIS_EP3            0x00000008  // RX Endpoint 3 Interrupt
  #define USB_RXIS_EP2            0x00000004  // RX Endpoint 2 Interrupt
  #define USB_RXIS_EP1            0x00000002  // RX Endpoint 1 Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXIE register.
  //
  //*****************************************************************************
  #define USB_TXIE_EP7            0x00000080  // TX Endpoint 7 Interrupt Enable
  #define USB_TXIE_EP6            0x00000040  // TX Endpoint 6 Interrupt Enable
  #define USB_TXIE_EP5            0x00000020  // TX Endpoint 5 Interrupt Enable
  #define USB_TXIE_EP4            0x00000010  // TX Endpoint 4 Interrupt Enable
  #define USB_TXIE_EP3            0x00000008  // TX Endpoint 3 Interrupt Enable
  #define USB_TXIE_EP2            0x00000004  // TX Endpoint 2 Interrupt Enable
  #define USB_TXIE_EP1            0x00000002  // TX Endpoint 1 Interrupt Enable
  #define USB_TXIE_EP0            0x00000001  // TX and RX Endpoint 0 Interrupt
                                              // Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXIE register.
  //
  //*****************************************************************************
  #define USB_RXIE_EP7            0x00000080  // RX Endpoint 7 Interrupt Enable
  #define USB_RXIE_EP6            0x00000040  // RX Endpoint 6 Interrupt Enable
  #define USB_RXIE_EP5            0x00000020  // RX Endpoint 5 Interrupt Enable
  #define USB_RXIE_EP4            0x00000010  // RX Endpoint 4 Interrupt Enable
  #define USB_RXIE_EP3            0x00000008  // RX Endpoint 3 Interrupt Enable
  #define USB_RXIE_EP2            0x00000004  // RX Endpoint 2 Interrupt Enable
  #define USB_RXIE_EP1            0x00000002  // RX Endpoint 1 Interrupt Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_IS register.
  //
  //*****************************************************************************
  #define USB_IS_VBUSERR          0x00000080  // VBUS Error
  #define USB_IS_SESREQ           0x00000040  // SESSION REQUEST
  #define USB_IS_DISCON           0x00000020  // Session Disconnect
  #define USB_IS_CONN             0x00000010  // Session Connect
  #define USB_IS_SOF              0x00000008  // Start of Frame
  #define USB_IS_BABBLE           0x00000004  // Babble Detected
  #define USB_IS_RESET            0x00000004  // RESET Signaling Detected
  #define USB_IS_RESUME           0x00000002  // RESUME Signaling Detected
  #define USB_IS_SUSPEND          0x00000001  // SUSPEND Signaling Detected

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_IE register.
  //
  //*****************************************************************************
  #define USB_IE_VBUSERR          0x00000080  // Enable VBUS Error Interrupt
  #define USB_IE_SESREQ           0x00000040  // Enable Session Request
  #define USB_IE_DISCON           0x00000020  // Enable Disconnect Interrupt
  #define USB_IE_CONN             0x00000010  // Enable Connect Interrupt
  #define USB_IE_SOF              0x00000008  // Enable Start-of-Frame Interrupt
  #define USB_IE_BABBLE           0x00000004  // Enable Babble Interrupt
  #define USB_IE_RESET            0x00000004  // Enable RESET Interrupt
  #define USB_IE_RESUME           0x00000002  // Enable RESUME Interrupt
  #define USB_IE_SUSPND           0x00000001  // Enable SUSPEND Interrupt

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FRAME register.
  //
  //*****************************************************************************
  #define USB_FRAME_M             0x000007FF  // Frame Number
  #define USB_FRAME_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_EPIDX register.
  //
  //*****************************************************************************
  #define USB_EPIDX_EPIDX_M       0x0000000F  // Endpoint Index
  #define USB_EPIDX_EPIDX_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TEST register.
  //
  //*****************************************************************************
  #define USB_TEST_FORCEH         0x00000080  // Force Host Mode
  #define USB_TEST_FIFOACC        0x00000040  // FIFO Access
  #define USB_TEST_FORCEFS        0x00000020  // Force Full-Speed Mode

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO0 register.
  //
  //*****************************************************************************
  #define USB_FIFO0_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO0_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO1 register.
  //
  //*****************************************************************************
  #define USB_FIFO1_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO1_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO2 register.
  //
  //*****************************************************************************
  #define USB_FIFO2_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO2_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO3 register.
  //
  //*****************************************************************************
  #define USB_FIFO3_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO3_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO4 register.
  //
  //*****************************************************************************
  #define USB_FIFO4_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO4_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO5 register.
  //
  //*****************************************************************************
  #define USB_FIFO5_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO5_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO6 register.
  //
  //*****************************************************************************
  #define USB_FIFO6_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO6_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FIFO7 register.
  //
  //*****************************************************************************
  #define USB_FIFO7_EPDATA_M      0xFFFFFFFF  // Endpoint Data
  #define USB_FIFO7_EPDATA_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_DEVCTL register.
  //
  //*****************************************************************************
  #define USB_DEVCTL_DEV          0x00000080  // Device Mode
  #define USB_DEVCTL_FSDEV        0x00000040  // Full-Speed Device Detected
  #define USB_DEVCTL_LSDEV        0x00000020  // Low-Speed Device Detected
  #define USB_DEVCTL_VBUS_M       0x00000018  // VBUS Level
  #define USB_DEVCTL_VBUS_NONE    0x00000000  // Below SessionEnd
  #define USB_DEVCTL_VBUS_SEND    0x00000008  // Above SessionEnd, below AValid
  #define USB_DEVCTL_VBUS_AVALID  0x00000010  // Above AValid, below VBUSValid
  #define USB_DEVCTL_VBUS_VALID   0x00000018  // Above VBUSValid
  #define USB_DEVCTL_HOST         0x00000004  // Host Mode
  #define USB_DEVCTL_HOSTREQ      0x00000002  // Host Request
  #define USB_DEVCTL_SESSION      0x00000001  // Session Start/End

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFIFOSZ register.
  //
  //*****************************************************************************
  #define USB_TXFIFOSZ_DPB        0x00000010  // Double Packet Buffer Support
  #define USB_TXFIFOSZ_SIZE_M     0x0000000F  // Max Packet Size
  #define USB_TXFIFOSZ_SIZE_8     0x00000000  // 8
  #define USB_TXFIFOSZ_SIZE_16    0x00000001  // 16
  #define USB_TXFIFOSZ_SIZE_32    0x00000002  // 32
  #define USB_TXFIFOSZ_SIZE_64    0x00000003  // 64
  #define USB_TXFIFOSZ_SIZE_128   0x00000004  // 128
  #define USB_TXFIFOSZ_SIZE_256   0x00000005  // 256
  #define USB_TXFIFOSZ_SIZE_512   0x00000006  // 512
  #define USB_TXFIFOSZ_SIZE_1024  0x00000007  // 1024
  #define USB_TXFIFOSZ_SIZE_2048  0x00000008  // 2048

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXFIFOSZ register.
  //
  //*****************************************************************************
  #define USB_RXFIFOSZ_DPB        0x00000010  // Double Packet Buffer Support
  #define USB_RXFIFOSZ_SIZE_M     0x0000000F  // Max Packet Size
  #define USB_RXFIFOSZ_SIZE_8     0x00000000  // 8
  #define USB_RXFIFOSZ_SIZE_16    0x00000001  // 16
  #define USB_RXFIFOSZ_SIZE_32    0x00000002  // 32
  #define USB_RXFIFOSZ_SIZE_64    0x00000003  // 64
  #define USB_RXFIFOSZ_SIZE_128   0x00000004  // 128
  #define USB_RXFIFOSZ_SIZE_256   0x00000005  // 256
  #define USB_RXFIFOSZ_SIZE_512   0x00000006  // 512
  #define USB_RXFIFOSZ_SIZE_1024  0x00000007  // 1024
  #define USB_RXFIFOSZ_SIZE_2048  0x00000008  // 2048

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFIFOADD
  // register.
  //
  //*****************************************************************************
  #define USB_TXFIFOADD_ADDR_M    0x000001FF  // Transmit/Receive Start Address
  #define USB_TXFIFOADD_ADDR_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXFIFOADD
  // register.
  //
  //*****************************************************************************
  #define USB_RXFIFOADD_ADDR_M    0x000001FF  // Transmit/Receive Start Address
  #define USB_RXFIFOADD_ADDR_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_CONTIM register.
  //
  //*****************************************************************************
  #define USB_CONTIM_WTCON_M      0x000000F0  // Connect Wait
  #define USB_CONTIM_WTID_M       0x0000000F  // Wait ID
  #define USB_CONTIM_WTCON_S      4
  #define USB_CONTIM_WTID_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_VPLEN register.
  //
  //*****************************************************************************
  #define USB_VPLEN_VPLEN_M       0x000000FF  // VBUS Pulse Length
  #define USB_VPLEN_VPLEN_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_FSEOF register.
  //
  //*****************************************************************************
  #define USB_FSEOF_FSEOFG_M      0x000000FF  // Full-Speed End-of-Frame Gap
  #define USB_FSEOF_FSEOFG_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_LSEOF register.
  //
  //*****************************************************************************
  #define USB_LSEOF_LSEOFG_M      0x000000FF  // Low-Speed End-of-Frame Gap
  #define USB_LSEOF_LSEOFG_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFUNCADDR0
  // register.
  //
  //*****************************************************************************
  #define USB_TXFUNCADDR0_ADDR_M  0x0000007F  // Device Address
  #define USB_TXFUNCADDR0_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBADDR0
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBADDR0_ADDR_M   0x0000007F  // Hub Address
  #define USB_TXHUBADDR0_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBPORT0
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBPORT0_PORT_M   0x0000007F  // Hub Port
  #define USB_TXHUBPORT0_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFUNCADDR1
  // register.
  //
  //*****************************************************************************
  #define USB_TXFUNCADDR1_ADDR_M  0x0000007F  // Device Address
  #define USB_TXFUNCADDR1_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBADDR1
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBADDR1_ADDR_M   0x0000007F  // Hub Address
  #define USB_TXHUBADDR1_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBPORT1
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBPORT1_PORT_M   0x0000007F  // Hub Port
  #define USB_TXHUBPORT1_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXFUNCADDR1
  // register.
  //
  //*****************************************************************************
  #define USB_RXFUNCADDR1_ADDR_M  0x0000007F  // Device Address
  #define USB_RXFUNCADDR1_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBADDR1
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBADDR1_ADDR_M   0x0000007F  // Hub Address
  #define USB_RXHUBADDR1_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBPORT1
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBPORT1_PORT_M   0x0000007F  // Hub Port
  #define USB_RXHUBPORT1_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFUNCADDR2
  // register.
  //
  //*****************************************************************************
  #define USB_TXFUNCADDR2_ADDR_M  0x0000007F  // Device Address
  #define USB_TXFUNCADDR2_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBADDR2
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBADDR2_ADDR_M   0x0000007F  // Hub Address
  #define USB_TXHUBADDR2_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBPORT2
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBPORT2_PORT_M   0x0000007F  // Hub Port
  #define USB_TXHUBPORT2_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXFUNCADDR2
  // register.
  //
  //*****************************************************************************
  #define USB_RXFUNCADDR2_ADDR_M  0x0000007F  // Device Address
  #define USB_RXFUNCADDR2_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBADDR2
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBADDR2_ADDR_M   0x0000007F  // Hub Address
  #define USB_RXHUBADDR2_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBPORT2
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBPORT2_PORT_M   0x0000007F  // Hub Port
  #define USB_RXHUBPORT2_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFUNCADDR3
  // register.
  //
  //*****************************************************************************
  #define USB_TXFUNCADDR3_ADDR_M  0x0000007F  // Device Address
  #define USB_TXFUNCADDR3_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBADDR3
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBADDR3_ADDR_M   0x0000007F  // Hub Address
  #define USB_TXHUBADDR3_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBPORT3
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBPORT3_PORT_M   0x0000007F  // Hub Port
  #define USB_TXHUBPORT3_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXFUNCADDR3
  // register.
  //
  //*****************************************************************************
  #define USB_RXFUNCADDR3_ADDR_M  0x0000007F  // Device Address
  #define USB_RXFUNCADDR3_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBADDR3
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBADDR3_ADDR_M   0x0000007F  // Hub Address
  #define USB_RXHUBADDR3_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBPORT3
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBPORT3_PORT_M   0x0000007F  // Hub Port
  #define USB_RXHUBPORT3_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXFUNCADDR4
  // register.
  //
  //*****************************************************************************
  #define USB_TXFUNCADDR4_ADDR_M  0x0000007F  // Device Address
  #define USB_TXFUNCADDR4_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBADDR4
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBADDR4_ADDR_M   0x0000007F  // Hub Address
  #define USB_TXHUBADDR4_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXHUBPORT4
  // register.
  //
  //*****************************************************************************
  #define USB_TXHUBPORT4_PORT_M   0x0000007F  // Hub Port
  #define USB_TXHUBPORT4_PORT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXFUNCADDR4
  // register.
  //
  //*****************************************************************************
  #define USB_RXFUNCADDR4_ADDR_M  0x0000007F  // Device Address
  #define USB_RXFUNCADDR4_ADDR_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBADDR4
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBADDR4_ADDR_M   0x0000007F  // Hub Address
  #define USB_RXHUBADDR4_ADDR_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXHUBPORT4
  // register.
  //
  //*****************************************************************************
  #define USB_RXHUBPORT4_PORT_M   0x0000007F  // Hub Port
  #define USB_RXHUBPORT4_PORT_S   0

