imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXTYPE2 register.
  //
  //*****************************************************************************
  #define USB_RXTYPE2_SPEED_M     0x000000C0  // Operating Speed
  #define USB_RXTYPE2_SPEED_DFLT  0x00000000  // Default
  #define USB_RXTYPE2_SPEED_FULL  0x00000080  // Full
  #define USB_RXTYPE2_SPEED_LOW   0x000000C0  // Low
  #define USB_RXTYPE2_PROTO_M     0x00000030  // Protocol
  #define USB_RXTYPE2_PROTO_CTRL  0x00000000  // Control
  #define USB_RXTYPE2_PROTO_ISOC  0x00000010  // Isochronous
  #define USB_RXTYPE2_PROTO_BULK  0x00000020  // Bulk
  #define USB_RXTYPE2_PROTO_INT   0x00000030  // Interrupt
  #define USB_RXTYPE2_TEP_M       0x0000000F  // Target Endpoint Number
  #define USB_RXTYPE2_TEP_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXINTERVAL2
  // register.
  //
  //*****************************************************************************
  #define USB_RXINTERVAL2_TXPOLL_M                                              \
                                  0x000000FF  // RX Polling
  #define USB_RXINTERVAL2_NAKLMT_M                                              \
                                  0x000000FF  // NAK Limit
  #define USB_RXINTERVAL2_TXPOLL_S                                              \
                                  0
  #define USB_RXINTERVAL2_NAKLMT_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXMAXP3 register.
  //
  //*****************************************************************************
  #define USB_TXMAXP3_MAXLOAD_M   0x000007FF  // Maximum Payload
  #define USB_TXMAXP3_MAXLOAD_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXCSRL3 register.
  //
  //*****************************************************************************
  #define USB_TXCSRL3_NAKTO       0x00000080  // NAK Timeout
  #define USB_TXCSRL3_CLRDT       0x00000040  // Clear Data Toggle
  #define USB_TXCSRL3_STALLED     0x00000020  // Endpoint Stalled
  #define USB_TXCSRL3_SETUP       0x00000010  // Setup Packet
  #define USB_TXCSRL3_STALL       0x00000010  // Send STALL
  #define USB_TXCSRL3_FLUSH       0x00000008  // Flush FIFO
  #define USB_TXCSRL3_ERROR       0x00000004  // Error
  #define USB_TXCSRL3_UNDRN       0x00000004  // Underrun
  #define USB_TXCSRL3_FIFONE      0x00000002  // FIFO Not Empty
  #define USB_TXCSRL3_TXRDY       0x00000001  // Transmit Packet Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXCSRH3 register.
  //
  //*****************************************************************************
  #define USB_TXCSRH3_AUTOSET     0x00000080  // Auto Set
  #define USB_TXCSRH3_ISO         0x00000040  // Isochronous Transfers
  #define USB_TXCSRH3_MODE        0x00000020  // Mode
  #define USB_TXCSRH3_DMAEN       0x00000010  // DMA Request Enable
  #define USB_TXCSRH3_FDT         0x00000008  // Force Data Toggle
  #define USB_TXCSRH3_DMAMOD      0x00000004  // DMA Request Mode
  #define USB_TXCSRH3_DTWE        0x00000002  // Data Toggle Write Enable
  #define USB_TXCSRH3_DT          0x00000001  // Data Toggle

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXMAXP3 register.
  //
  //*****************************************************************************
  #define USB_RXMAXP3_MAXLOAD_M   0x000007FF  // Maximum Payload
  #define USB_RXMAXP3_MAXLOAD_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCSRL3 register.
  //
  //*****************************************************************************
  #define USB_RXCSRL3_CLRDT       0x00000080  // Clear Data Toggle
  #define USB_RXCSRL3_STALLED     0x00000040  // Endpoint Stalled
  #define USB_RXCSRL3_STALL       0x00000020  // Send STALL
  #define USB_RXCSRL3_REQPKT      0x00000020  // Request Packet
  #define USB_RXCSRL3_FLUSH       0x00000010  // Flush FIFO
  #define USB_RXCSRL3_DATAERR     0x00000008  // Data Error
  #define USB_RXCSRL3_NAKTO       0x00000008  // NAK Timeout
  #define USB_RXCSRL3_ERROR       0x00000004  // Error
  #define USB_RXCSRL3_OVER        0x00000004  // Overrun
  #define USB_RXCSRL3_FULL        0x00000002  // FIFO Full
  #define USB_RXCSRL3_RXRDY       0x00000001  // Receive Packet Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCSRH3 register.
  //
  //*****************************************************************************
  #define USB_RXCSRH3_AUTOCL      0x00000080  // Auto Clear
  #define USB_RXCSRH3_AUTORQ      0x00000040  // Auto Request
  #define USB_RXCSRH3_ISO         0x00000040  // Isochronous Transfers
  #define USB_RXCSRH3_DMAEN       0x00000020  // DMA Request Enable
  #define USB_RXCSRH3_DISNYET     0x00000010  // Disable NYET
  #define USB_RXCSRH3_PIDERR      0x00000010  // PID Error
  #define USB_RXCSRH3_DMAMOD      0x00000008  // DMA Request Mode
  #define USB_RXCSRH3_DTWE        0x00000004  // Data Toggle Write Enable
  #define USB_RXCSRH3_DT          0x00000002  // Data Toggle

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCOUNT3 register.
  //
  //*****************************************************************************
  #define USB_RXCOUNT3_COUNT_M    0x00001FFF  // Receive Packet Count
  #define USB_RXCOUNT3_COUNT_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXTYPE3 register.
  //
  //*****************************************************************************
  #define USB_TXTYPE3_SPEED_M     0x000000C0  // Operating Speed
  #define USB_TXTYPE3_SPEED_DFLT  0x00000000  // Default
  #define USB_TXTYPE3_SPEED_FULL  0x00000080  // Full
  #define USB_TXTYPE3_SPEED_LOW   0x000000C0  // Low
  #define USB_TXTYPE3_PROTO_M     0x00000030  // Protocol
  #define USB_TXTYPE3_PROTO_CTRL  0x00000000  // Control
  #define USB_TXTYPE3_PROTO_ISOC  0x00000010  // Isochronous
  #define USB_TXTYPE3_PROTO_BULK  0x00000020  // Bulk
  #define USB_TXTYPE3_PROTO_INT   0x00000030  // Interrupt
  #define USB_TXTYPE3_TEP_M       0x0000000F  // Target Endpoint Number
  #define USB_TXTYPE3_TEP_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXINTERVAL3
  // register.
  //
  //*****************************************************************************
  #define USB_TXINTERVAL3_TXPOLL_M                                              \
                                  0x000000FF  // TX Polling
  #define USB_TXINTERVAL3_NAKLMT_M                                              \
                                  0x000000FF  // NAK Limit
  #define USB_TXINTERVAL3_TXPOLL_S                                              \
                                  0
  #define USB_TXINTERVAL3_NAKLMT_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXTYPE3 register.
  //
  //*****************************************************************************
  #define USB_RXTYPE3_SPEED_M     0x000000C0  // Operating Speed
  #define USB_RXTYPE3_SPEED_DFLT  0x00000000  // Default
  #define USB_RXTYPE3_SPEED_FULL  0x00000080  // Full
  #define USB_RXTYPE3_SPEED_LOW   0x000000C0  // Low
  #define USB_RXTYPE3_PROTO_M     0x00000030  // Protocol
  #define USB_RXTYPE3_PROTO_CTRL  0x00000000  // Control
  #define USB_RXTYPE3_PROTO_ISOC  0x00000010  // Isochronous
  #define USB_RXTYPE3_PROTO_BULK  0x00000020  // Bulk
  #define USB_RXTYPE3_PROTO_INT   0x00000030  // Interrupt
  #define USB_RXTYPE3_TEP_M       0x0000000F  // Target Endpoint Number
  #define USB_RXTYPE3_TEP_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXINTERVAL3
  // register.
  //
  //*****************************************************************************
  #define USB_RXINTERVAL3_TXPOLL_M                                              \
                                  0x000000FF  // RX Polling
  #define USB_RXINTERVAL3_NAKLMT_M                                              \
                                  0x000000FF  // NAK Limit
  #define USB_RXINTERVAL3_TXPOLL_S                                              \
                                  0
  #define USB_RXINTERVAL3_NAKLMT_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXMAXP4 register.
  //
  //*****************************************************************************
  #define USB_TXMAXP4_MAXLOAD_M   0x000007FF  // Maximum Payload
  #define USB_TXMAXP4_MAXLOAD_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXCSRL4 register.
  //
  //*****************************************************************************
  #define USB_TXCSRL4_NAKTO       0x00000080  // NAK Timeout
  #define USB_TXCSRL4_CLRDT       0x00000040  // Clear Data Toggle
  #define USB_TXCSRL4_STALLED     0x00000020  // Endpoint Stalled
  #define USB_TXCSRL4_SETUP       0x00000010  // Setup Packet
  #define USB_TXCSRL4_STALL       0x00000010  // Send STALL
  #define USB_TXCSRL4_FLUSH       0x00000008  // Flush FIFO
  #define USB_TXCSRL4_ERROR       0x00000004  // Error
  #define USB_TXCSRL4_UNDRN       0x00000004  // Underrun
  #define USB_TXCSRL4_FIFONE      0x00000002  // FIFO Not Empty
  #define USB_TXCSRL4_TXRDY       0x00000001  // Transmit Packet Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXCSRH4 register.
  //
  //*****************************************************************************
  #define USB_TXCSRH4_AUTOSET     0x00000080  // Auto Set
  #define USB_TXCSRH4_ISO         0x00000040  // Isochronous Transfers
  #define USB_TXCSRH4_MODE        0x00000020  // Mode
  #define USB_TXCSRH4_DMAEN       0x00000010  // DMA Request Enable
  #define USB_TXCSRH4_FDT         0x00000008  // Force Data Toggle
  #define USB_TXCSRH4_DMAMOD      0x00000004  // DMA Request Mode
  #define USB_TXCSRH4_DTWE        0x00000002  // Data Toggle Write Enable
  #define USB_TXCSRH4_DT          0x00000001  // Data Toggle

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXMAXP4 register.
  //
  //*****************************************************************************
  #define USB_RXMAXP4_MAXLOAD_M   0x000007FF  // Maximum Payload
  #define USB_RXMAXP4_MAXLOAD_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCSRL4 register.
  //
  //*****************************************************************************
  #define USB_RXCSRL4_CLRDT       0x00000080  // Clear Data Toggle
  #define USB_RXCSRL4_STALLED     0x00000040  // Endpoint Stalled
  #define USB_RXCSRL4_STALL       0x00000020  // Send STALL
  #define USB_RXCSRL4_REQPKT      0x00000020  // Request Packet
  #define USB_RXCSRL4_FLUSH       0x00000010  // Flush FIFO
  #define USB_RXCSRL4_NAKTO       0x00000008  // NAK Timeout
  #define USB_RXCSRL4_DATAERR     0x00000008  // Data Error
  #define USB_RXCSRL4_OVER        0x00000004  // Overrun
  #define USB_RXCSRL4_ERROR       0x00000004  // Error
  #define USB_RXCSRL4_FULL        0x00000002  // FIFO Full
  #define USB_RXCSRL4_RXRDY       0x00000001  // Receive Packet Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCSRH4 register.
  //
  //*****************************************************************************
  #define USB_RXCSRH4_AUTOCL      0x00000080  // Auto Clear
  #define USB_RXCSRH4_AUTORQ      0x00000040  // Auto Request
  #define USB_RXCSRH4_ISO         0x00000040  // Isochronous Transfers
  #define USB_RXCSRH4_DMAEN       0x00000020  // DMA Request Enable
  #define USB_RXCSRH4_DISNYET     0x00000010  // Disable NYET
  #define USB_RXCSRH4_PIDERR      0x00000010  // PID Error
  #define USB_RXCSRH4_DMAMOD      0x00000008  // DMA Request Mode
  #define USB_RXCSRH4_DTWE        0x00000004  // Data Toggle Write Enable
  #define USB_RXCSRH4_DT          0x00000002  // Data Toggle

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCOUNT4 register.
  //
  //*****************************************************************************
  #define USB_RXCOUNT4_COUNT_M    0x00001FFF  // Receive Packet Count
  #define USB_RXCOUNT4_COUNT_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXTYPE4 register.
  //
  //*****************************************************************************
  #define USB_TXTYPE4_SPEED_M     0x000000C0  // Operating Speed
  #define USB_TXTYPE4_SPEED_DFLT  0x00000000  // Default
  #define USB_TXTYPE4_SPEED_FULL  0x00000080  // Full
  #define USB_TXTYPE4_SPEED_LOW   0x000000C0  // Low
  #define USB_TXTYPE4_PROTO_M     0x00000030  // Protocol
  #define USB_TXTYPE4_PROTO_CTRL  0x00000000  // Control
  #define USB_TXTYPE4_PROTO_ISOC  0x00000010  // Isochronous
  #define USB_TXTYPE4_PROTO_BULK  0x00000020  // Bulk
  #define USB_TXTYPE4_PROTO_INT   0x00000030  // Interrupt
  #define USB_TXTYPE4_TEP_M       0x0000000F  // Target Endpoint Number
  #define USB_TXTYPE4_TEP_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXINTERVAL4
  // register.
  //
  //*****************************************************************************
  #define USB_TXINTERVAL4_TXPOLL_M                                              \
                                  0x000000FF  // TX Polling
  #define USB_TXINTERVAL4_NAKLMT_M                                              \
                                  0x000000FF  // NAK Limit
  #define USB_TXINTERVAL4_NAKLMT_S                                              \
                                  0
  #define USB_TXINTERVAL4_TXPOLL_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXTYPE4 register.
  //
  //*****************************************************************************
  #define USB_RXTYPE4_SPEED_M     0x000000C0  // Operating Speed
  #define USB_RXTYPE4_SPEED_DFLT  0x00000000  // Default
  #define USB_RXTYPE4_SPEED_FULL  0x00000080  // Full
  #define USB_RXTYPE4_SPEED_LOW   0x000000C0  // Low
  #define USB_RXTYPE4_PROTO_M     0x00000030  // Protocol
  #define USB_RXTYPE4_PROTO_CTRL  0x00000000  // Control
  #define USB_RXTYPE4_PROTO_ISOC  0x00000010  // Isochronous
  #define USB_RXTYPE4_PROTO_BULK  0x00000020  // Bulk
  #define USB_RXTYPE4_PROTO_INT   0x00000030  // Interrupt
  #define USB_RXTYPE4_TEP_M       0x0000000F  // Target Endpoint Number
  #define USB_RXTYPE4_TEP_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXINTERVAL4
  // register.
  //
  //*****************************************************************************
  #define USB_RXINTERVAL4_TXPOLL_M                                              \
                                  0x000000FF  // RX Polling
  #define USB_RXINTERVAL4_NAKLMT_M                                              \
                                  0x000000FF  // NAK Limit
  #define USB_RXINTERVAL4_NAKLMT_S                                              \
                                  0
  #define USB_RXINTERVAL4_TXPOLL_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXMAXP5 register.
  //
  //*****************************************************************************
  #define USB_TXMAXP5_MAXLOAD_M   0x000007FF  // Maximum Payload
  #define USB_TXMAXP5_MAXLOAD_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXCSRL5 register.
  //
  //*****************************************************************************
  #define USB_TXCSRL5_NAKTO       0x00000080  // NAK Timeout
  #define USB_TXCSRL5_CLRDT       0x00000040  // Clear Data Toggle
  #define USB_TXCSRL5_STALLED     0x00000020  // Endpoint Stalled
  #define USB_TXCSRL5_SETUP       0x00000010  // Setup Packet
  #define USB_TXCSRL5_STALL       0x00000010  // Send STALL
  #define USB_TXCSRL5_FLUSH       0x00000008  // Flush FIFO
  #define USB_TXCSRL5_ERROR       0x00000004  // Error
  #define USB_TXCSRL5_UNDRN       0x00000004  // Underrun
  #define USB_TXCSRL5_FIFONE      0x00000002  // FIFO Not Empty
  #define USB_TXCSRL5_TXRDY       0x00000001  // Transmit Packet Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXCSRH5 register.
  //
  //*****************************************************************************
  #define USB_TXCSRH5_AUTOSET     0x00000080  // Auto Set
  #define USB_TXCSRH5_ISO         0x00000040  // Isochronous Transfers
  #define USB_TXCSRH5_MODE        0x00000020  // Mode
  #define USB_TXCSRH5_DMAEN       0x00000010  // DMA Request Enable
  #define USB_TXCSRH5_FDT         0x00000008  // Force Data Toggle
  #define USB_TXCSRH5_DMAMOD      0x00000004  // DMA Request Mode
  #define USB_TXCSRH5_DTWE        0x00000002  // Data Toggle Write Enable
  #define USB_TXCSRH5_DT          0x00000001  // Data Toggle

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXMAXP5 register.
  //
  //*****************************************************************************
  #define USB_RXMAXP5_MAXLOAD_M   0x000007FF  // Maximum Payload
  #define USB_RXMAXP5_MAXLOAD_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCSRL5 register.
  //
  //*****************************************************************************
  #define USB_RXCSRL5_CLRDT       0x00000080  // Clear Data Toggle
  #define USB_RXCSRL5_STALLED     0x00000040  // Endpoint Stalled
  #define USB_RXCSRL5_STALL       0x00000020  // Send STALL
  #define USB_RXCSRL5_REQPKT      0x00000020  // Request Packet
  #define USB_RXCSRL5_FLUSH       0x00000010  // Flush FIFO
  #define USB_RXCSRL5_NAKTO       0x00000008  // NAK Timeout
  #define USB_RXCSRL5_DATAERR     0x00000008  // Data Error
  #define USB_RXCSRL5_ERROR       0x00000004  // Error
  #define USB_RXCSRL5_OVER        0x00000004  // Overrun
  #define USB_RXCSRL5_FULL        0x00000002  // FIFO Full
  #define USB_RXCSRL5_RXRDY       0x00000001  // Receive Packet Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCSRH5 register.
  //
  //*****************************************************************************
  #define USB_RXCSRH5_AUTOCL      0x00000080  // Auto Clear
  #define USB_RXCSRH5_AUTORQ      0x00000040  // Auto Request
  #define USB_RXCSRH5_ISO         0x00000040  // Isochronous Transfers
  #define USB_RXCSRH5_DMAEN       0x00000020  // DMA Request Enable
  #define USB_RXCSRH5_DISNYET     0x00000010  // Disable NYET
  #define USB_RXCSRH5_PIDERR      0x00000010  // PID Error
  #define USB_RXCSRH5_DMAMOD      0x00000008  // DMA Request Mode
  #define USB_RXCSRH5_DTWE        0x00000004  // Data Toggle Write Enable
  #define USB_RXCSRH5_DT          0x00000002  // Data Toggle

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_RXCOUNT5 register.
  //
  //*****************************************************************************
  #define USB_RXCOUNT5_COUNT_M    0x00001FFF  // Receive Packet Count
  #define USB_RXCOUNT5_COUNT_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXTYPE5 register.
  //
  //*****************************************************************************
  #define USB_TXTYPE5_SPEED_M     0x000000C0  // Operating Speed
  #define USB_TXTYPE5_SPEED_DFLT  0x00000000  // Default
  #define USB_TXTYPE5_SPEED_FULL  0x00000080  // Full
  #define USB_TXTYPE5_SPEED_LOW   0x000000C0  // Low
  #define USB_TXTYPE5_PROTO_M     0x00000030  // Protocol
  #define USB_TXTYPE5_PROTO_CTRL  0x00000000  // Control
  #define USB_TXTYPE5_PROTO_ISOC  0x00000010  // Isochronous
  #define USB_TXTYPE5_PROTO_BULK  0x00000020  // Bulk
  #define USB_TXTYPE5_PROTO_INT   0x00000030  // Interrupt
  #define USB_TXTYPE5_TEP_M       0x0000000F  // Target Endpoint Number
  #define USB_TXTYPE5_TEP_S       0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_TXINTERVAL5
  // register.
  //
  //*****************************************************************************
  #define USB_TXINTERVAL5_TXPOLL_M                                              \
                                  0x000000FF  // TX Polling
  #define USB_TXINTERVAL5_NAKLMT_M                                              \
                                  0x000000FF  // NAK Limit
  #define USB_TXINTERVAL5_NAKLMT_S                                              \
                                  0
  #define USB_TXINTERVAL5_TXPOLL_S                                              \
                                  0

