imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_EPCRIS register.
  //
  //*****************************************************************************
  #define USB_EPCRIS_PF           0x00000001  // USB Power Fault Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_EPCIM register.
  //
  //*****************************************************************************
  #define USB_EPCIM_PF            0x00000001  // USB Power Fault Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_EPCISC register.
  //
  //*****************************************************************************
  #define USB_EPCISC_PF           0x00000001  // USB Power Fault Interrupt Status
                                              // and Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_DRRIS register.
  //
  //*****************************************************************************
  #define USB_DRRIS_RESUME        0x00000001  // RESUME Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_DRIM register.
  //
  //*****************************************************************************
  #define USB_DRIM_RESUME         0x00000001  // RESUME Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_DRISC register.
  //
  //*****************************************************************************
  #define USB_DRISC_RESUME        0x00000001  // RESUME Interrupt Status and
                                              // Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_GPCS register.
  //
  //*****************************************************************************
  #define USB_GPCS_DEVMODOTG      0x00000002  // Enable Device Mode
  #define USB_GPCS_DEVMOD         0x00000001  // Device Mode

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_VDC register.
  //
  //*****************************************************************************
  #define USB_VDC_VBDEN           0x00000001  // VBUS Droop Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_VDCRIS register.
  //
  //*****************************************************************************
  #define USB_VDCRIS_VD           0x00000001  // VBUS Droop Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_VDCIM register.
  //
  //*****************************************************************************
  #define USB_VDCIM_VD            0x00000001  // VBUS Droop Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_VDCISC register.
  //
  //*****************************************************************************
  #define USB_VDCISC_VD           0x00000001  // VBUS Droop Interrupt Status and
                                              // Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_IDVRIS register.
  //
  //*****************************************************************************
  #define USB_IDVRIS_ID           0x00000001  // ID Valid Detect Raw Interrupt
                                              // Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_IDVIM register.
  //
  //*****************************************************************************
  #define USB_IDVIM_ID            0x00000001  // ID Valid Detect Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_IDVISC register.
  //
  //*****************************************************************************
  #define USB_IDVISC_ID           0x00000001  // ID Valid Detect Interrupt Status
                                              // and Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_DMASEL register.
  //
  //*****************************************************************************
  #define USB_DMASEL_DMACTX_M     0x00F00000  // DMA C TX Select
  #define USB_DMASEL_DMACRX_M     0x000F0000  // DMA C RX Select
  #define USB_DMASEL_DMABTX_M     0x0000F000  // DMA B TX Select
  #define USB_DMASEL_DMABRX_M     0x00000F00  // DMA B RX Select
  #define USB_DMASEL_DMAATX_M     0x000000F0  // DMA A TX Select
  #define USB_DMASEL_DMAARX_M     0x0000000F  // DMA A RX Select
  #define USB_DMASEL_DMACTX_S     20
  #define USB_DMASEL_DMACRX_S     16
  #define USB_DMASEL_DMABTX_S     12
  #define USB_DMASEL_DMABRX_S     8
  #define USB_DMASEL_DMAATX_S     4
  #define USB_DMASEL_DMAARX_S     0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the USB_O_PP register.
  //
  //*****************************************************************************
  #define USB_PP_ECNT_M           0x0000FF00  // Endpoint Count
  #define USB_PP_USB_M            0x000000C0  // USB Capability
  #define USB_PP_USB_DEVICE       0x00000040  // DEVICE
  #define USB_PP_USB_HOSTDEVICE   0x00000080  // HOST
  #define USB_PP_USB_OTG          0x000000C0  // OTG
  #define USB_PP_PHY              0x00000010  // PHY Present
  #define USB_PP_TYPE_M           0x0000000F  // Controller Type
  #define USB_PP_TYPE_0           0x00000000  // The first-generation USB
                                              // controller
  #define USB_PP_ECNT_S           8

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EESIZE register.
  //
  //*****************************************************************************
  #define EEPROM_EESIZE_BLKCNT_M  0x07FF0000  // Number of 16-Word Blocks
  #define EEPROM_EESIZE_WORDCNT_M 0x0000FFFF  // Number of 32-Bit Words
  #define EEPROM_EESIZE_BLKCNT_S  16
  #define EEPROM_EESIZE_WORDCNT_S 0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEBLOCK register.
  //
  //*****************************************************************************
  #define EEPROM_EEBLOCK_BLOCK_M  0x0000FFFF  // Current Block
  #define EEPROM_EEBLOCK_BLOCK_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEOFFSET
  // register.
  //
  //*****************************************************************************
  #define EEPROM_EEOFFSET_OFFSET_M                                              \
                                  0x0000000F  // Current Address Offset
  #define EEPROM_EEOFFSET_OFFSET_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EERDWR register.
  //
  //*****************************************************************************
  #define EEPROM_EERDWR_VALUE_M   0xFFFFFFFF  // EEPROM Read or Write Data
  #define EEPROM_EERDWR_VALUE_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EERDWRINC
  // register.
  //
  //*****************************************************************************
  #define EEPROM_EERDWRINC_VALUE_M                                              \
                                  0xFFFFFFFF  // EEPROM Read or Write Data with
                                              // Increment
  #define EEPROM_EERDWRINC_VALUE_S                                              \
                                  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEDONE register.
  //
  //*****************************************************************************
  #define EEPROM_EEDONE_INVPL     0x00000100  // Invalid Program Voltage Level
  #define EEPROM_EEDONE_WRBUSY    0x00000020  // Write Busy
  #define EEPROM_EEDONE_NOPERM    0x00000010  // Write Without Permission
  #define EEPROM_EEDONE_WKCOPY    0x00000008  // Working on a Copy
  #define EEPROM_EEDONE_WKERASE   0x00000004  // Working on an Erase
  #define EEPROM_EEDONE_WORKING   0x00000001  // EEPROM Working

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EESUPP register.
  //
  //*****************************************************************************
  #define EEPROM_EESUPP_PRETRY    0x00000008  // Programming Must Be Retried
  #define EEPROM_EESUPP_ERETRY    0x00000004  // Erase Must Be Retried
  #define EEPROM_EESUPP_EREQ      0x00000002  // Erase Required
  #define EEPROM_EESUPP_START     0x00000001  // Start Erase

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEUNLOCK
  // register.
  //
  //*****************************************************************************
  #define EEPROM_EEUNLOCK_UNLOCK_M                                              \
                                  0xFFFFFFFF  // EEPROM Unlock

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEPROT register.
  //
  //*****************************************************************************
  #define EEPROM_EEPROT_ACC       0x00000008  // Access Control
  #define EEPROM_EEPROT_PROT_M    0x00000007  // Protection Control
  #define EEPROM_EEPROT_PROT_RWNPW                                              \
                                  0x00000000  // This setting is the default. If
                                              // there is no password, the block
                                              // is not protected and is readable
                                              // and writable
  #define EEPROM_EEPROT_PROT_RWPW 0x00000001  // If there is a password, the
                                              // block is readable or writable
                                              // only when unlocked
  #define EEPROM_EEPROT_PROT_RONPW                                              \
                                  0x00000002  // If there is no password, the
                                              // block is readable, not writable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEPASS0 register.
  //
  //*****************************************************************************
  #define EEPROM_EEPASS0_PASS_M   0xFFFFFFFF  // Password
  #define EEPROM_EEPASS0_PASS_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEPASS1 register.
  //
  //*****************************************************************************
  #define EEPROM_EEPASS1_PASS_M   0xFFFFFFFF  // Password
  #define EEPROM_EEPASS1_PASS_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEPASS2 register.
  //
  //*****************************************************************************
  #define EEPROM_EEPASS2_PASS_M   0xFFFFFFFF  // Password
  #define EEPROM_EEPASS2_PASS_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEINT register.
  //
  //*****************************************************************************
  #define EEPROM_EEINT_INT        0x00000001  // Interrupt Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEHIDE register.
  //
  //*****************************************************************************
  #define EEPROM_EEHIDE_HN_M      0xFFFFFFFE  // Hide Block

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_EEDBGME register.
  //
  //*****************************************************************************
  #define EEPROM_EEDBGME_KEY_M    0xFFFF0000  // Erase Key
  #define EEPROM_EEDBGME_ME       0x00000001  // Mass Erase
  #define EEPROM_EEDBGME_KEY_S    16

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the EEPROM_PP register.
  //
  //*****************************************************************************
  #define EEPROM_PP_SIZE_M        0x0000001F  // EEPROM Size
  #define EEPROM_PP_SIZE_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSEXC_RIS register.
  //
  //*****************************************************************************
  #define SYSEXC_RIS_FPIXCRIS     0x00000020  // Floating-Point Inexact Exception
                                              // Raw Interrupt Status
  #define SYSEXC_RIS_FPOFCRIS     0x00000010  // Floating-Point Overflow
                                              // Exception Raw Interrupt Status
  #define SYSEXC_RIS_FPUFCRIS     0x00000008  // Floating-Point Underflow
                                              // Exception Raw Interrupt Status
  #define SYSEXC_RIS_FPIOCRIS     0x00000004  // Floating-Point Invalid Operation
                                              // Raw Interrupt Status
  #define SYSEXC_RIS_FPDZCRIS     0x00000002  // Floating-Point Divide By 0
                                              // Exception Raw Interrupt Status
  #define SYSEXC_RIS_FPIDCRIS     0x00000001  // Floating-Point Input Denormal
                                              // Exception Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSEXC_IM register.
  //
  //*****************************************************************************
  #define SYSEXC_IM_FPIXCIM       0x00000020  // Floating-Point Inexact Exception
                                              // Interrupt Mask
  #define SYSEXC_IM_FPOFCIM       0x00000010  // Floating-Point Overflow
                                              // Exception Interrupt Mask
  #define SYSEXC_IM_FPUFCIM       0x00000008  // Floating-Point Underflow
                                              // Exception Interrupt Mask
  #define SYSEXC_IM_FPIOCIM       0x00000004  // Floating-Point Invalid Operation
                                              // Interrupt Mask
  #define SYSEXC_IM_FPDZCIM       0x00000002  // Floating-Point Divide By 0
                                              // Exception Interrupt Mask
  #define SYSEXC_IM_FPIDCIM       0x00000001  // Floating-Point Input Denormal
                                              // Exception Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSEXC_MIS register.
  //
  //*****************************************************************************
  #define SYSEXC_MIS_FPIXCMIS     0x00000020  // Floating-Point Inexact Exception
                                              // Masked Interrupt Status
  #define SYSEXC_MIS_FPOFCMIS     0x00000010  // Floating-Point Overflow
                                              // Exception Masked Interrupt
                                              // Status
  #define SYSEXC_MIS_FPUFCMIS     0x00000008  // Floating-Point Underflow
                                              // Exception Masked Interrupt
                                              // Status
  #define SYSEXC_MIS_FPIOCMIS     0x00000004  // Floating-Point Invalid Operation
                                              // Masked Interrupt Status
  #define SYSEXC_MIS_FPDZCMIS     0x00000002  // Floating-Point Divide By 0
                                              // Exception Masked Interrupt
                                              // Status
  #define SYSEXC_MIS_FPIDCMIS     0x00000001  // Floating-Point Input Denormal
                                              // Exception Masked Interrupt
                                              // Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSEXC_IC register.
  //
  //*****************************************************************************
  #define SYSEXC_IC_FPIXCIC       0x00000020  // Floating-Point Inexact Exception
                                              // Interrupt Clear
  #define SYSEXC_IC_FPOFCIC       0x00000010  // Floating-Point Overflow
                                              // Exception Interrupt Clear
  #define SYSEXC_IC_FPUFCIC       0x00000008  // Floating-Point Underflow
                                              // Exception Interrupt Clear
  #define SYSEXC_IC_FPIOCIC       0x00000004  // Floating-Point Invalid Operation
                                              // Interrupt Clear
  #define SYSEXC_IC_FPDZCIC       0x00000002  // Floating-Point Divide By 0
                                              // Exception Interrupt Clear
  #define SYSEXC_IC_FPIDCIC       0x00000001  // Floating-Point Input Denormal
                                              // Exception Interrupt Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_RTCC register.
  //
  //*****************************************************************************
  #define HIB_RTCC_M              0xFFFFFFFF  // RTC Counter
  #define HIB_RTCC_S              0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_RTCM0 register.
  //
  //*****************************************************************************
  #define HIB_RTCM0_M             0xFFFFFFFF  // RTC Match 0
  #define HIB_RTCM0_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_RTCLD register.
  //
  //*****************************************************************************
  #define HIB_RTCLD_M             0xFFFFFFFF  // RTC Load
  #define HIB_RTCLD_S             0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_CTL register.
  //
  //*****************************************************************************
  #define HIB_CTL_WRC             0x80000000  // Write Complete/Capable
  #define HIB_CTL_OSCDRV          0x00020000  // Oscillator Drive Capability
  #define HIB_CTL_OSCBYP          0x00010000  // Oscillator Bypass
  #define HIB_CTL_VBATSEL_M       0x00006000  // Select for Low-Battery
                                              // Comparator
  #define HIB_CTL_VBATSEL_1_9V    0x00000000  // 1.9 Volts
  #define HIB_CTL_VBATSEL_2_1V    0x00002000  // 2.1 Volts (default)
  #define HIB_CTL_VBATSEL_2_3V    0x00004000  // 2.3 Volts
  #define HIB_CTL_VBATSEL_2_5V    0x00006000  // 2.5 Volts
  #define HIB_CTL_BATCHK          0x00000400  // Check Battery Status
  #define HIB_CTL_BATWKEN         0x00000200  // Wake on Low Battery
  #define HIB_CTL_VDD3ON          0x00000100  // VDD Powered
  #define HIB_CTL_VABORT          0x00000080  // Power Cut Abort Enable
  #define HIB_CTL_CLK32EN         0x00000040  // Clocking Enable
  #define HIB_CTL_PINWEN          0x00000010  // External WAKE Pin Enable
  #define HIB_CTL_RTCWEN          0x00000008  // RTC Wake-up Enable
  #define HIB_CTL_HIBREQ          0x00000002  // Hibernation Request
  #define HIB_CTL_RTCEN           0x00000001  // RTC Timer Enable

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_IM register.
  //
  //*****************************************************************************
  #define HIB_IM_WC               0x00000010  // External Write Complete/Capable
                                              // Interrupt Mask
  #define HIB_IM_EXTW             0x00000008  // External Wake-Up Interrupt Mask
  #define HIB_IM_LOWBAT           0x00000004  // Low Battery Voltage Interrupt
                                              // Mask
  #define HIB_IM_RTCALT0          0x00000001  // RTC Alert 0 Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_RIS register.
  //
  //*****************************************************************************
  #define HIB_RIS_WC              0x00000010  // Write Complete/Capable Raw
                                              // Interrupt Status
  #define HIB_RIS_EXTW            0x00000008  // External Wake-Up Raw Interrupt
                                              // Status
  #define HIB_RIS_LOWBAT          0x00000004  // Low Battery Voltage Raw
                                              // Interrupt Status
  #define HIB_RIS_RTCALT0         0x00000001  // RTC Alert 0 Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_MIS register.
  //
  //*****************************************************************************
  #define HIB_MIS_WC              0x00000010  // Write Complete/Capable Masked
                                              // Interrupt Status
  #define HIB_MIS_EXTW            0x00000008  // External Wake-Up Masked
                                              // Interrupt Status
  #define HIB_MIS_LOWBAT          0x00000004  // Low Battery Voltage Masked
                                              // Interrupt Status
  #define HIB_MIS_RTCALT0         0x00000001  // RTC Alert 0 Masked Interrupt
                                              // Status

