imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_IC register.
  //
  //*****************************************************************************
  #define HIB_IC_WC               0x00000010  // Write Complete/Capable Masked
                                              // Interrupt Clear
  #define HIB_IC_EXTW             0x00000008  // External Wake-Up Masked
                                              // Interrupt Clear
  #define HIB_IC_LOWBAT           0x00000004  // Low Battery Voltage Masked
                                              // Interrupt Clear
  #define HIB_IC_RTCALT0          0x00000001  // RTC Alert0 Masked Interrupt
                                              // Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_RTCT register.
  //
  //*****************************************************************************
  #define HIB_RTCT_TRIM_M         0x0000FFFF  // RTC Trim Value
  #define HIB_RTCT_TRIM_S         0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_RTCSS register.
  //
  //*****************************************************************************
  #define HIB_RTCSS_RTCSSM_M      0x7FFF0000  // RTC Sub Seconds Match
  #define HIB_RTCSS_RTCSSC_M      0x00007FFF  // RTC Sub Seconds Count
  #define HIB_RTCSS_RTCSSM_S      16
  #define HIB_RTCSS_RTCSSC_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the HIB_DATA register.
  //
  //*****************************************************************************
  #define HIB_DATA_RTD_M          0xFFFFFFFF  // Hibernation Module NV Data
  #define HIB_DATA_RTD_S          0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FMA register.
  //
  //*****************************************************************************
  #define FLASH_FMA_OFFSET_M      0x0003FFFF  // Address Offset
  #define FLASH_FMA_OFFSET_S      0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FMD register.
  //
  //*****************************************************************************
  #define FLASH_FMD_DATA_M        0xFFFFFFFF  // Data Value
  #define FLASH_FMD_DATA_S        0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FMC register.
  //
  //*****************************************************************************
  #define FLASH_FMC_WRKEY         0xA4420000  // FLASH write key
  #define FLASH_FMC_COMT          0x00000008  // Commit Register Value
  #define FLASH_FMC_MERASE        0x00000004  // Mass Erase Flash Memory
  #define FLASH_FMC_ERASE         0x00000002  // Erase a Page of Flash Memory
  #define FLASH_FMC_WRITE         0x00000001  // Write a Word into Flash Memory

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FCRIS register.
  //
  //*****************************************************************************
  #define FLASH_FCRIS_PROGRIS     0x00002000  // PROGVER Raw Interrupt Status
  #define FLASH_FCRIS_ERRIS       0x00000800  // ERVER Raw Interrupt Status
  #define FLASH_FCRIS_INVDRIS     0x00000400  // Invalid Data Raw Interrupt
                                              // Status
  #define FLASH_FCRIS_VOLTRIS     0x00000200  // VOLTSTAT Raw Interrupt Status
  #define FLASH_FCRIS_ERIS        0x00000004  // EEPROM Raw Interrupt Status
  #define FLASH_FCRIS_PRIS        0x00000002  // Programming Raw Interrupt Status
  #define FLASH_FCRIS_ARIS        0x00000001  // Access Raw Interrupt Status

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FCIM register.
  //
  //*****************************************************************************
  #define FLASH_FCIM_PROGMASK     0x00002000  // PROGVER Interrupt Mask
  #define FLASH_FCIM_ERMASK       0x00000800  // ERVER Interrupt Mask
  #define FLASH_FCIM_INVDMASK     0x00000400  // Invalid Data Interrupt Mask
  #define FLASH_FCIM_VOLTMASK     0x00000200  // VOLT Interrupt Mask
  #define FLASH_FCIM_EMASK        0x00000004  // EEPROM Interrupt Mask
  #define FLASH_FCIM_PMASK        0x00000002  // Programming Interrupt Mask
  #define FLASH_FCIM_AMASK        0x00000001  // Access Interrupt Mask

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FCMISC register.
  //
  //*****************************************************************************
  #define FLASH_FCMISC_PROGMISC   0x00002000  // PROGVER Masked Interrupt Status
                                              // and Clear
  #define FLASH_FCMISC_ERMISC     0x00000800  // ERVER Masked Interrupt Status
                                              // and Clear
  #define FLASH_FCMISC_INVDMISC   0x00000400  // Invalid Data Masked Interrupt
                                              // Status and Clear
  #define FLASH_FCMISC_VOLTMISC   0x00000200  // VOLT Masked Interrupt Status and
                                              // Clear
  #define FLASH_FCMISC_EMISC      0x00000004  // EEPROM Masked Interrupt Status
                                              // and Clear
  #define FLASH_FCMISC_PMISC      0x00000002  // Programming Masked Interrupt
                                              // Status and Clear
  #define FLASH_FCMISC_AMISC      0x00000001  // Access Masked Interrupt Status
                                              // and Clear

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FMC2 register.
  //
  //*****************************************************************************
  #define FLASH_FMC2_WRBUF        0x00000001  // Buffered Flash Memory Write

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FWBVAL register.
  //
  //*****************************************************************************
  #define FLASH_FWBVAL_FWB_M      0xFFFFFFFF  // Flash Memory Write Buffer

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FWBN register.
  //
  //*****************************************************************************
  #define FLASH_FWBN_DATA_M       0xFFFFFFFF  // Data

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_FSIZE register.
  //
  //*****************************************************************************
  #define FLASH_FSIZE_SIZE_M      0x0000FFFF  // Flash Size
  #define FLASH_FSIZE_SIZE_8KB    0x00000003  // 8 KB of Flash
  #define FLASH_FSIZE_SIZE_16KB   0x00000007  // 16 KB of Flash
  #define FLASH_FSIZE_SIZE_32KB   0x0000000F  // 32 KB of Flash
  #define FLASH_FSIZE_SIZE_64KB   0x0000001F  // 64 KB of Flash
  #define FLASH_FSIZE_SIZE_96KB   0x0000002F  // 96 KB of Flash
  #define FLASH_FSIZE_SIZE_128KB  0x0000003F  // 128 KB of Flash
  #define FLASH_FSIZE_SIZE_192KB  0x0000005F  // 192 KB of Flash
  #define FLASH_FSIZE_SIZE_256KB  0x0000007F  // 256 KB of Flash

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_SSIZE register.
  //
  //*****************************************************************************
  #define FLASH_SSIZE_SIZE_M      0x0000FFFF  // SRAM Size
  #define FLASH_SSIZE_SIZE_2KB    0x00000007  // 2 KB of SRAM
  #define FLASH_SSIZE_SIZE_4KB    0x0000000F  // 4 KB of SRAM
  #define FLASH_SSIZE_SIZE_6KB    0x00000017  // 6 KB of SRAM
  #define FLASH_SSIZE_SIZE_8KB    0x0000001F  // 8 KB of SRAM
  #define FLASH_SSIZE_SIZE_12KB   0x0000002F  // 12 KB of SRAM
  #define FLASH_SSIZE_SIZE_16KB   0x0000003F  // 16 KB of SRAM
  #define FLASH_SSIZE_SIZE_20KB   0x0000004F  // 20 KB of SRAM
  #define FLASH_SSIZE_SIZE_24KB   0x0000005F  // 24 KB of SRAM
  #define FLASH_SSIZE_SIZE_32KB   0x0000007F  // 32 KB of SRAM

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_ROMSWMAP register.
  //
  //*****************************************************************************
  #define FLASH_ROMSWMAP_SAFERTOS 0x00000001  // SafeRTOS Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_RMCTL register.
  //
  //*****************************************************************************
  #define FLASH_RMCTL_BA          0x00000001  // Boot Alias

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_BOOTCFG register.
  //
  //*****************************************************************************
  #define FLASH_BOOTCFG_NW        0x80000000  // Not Written
  #define FLASH_BOOTCFG_PORT_M    0x0000E000  // Boot GPIO Port
  #define FLASH_BOOTCFG_PORT_A    0x00000000  // Port A
  #define FLASH_BOOTCFG_PORT_B    0x00002000  // Port B
  #define FLASH_BOOTCFG_PORT_C    0x00004000  // Port C
  #define FLASH_BOOTCFG_PORT_D    0x00006000  // Port D
  #define FLASH_BOOTCFG_PORT_E    0x00008000  // Port E
  #define FLASH_BOOTCFG_PORT_F    0x0000A000  // Port F
  #define FLASH_BOOTCFG_PORT_G    0x0000C000  // Port G
  #define FLASH_BOOTCFG_PORT_H    0x0000E000  // Port H
  #define FLASH_BOOTCFG_PIN_M     0x00001C00  // Boot GPIO Pin
  #define FLASH_BOOTCFG_PIN_0     0x00000000  // Pin 0
  #define FLASH_BOOTCFG_PIN_1     0x00000400  // Pin 1
  #define FLASH_BOOTCFG_PIN_2     0x00000800  // Pin 2
  #define FLASH_BOOTCFG_PIN_3     0x00000C00  // Pin 3
  #define FLASH_BOOTCFG_PIN_4     0x00001000  // Pin 4
  #define FLASH_BOOTCFG_PIN_5     0x00001400  // Pin 5
  #define FLASH_BOOTCFG_PIN_6     0x00001800  // Pin 6
  #define FLASH_BOOTCFG_PIN_7     0x00001C00  // Pin 7
  #define FLASH_BOOTCFG_POL       0x00000200  // Boot GPIO Polarity
  #define FLASH_BOOTCFG_EN        0x00000100  // Boot GPIO Enable
  #define FLASH_BOOTCFG_KEY       0x00000010  // KEY Select
  #define FLASH_BOOTCFG_DBG1      0x00000002  // Debug Control 1
  #define FLASH_BOOTCFG_DBG0      0x00000001  // Debug Control 0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_USERREG0 register.
  //
  //*****************************************************************************
  #define FLASH_USERREG0_DATA_M   0xFFFFFFFF  // User Data
  #define FLASH_USERREG0_DATA_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_USERREG1 register.
  //
  //*****************************************************************************
  #define FLASH_USERREG1_DATA_M   0xFFFFFFFF  // User Data
  #define FLASH_USERREG1_DATA_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_USERREG2 register.
  //
  //*****************************************************************************
  #define FLASH_USERREG2_DATA_M   0xFFFFFFFF  // User Data
  #define FLASH_USERREG2_DATA_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the FLASH_USERREG3 register.
  //
  //*****************************************************************************
  #define FLASH_USERREG3_DATA_M   0xFFFFFFFF  // User Data
  #define FLASH_USERREG3_DATA_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DID0 register.
  //
  //*****************************************************************************
  #define SYSCTL_DID0_VER_M       0x70000000  // DID0 Version
  #define SYSCTL_DID0_VER_1       0x10000000  // Second version of the DID0
                                              // register format
  #define SYSCTL_DID0_CLASS_M     0x00FF0000  // Device Class
  #define SYSCTL_DID0_CLASS_BLIZZARD                                            \
                                  0x00050000  // Tiva(TM) C Series Blizzard-class
                                              // microcontrollers
  #define SYSCTL_DID0_MAJ_M       0x0000FF00  // Major Revision
  #define SYSCTL_DID0_MAJ_REVA    0x00000000  // Revision A (initial device)
  #define SYSCTL_DID0_MAJ_REVB    0x00000100  // Revision B (first base layer
                                              // revision)
  #define SYSCTL_DID0_MAJ_REVC    0x00000200  // Revision C (second base layer
                                              // revision)
  #define SYSCTL_DID0_MIN_M       0x000000FF  // Minor Revision
  #define SYSCTL_DID0_MIN_0       0x00000000  // Initial device, or a major
                                              // revision update
  #define SYSCTL_DID0_MIN_1       0x00000001  // First metal layer change
  #define SYSCTL_DID0_MIN_2       0x00000002  // Second metal layer change

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DID1 register.
  //
  //*****************************************************************************
  #define SYSCTL_DID1_VER_M       0xF0000000  // DID1 Version
  #define SYSCTL_DID1_VER_1       0x10000000  // Second version of the DID1
                                              // register format
  #define SYSCTL_DID1_FAM_M       0x0F000000  // Family
  #define SYSCTL_DID1_FAM_TIVA    0x00000000  // Tiva family of microcontollers
  #define SYSCTL_DID1_PRTNO_M     0x00FF0000  // Part Number
  #define SYSCTL_DID1_PRTNO_TM4C123GH6PM                                        \
                                  0x00A10000  // TM4C123GH6PM
  #define SYSCTL_DID1_PINCNT_M    0x0000E000  // Package Pin Count
  #define SYSCTL_DID1_PINCNT_28   0x00000000  // 28-pin package
  #define SYSCTL_DID1_PINCNT_48   0x00002000  // 48-pin package
  #define SYSCTL_DID1_PINCNT_100  0x00004000  // 100-pin package
  #define SYSCTL_DID1_PINCNT_64   0x00006000  // 64-pin package
  #define SYSCTL_DID1_PINCNT_144  0x00008000  // 144-pin package
  #define SYSCTL_DID1_PINCNT_157  0x0000A000  // 157-pin package
  #define SYSCTL_DID1_TEMP_M      0x000000E0  // Temperature Range
  #define SYSCTL_DID1_TEMP_C      0x00000000  // Commercial temperature range (0C
                                              // to 70C)
  #define SYSCTL_DID1_TEMP_I      0x00000020  // Industrial temperature range
                                              // (-40C to 85C)
  #define SYSCTL_DID1_TEMP_E      0x00000040  // Extended temperature range (-40C
                                              // to 105C)
  #define SYSCTL_DID1_PKG_M       0x00000018  // Package Type
  #define SYSCTL_DID1_PKG_SOIC    0x00000000  // SOIC package
  #define SYSCTL_DID1_PKG_QFP     0x00000008  // LQFP package
  #define SYSCTL_DID1_PKG_BGA     0x00000010  // BGA package
  #define SYSCTL_DID1_ROHS        0x00000004  // RoHS-Compliance
  #define SYSCTL_DID1_QUAL_M      0x00000003  // Qualification Status
  #define SYSCTL_DID1_QUAL_ES     0x00000000  // Engineering Sample (unqualified)
  #define SYSCTL_DID1_QUAL_PP     0x00000001  // Pilot Production (unqualified)
  #define SYSCTL_DID1_QUAL_FQ     0x00000002  // Fully Qualified

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DC0 register.
  //
  //*****************************************************************************
  #define SYSCTL_DC0_SRAMSZ_M     0xFFFF0000  // SRAM Size
  #define SYSCTL_DC0_SRAMSZ_2KB   0x00070000  // 2 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_4KB   0x000F0000  // 4 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_6KB   0x00170000  // 6 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_8KB   0x001F0000  // 8 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_12KB  0x002F0000  // 12 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_16KB  0x003F0000  // 16 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_20KB  0x004F0000  // 20 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_24KB  0x005F0000  // 24 KB of SRAM
  #define SYSCTL_DC0_SRAMSZ_32KB  0x007F0000  // 32 KB of SRAM
  #define SYSCTL_DC0_FLASHSZ_M    0x0000FFFF  // Flash Size
  #define SYSCTL_DC0_FLASHSZ_8KB  0x00000003  // 8 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_16KB 0x00000007  // 16 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_32KB 0x0000000F  // 32 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_64KB 0x0000001F  // 64 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_96KB 0x0000002F  // 96 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_128K 0x0000003F  // 128 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_192K 0x0000005F  // 192 KB of Flash
  #define SYSCTL_DC0_FLASHSZ_256K 0x0000007F  // 256 KB of Flash

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DC1 register.
  //
  //*****************************************************************************
  #define SYSCTL_DC1_WDT1         0x10000000  // Watchdog Timer1 Present
  #define SYSCTL_DC1_CAN1         0x02000000  // CAN Module 1 Present
  #define SYSCTL_DC1_CAN0         0x01000000  // CAN Module 0 Present
  #define SYSCTL_DC1_PWM1         0x00200000  // PWM Module 1 Present
  #define SYSCTL_DC1_PWM0         0x00100000  // PWM Module 0 Present
  #define SYSCTL_DC1_ADC1         0x00020000  // ADC Module 1 Present
  #define SYSCTL_DC1_ADC0         0x00010000  // ADC Module 0 Present
  #define SYSCTL_DC1_MINSYSDIV_M  0x0000F000  // System Clock Divider
  #define SYSCTL_DC1_MINSYSDIV_100                                              \
                                  0x00001000  // Divide VCO (400MHZ) by 5 minimum
  #define SYSCTL_DC1_MINSYSDIV_66 0x00002000  // Divide VCO (400MHZ) by 2*2 + 2 =
                                              // 6 minimum
  #define SYSCTL_DC1_MINSYSDIV_50 0x00003000  // Specifies a 50-MHz CPU clock
                                              // with a PLL divider of 4
  #define SYSCTL_DC1_MINSYSDIV_40 0x00004000  // Specifies a 40-MHz CPU clock
                                              // with a PLL divider of 5
  #define SYSCTL_DC1_MINSYSDIV_25 0x00007000  // Specifies a 25-MHz clock with a
                                              // PLL divider of 8
  #define SYSCTL_DC1_MINSYSDIV_20 0x00009000  // Specifies a 20-MHz clock with a
                                              // PLL divider of 10
  #define SYSCTL_DC1_ADC1SPD_M    0x00000C00  // Max ADC1 Speed
  #define SYSCTL_DC1_ADC1SPD_125K 0x00000000  // 125K samples/second
  #define SYSCTL_DC1_ADC1SPD_250K 0x00000400  // 250K samples/second
  #define SYSCTL_DC1_ADC1SPD_500K 0x00000800  // 500K samples/second
  #define SYSCTL_DC1_ADC1SPD_1M   0x00000C00  // 1M samples/second
  #define SYSCTL_DC1_ADC0SPD_M    0x00000300  // Max ADC0 Speed
  #define SYSCTL_DC1_ADC0SPD_125K 0x00000000  // 125K samples/second
  #define SYSCTL_DC1_ADC0SPD_250K 0x00000100  // 250K samples/second
  #define SYSCTL_DC1_ADC0SPD_500K 0x00000200  // 500K samples/second
  #define SYSCTL_DC1_ADC0SPD_1M   0x00000300  // 1M samples/second
  #define SYSCTL_DC1_MPU          0x00000080  // MPU Present
  #define SYSCTL_DC1_HIB          0x00000040  // Hibernation Module Present
  #define SYSCTL_DC1_TEMP         0x00000020  // Temp Sensor Present
  #define SYSCTL_DC1_PLL          0x00000010  // PLL Present
  #define SYSCTL_DC1_WDT0         0x00000008  // Watchdog Timer 0 Present
  #define SYSCTL_DC1_SWO          0x00000004  // SWO Trace Port Present
  #define SYSCTL_DC1_SWD          0x00000002  // SWD Present
  #define SYSCTL_DC1_JTAG         0x00000001  // JTAG Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DC2 register.
  //
  //*****************************************************************************
  #define SYSCTL_DC2_EPI0         0x40000000  // EPI Module 0 Present
  #define SYSCTL_DC2_I2S0         0x10000000  // I2S Module 0 Present
  #define SYSCTL_DC2_COMP2        0x04000000  // Analog Comparator 2 Present
  #define SYSCTL_DC2_COMP1        0x02000000  // Analog Comparator 1 Present
  #define SYSCTL_DC2_COMP0        0x01000000  // Analog Comparator 0 Present
  #define SYSCTL_DC2_TIMER3       0x00080000  // Timer Module 3 Present
  #define SYSCTL_DC2_TIMER2       0x00040000  // Timer Module 2 Present
  #define SYSCTL_DC2_TIMER1       0x00020000  // Timer Module 1 Present
  #define SYSCTL_DC2_TIMER0       0x00010000  // Timer Module 0 Present
  #define SYSCTL_DC2_I2C1HS       0x00008000  // I2C Module 1 Speed
  #define SYSCTL_DC2_I2C1         0x00004000  // I2C Module 1 Present
  #define SYSCTL_DC2_I2C0HS       0x00002000  // I2C Module 0 Speed
  #define SYSCTL_DC2_I2C0         0x00001000  // I2C Module 0 Present
  #define SYSCTL_DC2_QEI1         0x00000200  // QEI Module 1 Present
  #define SYSCTL_DC2_QEI0         0x00000100  // QEI Module 0 Present
  #define SYSCTL_DC2_SSI1         0x00000020  // SSI Module 1 Present
  #define SYSCTL_DC2_SSI0         0x00000010  // SSI Module 0 Present
  #define SYSCTL_DC2_UART2        0x00000004  // UART Module 2 Present
  #define SYSCTL_DC2_UART1        0x00000002  // UART Module 1 Present
  #define SYSCTL_DC2_UART0        0x00000001  // UART Module 0 Present

