imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGC0 register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGC0_WDT1       0x10000000  // WDT1 Clock Gating Control
  #define SYSCTL_RCGC0_CAN1       0x02000000  // CAN1 Clock Gating Control
  #define SYSCTL_RCGC0_CAN0       0x01000000  // CAN0 Clock Gating Control
  #define SYSCTL_RCGC0_PWM0       0x00100000  // PWM Clock Gating Control
  #define SYSCTL_RCGC0_ADC1       0x00020000  // ADC1 Clock Gating Control
  #define SYSCTL_RCGC0_ADC0       0x00010000  // ADC0 Clock Gating Control
  #define SYSCTL_RCGC0_ADC1SPD_M  0x00000C00  // ADC1 Sample Speed
  #define SYSCTL_RCGC0_ADC1SPD_125K                                             \
                                  0x00000000  // 125K samples/second
  #define SYSCTL_RCGC0_ADC1SPD_250K                                             \
                                  0x00000400  // 250K samples/second
  #define SYSCTL_RCGC0_ADC1SPD_500K                                             \
                                  0x00000800  // 500K samples/second
  #define SYSCTL_RCGC0_ADC1SPD_1M 0x00000C00  // 1M samples/second
  #define SYSCTL_RCGC0_ADC0SPD_M  0x00000300  // ADC0 Sample Speed
  #define SYSCTL_RCGC0_ADC0SPD_125K                                             \
                                  0x00000000  // 125K samples/second
  #define SYSCTL_RCGC0_ADC0SPD_250K                                             \
                                  0x00000100  // 250K samples/second
  #define SYSCTL_RCGC0_ADC0SPD_500K                                             \
                                  0x00000200  // 500K samples/second
  #define SYSCTL_RCGC0_ADC0SPD_1M 0x00000300  // 1M samples/second
  #define SYSCTL_RCGC0_HIB        0x00000040  // HIB Clock Gating Control
  #define SYSCTL_RCGC0_WDT0       0x00000008  // WDT0 Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGC1 register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGC1_COMP1      0x02000000  // Analog Comparator 1 Clock Gating
  #define SYSCTL_RCGC1_COMP0      0x01000000  // Analog Comparator 0 Clock Gating
  #define SYSCTL_RCGC1_TIMER3     0x00080000  // Timer 3 Clock Gating Control
  #define SYSCTL_RCGC1_TIMER2     0x00040000  // Timer 2 Clock Gating Control
  #define SYSCTL_RCGC1_TIMER1     0x00020000  // Timer 1 Clock Gating Control
  #define SYSCTL_RCGC1_TIMER0     0x00010000  // Timer 0 Clock Gating Control
  #define SYSCTL_RCGC1_I2C1       0x00004000  // I2C1 Clock Gating Control
  #define SYSCTL_RCGC1_I2C0       0x00001000  // I2C0 Clock Gating Control
  #define SYSCTL_RCGC1_QEI1       0x00000200  // QEI1 Clock Gating Control
  #define SYSCTL_RCGC1_QEI0       0x00000100  // QEI0 Clock Gating Control
  #define SYSCTL_RCGC1_SSI1       0x00000020  // SSI1 Clock Gating Control
  #define SYSCTL_RCGC1_SSI0       0x00000010  // SSI0 Clock Gating Control
  #define SYSCTL_RCGC1_UART2      0x00000004  // UART2 Clock Gating Control
  #define SYSCTL_RCGC1_UART1      0x00000002  // UART1 Clock Gating Control
  #define SYSCTL_RCGC1_UART0      0x00000001  // UART0 Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGC2 register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGC2_USB0       0x00010000  // USB0 Clock Gating Control
  #define SYSCTL_RCGC2_UDMA       0x00002000  // Micro-DMA Clock Gating Control
  #define SYSCTL_RCGC2_GPIOF      0x00000020  // Port F Clock Gating Control
  #define SYSCTL_RCGC2_GPIOE      0x00000010  // Port E Clock Gating Control
  #define SYSCTL_RCGC2_GPIOD      0x00000008  // Port D Clock Gating Control
  #define SYSCTL_RCGC2_GPIOC      0x00000004  // Port C Clock Gating Control
  #define SYSCTL_RCGC2_GPIOB      0x00000002  // Port B Clock Gating Control
  #define SYSCTL_RCGC2_GPIOA      0x00000001  // Port A Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGC0 register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGC0_WDT1       0x10000000  // WDT1 Clock Gating Control
  #define SYSCTL_SCGC0_CAN1       0x02000000  // CAN1 Clock Gating Control
  #define SYSCTL_SCGC0_CAN0       0x01000000  // CAN0 Clock Gating Control
  #define SYSCTL_SCGC0_PWM0       0x00100000  // PWM Clock Gating Control
  #define SYSCTL_SCGC0_ADC1       0x00020000  // ADC1 Clock Gating Control
  #define SYSCTL_SCGC0_ADC0       0x00010000  // ADC0 Clock Gating Control
  #define SYSCTL_SCGC0_HIB        0x00000040  // HIB Clock Gating Control
  #define SYSCTL_SCGC0_WDT0       0x00000008  // WDT0 Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGC1 register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGC1_COMP1      0x02000000  // Analog Comparator 1 Clock Gating
  #define SYSCTL_SCGC1_COMP0      0x01000000  // Analog Comparator 0 Clock Gating
  #define SYSCTL_SCGC1_TIMER3     0x00080000  // Timer 3 Clock Gating Control
  #define SYSCTL_SCGC1_TIMER2     0x00040000  // Timer 2 Clock Gating Control
  #define SYSCTL_SCGC1_TIMER1     0x00020000  // Timer 1 Clock Gating Control
  #define SYSCTL_SCGC1_TIMER0     0x00010000  // Timer 0 Clock Gating Control
  #define SYSCTL_SCGC1_I2C1       0x00004000  // I2C1 Clock Gating Control
  #define SYSCTL_SCGC1_I2C0       0x00001000  // I2C0 Clock Gating Control
  #define SYSCTL_SCGC1_QEI1       0x00000200  // QEI1 Clock Gating Control
  #define SYSCTL_SCGC1_QEI0       0x00000100  // QEI0 Clock Gating Control
  #define SYSCTL_SCGC1_SSI1       0x00000020  // SSI1 Clock Gating Control
  #define SYSCTL_SCGC1_SSI0       0x00000010  // SSI0 Clock Gating Control
  #define SYSCTL_SCGC1_UART2      0x00000004  // UART2 Clock Gating Control
  #define SYSCTL_SCGC1_UART1      0x00000002  // UART1 Clock Gating Control
  #define SYSCTL_SCGC1_UART0      0x00000001  // UART0 Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGC2 register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGC2_USB0       0x00010000  // USB0 Clock Gating Control
  #define SYSCTL_SCGC2_UDMA       0x00002000  // Micro-DMA Clock Gating Control
  #define SYSCTL_SCGC2_GPIOF      0x00000020  // Port F Clock Gating Control
  #define SYSCTL_SCGC2_GPIOE      0x00000010  // Port E Clock Gating Control
  #define SYSCTL_SCGC2_GPIOD      0x00000008  // Port D Clock Gating Control
  #define SYSCTL_SCGC2_GPIOC      0x00000004  // Port C Clock Gating Control
  #define SYSCTL_SCGC2_GPIOB      0x00000002  // Port B Clock Gating Control
  #define SYSCTL_SCGC2_GPIOA      0x00000001  // Port A Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGC0 register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGC0_WDT1       0x10000000  // WDT1 Clock Gating Control
  #define SYSCTL_DCGC0_CAN1       0x02000000  // CAN1 Clock Gating Control
  #define SYSCTL_DCGC0_CAN0       0x01000000  // CAN0 Clock Gating Control
  #define SYSCTL_DCGC0_PWM0       0x00100000  // PWM Clock Gating Control
  #define SYSCTL_DCGC0_ADC1       0x00020000  // ADC1 Clock Gating Control
  #define SYSCTL_DCGC0_ADC0       0x00010000  // ADC0 Clock Gating Control
  #define SYSCTL_DCGC0_HIB        0x00000040  // HIB Clock Gating Control
  #define SYSCTL_DCGC0_WDT0       0x00000008  // WDT0 Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGC1 register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGC1_COMP1      0x02000000  // Analog Comparator 1 Clock Gating
  #define SYSCTL_DCGC1_COMP0      0x01000000  // Analog Comparator 0 Clock Gating
  #define SYSCTL_DCGC1_TIMER3     0x00080000  // Timer 3 Clock Gating Control
  #define SYSCTL_DCGC1_TIMER2     0x00040000  // Timer 2 Clock Gating Control
  #define SYSCTL_DCGC1_TIMER1     0x00020000  // Timer 1 Clock Gating Control
  #define SYSCTL_DCGC1_TIMER0     0x00010000  // Timer 0 Clock Gating Control
  #define SYSCTL_DCGC1_I2C1       0x00004000  // I2C1 Clock Gating Control
  #define SYSCTL_DCGC1_I2C0       0x00001000  // I2C0 Clock Gating Control
  #define SYSCTL_DCGC1_QEI1       0x00000200  // QEI1 Clock Gating Control
  #define SYSCTL_DCGC1_QEI0       0x00000100  // QEI0 Clock Gating Control
  #define SYSCTL_DCGC1_SSI1       0x00000020  // SSI1 Clock Gating Control
  #define SYSCTL_DCGC1_SSI0       0x00000010  // SSI0 Clock Gating Control
  #define SYSCTL_DCGC1_UART2      0x00000004  // UART2 Clock Gating Control
  #define SYSCTL_DCGC1_UART1      0x00000002  // UART1 Clock Gating Control
  #define SYSCTL_DCGC1_UART0      0x00000001  // UART0 Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGC2 register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGC2_USB0       0x00010000  // USB0 Clock Gating Control
  #define SYSCTL_DCGC2_UDMA       0x00002000  // Micro-DMA Clock Gating Control
  #define SYSCTL_DCGC2_GPIOF      0x00000020  // Port F Clock Gating Control
  #define SYSCTL_DCGC2_GPIOE      0x00000010  // Port E Clock Gating Control
  #define SYSCTL_DCGC2_GPIOD      0x00000008  // Port D Clock Gating Control
  #define SYSCTL_DCGC2_GPIOC      0x00000004  // Port C Clock Gating Control
  #define SYSCTL_DCGC2_GPIOB      0x00000002  // Port B Clock Gating Control
  #define SYSCTL_DCGC2_GPIOA      0x00000001  // Port A Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DSLPCLKCFG
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DSLPCLKCFG_D_M   0x1F800000  // Divider Field Override
  #define SYSCTL_DSLPCLKCFG_O_M   0x00000070  // Clock Source
  #define SYSCTL_DSLPCLKCFG_O_IGN 0x00000000  // MOSC
  #define SYSCTL_DSLPCLKCFG_O_IO  0x00000010  // PIOSC
  #define SYSCTL_DSLPCLKCFG_O_30  0x00000030  // 30 kHz
  #define SYSCTL_DSLPCLKCFG_O_32  0x00000070  // 32.768 kHz
  #define SYSCTL_DSLPCLKCFG_D_S   23

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SYSPROP register.
  //
  //*****************************************************************************
  #define SYSCTL_SYSPROP_FPU      0x00000001  // FPU Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PIOSCCAL
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_PIOSCCAL_UTEN    0x80000000  // Use User Trim Value
  #define SYSCTL_PIOSCCAL_CAL     0x00000200  // Start Calibration
  #define SYSCTL_PIOSCCAL_UPDATE  0x00000100  // Update Trim
  #define SYSCTL_PIOSCCAL_UT_M    0x0000007F  // User Trim Value
  #define SYSCTL_PIOSCCAL_UT_S    0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PIOSCSTAT
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_PIOSCSTAT_DT_M   0x007F0000  // Default Trim Value
  #define SYSCTL_PIOSCSTAT_CR_M   0x00000300  // Calibration Result
  #define SYSCTL_PIOSCSTAT_CRNONE 0x00000000  // Calibration has not been
                                              // attempted
  #define SYSCTL_PIOSCSTAT_CRPASS 0x00000100  // The last calibration operation
                                              // completed to meet 1% accuracy
  #define SYSCTL_PIOSCSTAT_CRFAIL 0x00000200  // The last calibration operation
                                              // failed to meet 1% accuracy
  #define SYSCTL_PIOSCSTAT_CT_M   0x0000007F  // Calibration Trim Value
  #define SYSCTL_PIOSCSTAT_DT_S   16
  #define SYSCTL_PIOSCSTAT_CT_S   0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PLLFREQ0
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_PLLFREQ0_MFRAC_M 0x000FFC00  // PLL M Fractional Value
  #define SYSCTL_PLLFREQ0_MINT_M  0x000003FF  // PLL M Integer Value
  #define SYSCTL_PLLFREQ0_MFRAC_S 10
  #define SYSCTL_PLLFREQ0_MINT_S  0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PLLFREQ1
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_PLLFREQ1_Q_M     0x00001F00  // PLL Q Value
  #define SYSCTL_PLLFREQ1_N_M     0x0000001F  // PLL N Value
  #define SYSCTL_PLLFREQ1_Q_S     8
  #define SYSCTL_PLLFREQ1_N_S     0

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PLLSTAT register.
  //
  //*****************************************************************************
  #define SYSCTL_PLLSTAT_LOCK     0x00000001  // PLL Lock

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DC9 register.
  //
  //*****************************************************************************
  #define SYSCTL_DC9_ADC1DC7      0x00800000  // ADC1 DC7 Present
  #define SYSCTL_DC9_ADC1DC6      0x00400000  // ADC1 DC6 Present
  #define SYSCTL_DC9_ADC1DC5      0x00200000  // ADC1 DC5 Present
  #define SYSCTL_DC9_ADC1DC4      0x00100000  // ADC1 DC4 Present
  #define SYSCTL_DC9_ADC1DC3      0x00080000  // ADC1 DC3 Present
  #define SYSCTL_DC9_ADC1DC2      0x00040000  // ADC1 DC2 Present
  #define SYSCTL_DC9_ADC1DC1      0x00020000  // ADC1 DC1 Present
  #define SYSCTL_DC9_ADC1DC0      0x00010000  // ADC1 DC0 Present
  #define SYSCTL_DC9_ADC0DC7      0x00000080  // ADC0 DC7 Present
  #define SYSCTL_DC9_ADC0DC6      0x00000040  // ADC0 DC6 Present
  #define SYSCTL_DC9_ADC0DC5      0x00000020  // ADC0 DC5 Present
  #define SYSCTL_DC9_ADC0DC4      0x00000010  // ADC0 DC4 Present
  #define SYSCTL_DC9_ADC0DC3      0x00000008  // ADC0 DC3 Present
  #define SYSCTL_DC9_ADC0DC2      0x00000004  // ADC0 DC2 Present
  #define SYSCTL_DC9_ADC0DC1      0x00000002  // ADC0 DC1 Present
  #define SYSCTL_DC9_ADC0DC0      0x00000001  // ADC0 DC0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_NVMSTAT register.
  //
  //*****************************************************************************
  #define SYSCTL_NVMSTAT_FWB      0x00000001  // 32 Word Flash Write Buffer
                                              // Active

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPWD register.
  //
  //*****************************************************************************
  #define SYSCTL_PPWD_P1          0x00000002  // Watchdog Timer 1 Present
  #define SYSCTL_PPWD_P0          0x00000001  // Watchdog Timer 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPTIMER register.
  //
  //*****************************************************************************
  #define SYSCTL_PPTIMER_P5       0x00000020  // Timer 5 Present
  #define SYSCTL_PPTIMER_P4       0x00000010  // Timer 4 Present
  #define SYSCTL_PPTIMER_P3       0x00000008  // Timer 3 Present
  #define SYSCTL_PPTIMER_P2       0x00000004  // Timer 2 Present
  #define SYSCTL_PPTIMER_P1       0x00000002  // Timer 1 Present
  #define SYSCTL_PPTIMER_P0       0x00000001  // Timer 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPGPIO register.
  //
  //*****************************************************************************
  #define SYSCTL_PPGPIO_P14       0x00004000  // GPIO Port Q Present
  #define SYSCTL_PPGPIO_P13       0x00002000  // GPIO Port P Present
  #define SYSCTL_PPGPIO_P12       0x00001000  // GPIO Port N Present
  #define SYSCTL_PPGPIO_P11       0x00000800  // GPIO Port M Present
  #define SYSCTL_PPGPIO_P10       0x00000400  // GPIO Port L Present
  #define SYSCTL_PPGPIO_P9        0x00000200  // GPIO Port K Present
  #define SYSCTL_PPGPIO_P8        0x00000100  // GPIO Port J Present
  #define SYSCTL_PPGPIO_P7        0x00000080  // GPIO Port H Present
  #define SYSCTL_PPGPIO_P6        0x00000040  // GPIO Port G Present
  #define SYSCTL_PPGPIO_P5        0x00000020  // GPIO Port F Present
  #define SYSCTL_PPGPIO_P4        0x00000010  // GPIO Port E Present
  #define SYSCTL_PPGPIO_P3        0x00000008  // GPIO Port D Present
  #define SYSCTL_PPGPIO_P2        0x00000004  // GPIO Port C Present
  #define SYSCTL_PPGPIO_P1        0x00000002  // GPIO Port B Present
  #define SYSCTL_PPGPIO_P0        0x00000001  // GPIO Port A Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPDMA register.
  //
  //*****************************************************************************
  #define SYSCTL_PPDMA_P0         0x00000001  // uDMA Module Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPHIB register.
  //
  //*****************************************************************************
  #define SYSCTL_PPHIB_P0         0x00000001  // Hibernation Module Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPUART register.
  //
  //*****************************************************************************
  #define SYSCTL_PPUART_P7        0x00000080  // UART Module 7 Present
  #define SYSCTL_PPUART_P6        0x00000040  // UART Module 6 Present
  #define SYSCTL_PPUART_P5        0x00000020  // UART Module 5 Present
  #define SYSCTL_PPUART_P4        0x00000010  // UART Module 4 Present
  #define SYSCTL_PPUART_P3        0x00000008  // UART Module 3 Present
  #define SYSCTL_PPUART_P2        0x00000004  // UART Module 2 Present
  #define SYSCTL_PPUART_P1        0x00000002  // UART Module 1 Present
  #define SYSCTL_PPUART_P0        0x00000001  // UART Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPSSI register.
  //
  //*****************************************************************************
  #define SYSCTL_PPSSI_P3         0x00000008  // SSI Module 3 Present
  #define SYSCTL_PPSSI_P2         0x00000004  // SSI Module 2 Present
  #define SYSCTL_PPSSI_P1         0x00000002  // SSI Module 1 Present
  #define SYSCTL_PPSSI_P0         0x00000001  // SSI Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPI2C register.
  //
  //*****************************************************************************
  #define SYSCTL_PPI2C_P5         0x00000020  // I2C Module 5 Present
  #define SYSCTL_PPI2C_P4         0x00000010  // I2C Module 4 Present
  #define SYSCTL_PPI2C_P3         0x00000008  // I2C Module 3 Present
  #define SYSCTL_PPI2C_P2         0x00000004  // I2C Module 2 Present
  #define SYSCTL_PPI2C_P1         0x00000002  // I2C Module 1 Present
  #define SYSCTL_PPI2C_P0         0x00000001  // I2C Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPUSB register.
  //
  //*****************************************************************************
  #define SYSCTL_PPUSB_P0         0x00000001  // USB Module Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPCAN register.
  //
  //*****************************************************************************
  #define SYSCTL_PPCAN_P1         0x00000002  // CAN Module 1 Present
  #define SYSCTL_PPCAN_P0         0x00000001  // CAN Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPADC register.
  //
  //*****************************************************************************
  #define SYSCTL_PPADC_P1         0x00000002  // ADC Module 1 Present
  #define SYSCTL_PPADC_P0         0x00000001  // ADC Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPACMP register.
  //
  //*****************************************************************************
  #define SYSCTL_PPACMP_P0        0x00000001  // Analog Comparator Module Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPPWM register.
  //
  //*****************************************************************************
  #define SYSCTL_PPPWM_P1         0x00000002  // PWM Module 1 Present
  #define SYSCTL_PPPWM_P0         0x00000001  // PWM Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPQEI register.
  //
  //*****************************************************************************
  #define SYSCTL_PPQEI_P1         0x00000002  // QEI Module 1 Present
  #define SYSCTL_PPQEI_P0         0x00000001  // QEI Module 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPEEPROM
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_PPEEPROM_P0      0x00000001  // EEPROM Module Present

