imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PPWTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_PPWTIMER_P5      0x00000020  // Wide Timer 5 Present
  #define SYSCTL_PPWTIMER_P4      0x00000010  // Wide Timer 4 Present
  #define SYSCTL_PPWTIMER_P3      0x00000008  // Wide Timer 3 Present
  #define SYSCTL_PPWTIMER_P2      0x00000004  // Wide Timer 2 Present
  #define SYSCTL_PPWTIMER_P1      0x00000002  // Wide Timer 1 Present
  #define SYSCTL_PPWTIMER_P0      0x00000001  // Wide Timer 0 Present

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRWD register.
  //
  //*****************************************************************************
  #define SYSCTL_SRWD_R1          0x00000002  // Watchdog Timer 1 Software Reset
  #define SYSCTL_SRWD_R0          0x00000001  // Watchdog Timer 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRTIMER register.
  //
  //*****************************************************************************
  #define SYSCTL_SRTIMER_R5       0x00000020  // Timer 5 Software Reset
  #define SYSCTL_SRTIMER_R4       0x00000010  // Timer 4 Software Reset
  #define SYSCTL_SRTIMER_R3       0x00000008  // Timer 3 Software Reset
  #define SYSCTL_SRTIMER_R2       0x00000004  // Timer 2 Software Reset
  #define SYSCTL_SRTIMER_R1       0x00000002  // Timer 1 Software Reset
  #define SYSCTL_SRTIMER_R0       0x00000001  // Timer 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRGPIO register.
  //
  //*****************************************************************************
  #define SYSCTL_SRGPIO_R5        0x00000020  // GPIO Port F Software Reset
  #define SYSCTL_SRGPIO_R4        0x00000010  // GPIO Port E Software Reset
  #define SYSCTL_SRGPIO_R3        0x00000008  // GPIO Port D Software Reset
  #define SYSCTL_SRGPIO_R2        0x00000004  // GPIO Port C Software Reset
  #define SYSCTL_SRGPIO_R1        0x00000002  // GPIO Port B Software Reset
  #define SYSCTL_SRGPIO_R0        0x00000001  // GPIO Port A Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRDMA register.
  //
  //*****************************************************************************
  #define SYSCTL_SRDMA_R0         0x00000001  // uDMA Module Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRHIB register.
  //
  //*****************************************************************************
  #define SYSCTL_SRHIB_R0         0x00000001  // Hibernation Module Software
                                              // Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRUART register.
  //
  //*****************************************************************************
  #define SYSCTL_SRUART_R7        0x00000080  // UART Module 7 Software Reset
  #define SYSCTL_SRUART_R6        0x00000040  // UART Module 6 Software Reset
  #define SYSCTL_SRUART_R5        0x00000020  // UART Module 5 Software Reset
  #define SYSCTL_SRUART_R4        0x00000010  // UART Module 4 Software Reset
  #define SYSCTL_SRUART_R3        0x00000008  // UART Module 3 Software Reset
  #define SYSCTL_SRUART_R2        0x00000004  // UART Module 2 Software Reset
  #define SYSCTL_SRUART_R1        0x00000002  // UART Module 1 Software Reset
  #define SYSCTL_SRUART_R0        0x00000001  // UART Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRSSI register.
  //
  //*****************************************************************************
  #define SYSCTL_SRSSI_R3         0x00000008  // SSI Module 3 Software Reset
  #define SYSCTL_SRSSI_R2         0x00000004  // SSI Module 2 Software Reset
  #define SYSCTL_SRSSI_R1         0x00000002  // SSI Module 1 Software Reset
  #define SYSCTL_SRSSI_R0         0x00000001  // SSI Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRI2C register.
  //
  //*****************************************************************************
  #define SYSCTL_SRI2C_R3         0x00000008  // I2C Module 3 Software Reset
  #define SYSCTL_SRI2C_R2         0x00000004  // I2C Module 2 Software Reset
  #define SYSCTL_SRI2C_R1         0x00000002  // I2C Module 1 Software Reset
  #define SYSCTL_SRI2C_R0         0x00000001  // I2C Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRUSB register.
  //
  //*****************************************************************************
  #define SYSCTL_SRUSB_R0         0x00000001  // USB Module Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRCAN register.
  //
  //*****************************************************************************
  #define SYSCTL_SRCAN_R1         0x00000002  // CAN Module 1 Software Reset
  #define SYSCTL_SRCAN_R0         0x00000001  // CAN Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRADC register.
  //
  //*****************************************************************************
  #define SYSCTL_SRADC_R1         0x00000002  // ADC Module 1 Software Reset
  #define SYSCTL_SRADC_R0         0x00000001  // ADC Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRACMP register.
  //
  //*****************************************************************************
  #define SYSCTL_SRACMP_R0        0x00000001  // Analog Comparator Module 0
                                              // Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRPWM register.
  //
  //*****************************************************************************
  #define SYSCTL_SRPWM_R1         0x00000002  // PWM Module 1 Software Reset
  #define SYSCTL_SRPWM_R0         0x00000001  // PWM Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRQEI register.
  //
  //*****************************************************************************
  #define SYSCTL_SRQEI_R1         0x00000002  // QEI Module 1 Software Reset
  #define SYSCTL_SRQEI_R0         0x00000001  // QEI Module 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SREEPROM
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SREEPROM_R0      0x00000001  // EEPROM Module Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SRWTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SRWTIMER_R5      0x00000020  // Wide Timer 5 Software Reset
  #define SYSCTL_SRWTIMER_R4      0x00000010  // Wide Timer 4 Software Reset
  #define SYSCTL_SRWTIMER_R3      0x00000008  // Wide Timer 3 Software Reset
  #define SYSCTL_SRWTIMER_R2      0x00000004  // Wide Timer 2 Software Reset
  #define SYSCTL_SRWTIMER_R1      0x00000002  // Wide Timer 1 Software Reset
  #define SYSCTL_SRWTIMER_R0      0x00000001  // Wide Timer 0 Software Reset

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCWD register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCWD_R1        0x00000002  // Watchdog Timer 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCWD_R0        0x00000001  // Watchdog Timer 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCTIMER_R5     0x00000020  // Timer 5 Run Mode Clock Gating
                                              // Control
  #define SYSCTL_RCGCTIMER_R4     0x00000010  // Timer 4 Run Mode Clock Gating
                                              // Control
  #define SYSCTL_RCGCTIMER_R3     0x00000008  // Timer 3 Run Mode Clock Gating
                                              // Control
  #define SYSCTL_RCGCTIMER_R2     0x00000004  // Timer 2 Run Mode Clock Gating
                                              // Control
  #define SYSCTL_RCGCTIMER_R1     0x00000002  // Timer 1 Run Mode Clock Gating
                                              // Control
  #define SYSCTL_RCGCTIMER_R0     0x00000001  // Timer 0 Run Mode Clock Gating
                                              // Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCGPIO
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCGPIO_R5      0x00000020  // GPIO Port F Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCGPIO_R4      0x00000010  // GPIO Port E Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCGPIO_R3      0x00000008  // GPIO Port D Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCGPIO_R2      0x00000004  // GPIO Port C Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCGPIO_R1      0x00000002  // GPIO Port B Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCGPIO_R0      0x00000001  // GPIO Port A Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCDMA register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCDMA_R0       0x00000001  // uDMA Module Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCHIB register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCHIB_R0       0x00000001  // Hibernation Module Run Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCUART
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCUART_R7      0x00000080  // UART Module 7 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R6      0x00000040  // UART Module 6 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R5      0x00000020  // UART Module 5 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R4      0x00000010  // UART Module 4 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R3      0x00000008  // UART Module 3 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R2      0x00000004  // UART Module 2 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R1      0x00000002  // UART Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCUART_R0      0x00000001  // UART Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCSSI register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCSSI_R3       0x00000008  // SSI Module 3 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCSSI_R2       0x00000004  // SSI Module 2 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCSSI_R1       0x00000002  // SSI Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCSSI_R0       0x00000001  // SSI Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCI2C register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCI2C_R3       0x00000008  // I2C Module 3 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCI2C_R2       0x00000004  // I2C Module 2 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCI2C_R1       0x00000002  // I2C Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCI2C_R0       0x00000001  // I2C Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCUSB register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCUSB_R0       0x00000001  // USB Module Run Mode Clock Gating
                                              // Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCCAN register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCCAN_R1       0x00000002  // CAN Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCCAN_R0       0x00000001  // CAN Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCADC register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCADC_R1       0x00000002  // ADC Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCADC_R0       0x00000001  // ADC Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCACMP
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCACMP_R0      0x00000001  // Analog Comparator Module 0 Run
                                              // Mode Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCPWM register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCPWM_R1       0x00000002  // PWM Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCPWM_R0       0x00000001  // PWM Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCQEI register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCQEI_R1       0x00000002  // QEI Module 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCQEI_R0       0x00000001  // QEI Module 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCEEPROM
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCEEPROM_R0    0x00000001  // EEPROM Module Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_RCGCWTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_RCGCWTIMER_R5    0x00000020  // Wide Timer 5 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCWTIMER_R4    0x00000010  // Wide Timer 4 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCWTIMER_R3    0x00000008  // Wide Timer 3 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCWTIMER_R2    0x00000004  // Wide Timer 2 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCWTIMER_R1    0x00000002  // Wide Timer 1 Run Mode Clock
                                              // Gating Control
  #define SYSCTL_RCGCWTIMER_R0    0x00000001  // Wide Timer 0 Run Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCWD register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCWD_S1        0x00000002  // Watchdog Timer 1 Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_SCGCWD_S0        0x00000001  // Watchdog Timer 0 Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCTIMER_S5     0x00000020  // Timer 5 Sleep Mode Clock Gating
                                              // Control
  #define SYSCTL_SCGCTIMER_S4     0x00000010  // Timer 4 Sleep Mode Clock Gating
                                              // Control
  #define SYSCTL_SCGCTIMER_S3     0x00000008  // Timer 3 Sleep Mode Clock Gating
                                              // Control
  #define SYSCTL_SCGCTIMER_S2     0x00000004  // Timer 2 Sleep Mode Clock Gating
                                              // Control
  #define SYSCTL_SCGCTIMER_S1     0x00000002  // Timer 1 Sleep Mode Clock Gating
                                              // Control
  #define SYSCTL_SCGCTIMER_S0     0x00000001  // Timer 0 Sleep Mode Clock Gating
                                              // Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCGPIO
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCGPIO_S5      0x00000020  // GPIO Port F Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCGPIO_S4      0x00000010  // GPIO Port E Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCGPIO_S3      0x00000008  // GPIO Port D Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCGPIO_S2      0x00000004  // GPIO Port C Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCGPIO_S1      0x00000002  // GPIO Port B Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCGPIO_S0      0x00000001  // GPIO Port A Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCDMA register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCDMA_S0       0x00000001  // uDMA Module Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCHIB register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCHIB_S0       0x00000001  // Hibernation Module Sleep Mode
                                              // Clock Gating Control

