imahjoub/UniversalBareMetal/Src/Target/tm4c123gxl/Mcal/Reg.h
  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCUART
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCUART_S7      0x00000080  // UART Module 7 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S6      0x00000040  // UART Module 6 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S5      0x00000020  // UART Module 5 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S4      0x00000010  // UART Module 4 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S3      0x00000008  // UART Module 3 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S2      0x00000004  // UART Module 2 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S1      0x00000002  // UART Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCUART_S0      0x00000001  // UART Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCSSI register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCSSI_S3       0x00000008  // SSI Module 3 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCSSI_S2       0x00000004  // SSI Module 2 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCSSI_S1       0x00000002  // SSI Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCSSI_S0       0x00000001  // SSI Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCI2C register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCI2C_S3       0x00000008  // I2C Module 3 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCI2C_S2       0x00000004  // I2C Module 2 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCI2C_S1       0x00000002  // I2C Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCI2C_S0       0x00000001  // I2C Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCUSB register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCUSB_S0       0x00000001  // USB Module Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCCAN register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCCAN_S1       0x00000002  // CAN Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCCAN_S0       0x00000001  // CAN Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCADC register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCADC_S1       0x00000002  // ADC Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCADC_S0       0x00000001  // ADC Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCACMP
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCACMP_S0      0x00000001  // Analog Comparator Module 0 Sleep
                                              // Mode Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCPWM register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCPWM_S1       0x00000002  // PWM Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCPWM_S0       0x00000001  // PWM Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCQEI register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCQEI_S1       0x00000002  // QEI Module 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCQEI_S0       0x00000001  // QEI Module 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCEEPROM
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCEEPROM_S0    0x00000001  // EEPROM Module Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_SCGCWTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_SCGCWTIMER_S5    0x00000020  // Wide Timer 5 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCWTIMER_S4    0x00000010  // Wide Timer 4 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCWTIMER_S3    0x00000008  // Wide Timer 3 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCWTIMER_S2    0x00000004  // Wide Timer 2 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCWTIMER_S1    0x00000002  // Wide Timer 1 Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_SCGCWTIMER_S0    0x00000001  // Wide Timer 0 Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCWD register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCWD_D1        0x00000002  // Watchdog Timer 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCWD_D0        0x00000001  // Watchdog Timer 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCTIMER_D5     0x00000020  // Timer 5 Deep-Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_DCGCTIMER_D4     0x00000010  // Timer 4 Deep-Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_DCGCTIMER_D3     0x00000008  // Timer 3 Deep-Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_DCGCTIMER_D2     0x00000004  // Timer 2 Deep-Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_DCGCTIMER_D1     0x00000002  // Timer 1 Deep-Sleep Mode Clock
                                              // Gating Control
  #define SYSCTL_DCGCTIMER_D0     0x00000001  // Timer 0 Deep-Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCGPIO
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCGPIO_D5      0x00000020  // GPIO Port F Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCGPIO_D4      0x00000010  // GPIO Port E Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCGPIO_D3      0x00000008  // GPIO Port D Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCGPIO_D2      0x00000004  // GPIO Port C Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCGPIO_D1      0x00000002  // GPIO Port B Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCGPIO_D0      0x00000001  // GPIO Port A Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCDMA register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCDMA_D0       0x00000001  // uDMA Module Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCHIB register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCHIB_D0       0x00000001  // Hibernation Module Deep-Sleep
                                              // Mode Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCUART
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCUART_D7      0x00000080  // UART Module 7 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D6      0x00000040  // UART Module 6 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D5      0x00000020  // UART Module 5 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D4      0x00000010  // UART Module 4 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D3      0x00000008  // UART Module 3 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D2      0x00000004  // UART Module 2 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D1      0x00000002  // UART Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCUART_D0      0x00000001  // UART Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCSSI register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCSSI_D3       0x00000008  // SSI Module 3 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCSSI_D2       0x00000004  // SSI Module 2 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCSSI_D1       0x00000002  // SSI Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCSSI_D0       0x00000001  // SSI Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCI2C register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCI2C_D3       0x00000008  // I2C Module 3 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCI2C_D2       0x00000004  // I2C Module 2 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCI2C_D1       0x00000002  // I2C Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCI2C_D0       0x00000001  // I2C Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCUSB register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCUSB_D0       0x00000001  // USB Module Deep-Sleep Mode Clock
                                              // Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCCAN register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCCAN_D1       0x00000002  // CAN Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCCAN_D0       0x00000001  // CAN Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCADC register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCADC_D1       0x00000002  // ADC Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCADC_D0       0x00000001  // ADC Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCACMP
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCACMP_D0      0x00000001  // Analog Comparator Module 0
                                              // Deep-Sleep Mode Clock Gating
                                              // Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCPWM register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCPWM_D1       0x00000002  // PWM Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCPWM_D0       0x00000001  // PWM Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCQEI register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCQEI_D1       0x00000002  // QEI Module 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCQEI_D0       0x00000001  // QEI Module 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCEEPROM
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCEEPROM_D0    0x00000001  // EEPROM Module Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_DCGCWTIMER
  // register.
  //
  //*****************************************************************************
  #define SYSCTL_DCGCWTIMER_D5    0x00000020  // Wide Timer 5 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCWTIMER_D4    0x00000010  // Wide Timer 4 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCWTIMER_D3    0x00000008  // Wide Timer 3 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCWTIMER_D2    0x00000004  // Wide Timer 2 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCWTIMER_D1    0x00000002  // Wide Timer 1 Deep-Sleep Mode
                                              // Clock Gating Control
  #define SYSCTL_DCGCWTIMER_D0    0x00000001  // Wide Timer 0 Deep-Sleep Mode
                                              // Clock Gating Control

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRWD register.
  //
  //*****************************************************************************
  #define SYSCTL_PRWD_R1          0x00000002  // Watchdog Timer 1 Peripheral
                                              // Ready
  #define SYSCTL_PRWD_R0          0x00000001  // Watchdog Timer 0 Peripheral
                                              // Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRTIMER register.
  //
  //*****************************************************************************
  #define SYSCTL_PRTIMER_R5       0x00000020  // Timer 5 Peripheral Ready
  #define SYSCTL_PRTIMER_R4       0x00000010  // Timer 4 Peripheral Ready
  #define SYSCTL_PRTIMER_R3       0x00000008  // Timer 3 Peripheral Ready
  #define SYSCTL_PRTIMER_R2       0x00000004  // Timer 2 Peripheral Ready
  #define SYSCTL_PRTIMER_R1       0x00000002  // Timer 1 Peripheral Ready
  #define SYSCTL_PRTIMER_R0       0x00000001  // Timer 0 Peripheral Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRGPIO register.
  //
  //*****************************************************************************
  #define SYSCTL_PRGPIO_R5        0x00000020  // GPIO Port F Peripheral Ready
  #define SYSCTL_PRGPIO_R4        0x00000010  // GPIO Port E Peripheral Ready
  #define SYSCTL_PRGPIO_R3        0x00000008  // GPIO Port D Peripheral Ready
  #define SYSCTL_PRGPIO_R2        0x00000004  // GPIO Port C Peripheral Ready
  #define SYSCTL_PRGPIO_R1        0x00000002  // GPIO Port B Peripheral Ready
  #define SYSCTL_PRGPIO_R0        0x00000001  // GPIO Port A Peripheral Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRDMA register.
  //
  //*****************************************************************************
  #define SYSCTL_PRDMA_R0         0x00000001  // uDMA Module Peripheral Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRHIB register.
  //
  //*****************************************************************************
  #define SYSCTL_PRHIB_R0         0x00000001  // Hibernation Module Peripheral
                                              // Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRUART register.
  //
  //*****************************************************************************
  #define SYSCTL_PRUART_R7        0x00000080  // UART Module 7 Peripheral Ready
  #define SYSCTL_PRUART_R6        0x00000040  // UART Module 6 Peripheral Ready
  #define SYSCTL_PRUART_R5        0x00000020  // UART Module 5 Peripheral Ready
  #define SYSCTL_PRUART_R4        0x00000010  // UART Module 4 Peripheral Ready
  #define SYSCTL_PRUART_R3        0x00000008  // UART Module 3 Peripheral Ready
  #define SYSCTL_PRUART_R2        0x00000004  // UART Module 2 Peripheral Ready
  #define SYSCTL_PRUART_R1        0x00000002  // UART Module 1 Peripheral Ready
  #define SYSCTL_PRUART_R0        0x00000001  // UART Module 0 Peripheral Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRSSI register.
  //
  //*****************************************************************************
  #define SYSCTL_PRSSI_R3         0x00000008  // SSI Module 3 Peripheral Ready
  #define SYSCTL_PRSSI_R2         0x00000004  // SSI Module 2 Peripheral Ready
  #define SYSCTL_PRSSI_R1         0x00000002  // SSI Module 1 Peripheral Ready
  #define SYSCTL_PRSSI_R0         0x00000001  // SSI Module 0 Peripheral Ready

  //*****************************************************************************
  //
  // The following are defines for the bit fields in the SYSCTL_PRI2C register.
  //
  //*****************************************************************************
  #define SYSCTL_PRI2C_R3         0x00000008  // I2C Module 3 Peripheral Ready
  #define SYSCTL_PRI2C_R2         0x00000004  // I2C Module 2 Peripheral Ready
  #define SYSCTL_PRI2C_R1         0x00000002  // I2C Module 1 Peripheral Ready
  #define SYSCTL_PRI2C_R0         0x00000001  // I2C Module 0 Peripheral Ready

